{
    "book_name": "Abu Dawood",
    "urdu_text": "نام و نسب: سلیمان نام، ابوداود کنیت، اور نسب یہ ہے: سلیمان بن اشعث بن اسحاق بن بشیر بن شداد بن عمرو بن عمران ازدی سجستانی۔ ولادت و خاندان: امام ابوداود رحمۃ اللہ علیہ کی پیدائش آپ کے اپنے بیان کے مطابق ۲۰۲ ھ میں ہوئی، قبیلہ ”ازد“ سے تعلق کی بناء پر ازدی کہلاتے ہیں۔ سجستانی نسبت: سیستان یا (سجستان) میں سکونت کی وجہ سے ہے، جو سندھ و ہرات کے مابین اور قندھار (افغانستان) کے متصل واقع ہے۔ طلب حدیث کے لیے بلاد اسلامیہ کا سفر: آپ نے احادیث کی روایت و تحصیل کے لئے بلاد اسلامیہ کے علمی مقامات کا سفر کیا، جن میں مصر، شام، حجاز (مکہ مکرمہ و مدینہ منورہ)، بغداد، جزیرہ، بصرہ اور خراسان وغیرہ خصوصیت سے قابل ذکر ہیں۔ کئی بار بغداد تشریف لے گئے، نیساپور، مرو، اصبہان وغیرہ کے محدثین کی خدمت میں حاضر ہو کر ان سے استفادہ کیا۔ اساتذہ و شیوخ: آپ کے اساتذہ وشیوخ حدیث تین سو (300) سے زائد ہیں جن میں سے بعض مشاہیر درج ذیل ہیں: ➊ احمد بن حنبل، ➋ اسحاق بن راہویہ، ➌ ابو ثور، ➍ یحییٰ بن معین، ➎ ابوبکر بن ابی شیبہ، ➏ عثمان بن ابی شیبہ، ➐ سعید بن منصور، ➑ سلیمان بن حرب، ➒ سلیمان بن عبدالرحمن دمشقی، ➓ شجاع بن مخلد، ⓫ محمد بن بشار بندار بصری، ⓬ محمد بن صباح نزار دولابی، ⓭ محمد بن منھال، ⓮ مسدد بن مسرہد، ⓯ قعنبی وغیرہ وغیرہ۔ تلامذہ: امام ابوداود سے بہت سارے علمائے حدیث کو شرف تلمذ حاصل ہے، ان میں سے سنن کے رواۃ مندرجہ ذیل ہیں: ➊ ابوعمرو احمد بن علی بن حسن بصری ➋ ابوعلی محمد بن احمد بن عمرو لؤلؤی (م 333 ھ) ➌ ابوالطیب احمد بن ابراہیم اشنانی بغدادی ➍ ابوسعید احمد بن محمد بن سعید بن زیاد اعرابی (م 340 ھ) ➎ ابوبکر محمد بن عبد الرزاق بن داسہ (م 346 ھ) ➏ ابوالحسن علی بن الحسن بن العبدالانصاری (م 328 ھ) ➐ ابوعیسی اسحاق بن موسی بن سعید الرملی الورّاق (م 320 ھ) ➑ ابواسامہ محمد بن عبد الملک بن یزید الرواس ➒ ابوسالم محمد بن سعید الجلودی آپ کی دوسری کتابوں کے رواۃ میں: ➊ ابوعبد اللہ محمد بن احمد بصری ➋ ابوبکر احمد بن سلیمان النجاد ➌ اسماعیل بن محمد الصفار ➍ ابوعبید محمد بن علی الآجری اور دوسرے مشہور علماء میں آپ کے صاحبزادہ: ➋ ابوعوانہ یعقوب بن اسحاق الاسفرائینی ➌ حرب بن اسماعیل کرمانی ➍ زکریا الساجی ➎ ابوبکر محمد بن خلال ➏ اور احمد بن یسین ہروی وغیرہ بھی آپ کے تلامذہ میں شامل ہیں۔ صحاح ستہ کے مصنفین میں سے: ➊ امام ترمذی ➋ امام نسائی امام ترمذی اور امام نسائی کو بھی آپ سے تلمذ حاصل ہے۔ آپ کے شیخ امام احمد نے بھی آپ سے حدیث عتیرہ روایت کی ہے۔ حفظ و ضبط: امام صاحب کو حفاظ حدیث میں بہت بڑا مقام حاصل ہے۔ ابو حاتم: ابو حاتم کا بیان ہے: ”وہ حفظ کے اعتبار سے دنیا کے اماموں میں سے ایک تھے“۔ [تهذيب الكمال 11؍365] محمد بن مخلد: محمد بن مخلد فرماتے ہیں: ”ابوداود ایک لاکھ حدیث کا پورا مذاکرہ کیا کرتے تھے، اور جب آپ نے سنن مرتب کی تو تمام اہل زمانہ نے آپ کے حفظ اور سبقتِ علمی کا اعتراف کیا“۔ [تهذيب الكمال 11؍365] امام نووی: امام نووی فرماتے ہیں: ”جمہور علمائے اسلام کو ان کے کمال حفظ کا اعتراف جرح و تعدیل: علل حدیث میں آپ کو ملکہ راسخہ عطا ہوا تھا، جیسا کہ ممتاز علماء نے اس فن میں آپ کی مہارت کا اعتراف کیا ہے۔ آپ کی قوت تمییز، اور نقد و نظر پر اساطین فن کا اتفاق ہے۔ احمد بن محمد بن یسی: احمد بن محمد بن یسین الہروی فرماتے ہیں: ”ابوداود حدیث نبوی، اور علم و علل اسانید کے حفاظ میں سے ہیں، عبادت پاکدامنی، صلاح اور ورع وتقوی میں اعلی مرتبہ پر فائز ہیں۔“ [السير 13؍ 211، تهذيب الكمال 11؍365] ابوحاتم بن حبان: ابوحاتم بن حبان کا ارشاد ہے: ”ابوداود فقہ، علم، حفظ، عبادت، ورع و تقوی، اور پختگی و مہارت کے اعتبار سے دنیا کے اماموں میں سے ایک امام تھے، آپ نے احادیث کی جمع و ترتیب اور تصنیف و تالیف کا کام کیا، اور سنن کا دفاع کیا۔“ [السير 13؍ 212، تهذيب التهذيب 4؍ 172] حافظ ابن مندہ: حافظ ابن مندہ کا بیان ہے: ”احادیث کی تخریج، معلول و ثابت، اور غلط و صحیح میں تمییز کرنے والے چار آدمی ہیں: بخاری، مسلم، ان کے بعد ابوداود اور نسائی۔“ [شروط ابن منده، السير 13؍ 212، تهذيب الكمال 11؍365] ورع و تقویٰ: مسلم بن قاسم: مسلم بن قاسم مسلم آپ کے ورع و تقوی کا ذکر کرتے ہوئے فرماتے ہیں: ”آپ ثقہ اور زاہد تھے، حدیث کے ماہر تھے، اپنے وقت کے اس فن کے امام تھے“۔ حافظ ابوبکر الخلال: حافظ ابوبکر الخلال فرماتے ہیں: ”امام ابوداود اپنے عہد کے متفوق امام ہیں، آپ کے زمانہ میں آپ سے بڑھ کر کوئی آدمی ایسا نہیں تھا جو علوم کی تخریج کی معرفت، اور مواضع حدیث کی بصیرت میں آپ سے بڑا ہو، آپ ورع و تقوی میں فائق و برتر تھے۔“ [تهذيب الكمال 11؍ 364] ابوحاتم بن حبان اور احمد بن محمد بن یسین الہروی: اسی طرح ابوحاتم بن حبان اور احمد بن محمد بن یسین الہروی وغیرہ نے بھی آپ کے ورع وتقوی کا تذکرہ خصوصی طور پر کیا ہے۔ امام کے ورع وتقویٰ کے لئے یہ مثال ہی کافی ہے کہ آپ اپنی ایک آستین کشادہ اور دوسری تنگ رکھا کرتے تھے، جب آپ سے دریافت کیا گیا تو فرمایا: ”ایک آستین تو اس لئے کشادہ رکھتا ہوں کہ اس میں اپنی کتاب کے کچھ اجزاء رکھ لوں، اور دوسری کا کشادہ رکھنا غیر ضروری ہے۔“ [السير 13؍ 217] آپ کا یہ فعل ورع و تقوی کے ساتھ احتیاط فی الحدیث یا احتیاط فی الروایت کی بھی غمازی کرتا ہے۔ فن حدیث میں تبحر و کمال: حدیث میں جلالت علم کا اعتراف کرتے ہوئے: امام حاکم: امام حاکم فرماتے ہیں: ”ابوداود اپنے وقت کے اہل حدیث کے بلا مقابلہ امام تھے۔“ [السير 13؍ 212] علّان بن عبدالصمد: علّان بن عبدالصمد نے یہ رائے قائم کی ہے کہ ”آپ میدان حدیث کے شہسوار تھے۔“ [السير 13؍212] حافظ محمد بن اسحاق الصاغانی، اور ابراہیم الحربی: حافظ محمد بن اسحاق الصاغانی، اور ابراہیم الحربی حدیث میں آپ کی مہارت تامہ کو یوں بیان کرتے ہیں: «الين لأبي داود الحديث كما الين لداود الحديد» یعنی ”ابوداود کے لئے حدیث ویسے ہی نرم اور آسان بنا دی گئی جیسے داود علیہ السلام کے لئے لوہا نرم کر دیا گیا۔“ [السير13؍212 و213، تهذيب التهذيب 4؍ 172] موسی بن ہارون: موسی بن ہارون فرماتے ہیں کہ ”ابوداود دنیا میں حدیث کی خدمت کے لئے پیدا کئے گئے اور آخرت میں جنت میں رہنے کے لئے۔“ [السير 13؍212] نیز فرمایا کہ ”میں نے ابوداود سے افضل آدمی نہیں دیکھا۔“ [السير 13؍ 213] فقہی ذوق و بصیرت: امام ابوداود کو جس طرح حدیث میں امامت کا درجہ ملا ہے اسی طرح آپ کو فقہ و اجتہاد میں بھی ایک امتیازی حیثیت حاصل تھی، فقہی بصیرت اور عمیق نظر رکھنے کے سبب بعض علماء نے تو آپ کو فقہ و اجتہاد میں امام بخاری کے بعد دوسرا درجہ دیا ہے، اور لکھا ہے کہ امام بخاری کے بعد امام ابواود کا مرتبہ سب سے بلند ہے، اور پھر جملہ اصحاب تراجم و طبقات نے آپ کے اس وصف کا تذکرہ کیا ہے۔ آپ کے اس ذوق اور بصیرت کا اندازہ اس بات سے بخوبی لگ سکتا ہے کہ آپ نے اپنی کتاب ”کتاب السنن“ کو صرف احکام ومسائل کی جمع و ترتیب تک ہی محدود رکھا۔ امام ابوحاتم: امام ابوحاتم آپ کو امام فقہ قرار دیتے ہیں۔ امام ابواسحاق شیرازی: امام ابواسحاق شیرازی نے اصحاب صحاح ستہ میں سے صرف امام ابوداود ہی کو طبقات فقہاء میں شمار کیا ہے، اور یہ امتیاز آپ کو اسی فقہی بصیرت اور فقہی ذوق کی بدولت حاصل ہوا ہے۔ فقہی مذہب: ابواسحاق شیرازی: ابواسحاق شیرازی نے امام صاحب کا تذکرہ کرتے ہوئے ان کی نسبت حنابلہ کی طرف کر دی ہے، نیز طبقات حنابلہ میں آپ کا ذکر ہے، اور بعض نے آپ کو شافعی المذہب لکھ دیا، لیکن یہ محض درسی نسبت ہے، اور یہ غلط فہمی غالبا امام احمد بن حنبل اور امام شافعی کے اکثر و بیشتر مسائل میں موافقت کے سبب ہوئی ہے۔ نواب صدیق حسن: نواب صدیق حسن حافظ ابن حزم سے نقل فرماتے ہیں کہ ”ان اہل علم کے بعد بخاری، مسلم، ابوداود اور نسائی آئے، ان میں سے کسی نے اپنے سے پہلے کے امام کے قول کی تقلید نہیں کی، بلکہ ہر ایک نے تقلید سے منع کیا اور اس پر نکیر کی۔“ حافظ ذہبی: حافظ ذہبی آپ کے تبحر علمی اور فقہ و حدیث میں امامت پر تبصرہ کرتے ہوئے فرماتے ہیں: ابوداود حدیث اور فنون حدیث میں امامت کے ساتھ کبار فقہاء میں سے ہیں، آپ کی کتاب السنن اس پر دلالت کرتی ہے، آپ اصحاب امام احمد کے منتخب لوگوں میں سے ہیں، امام احمد کے مجلس کی ایک مدت تک پابندی کی، اور اصول و فروع کے دقیق مسائل پر آپ سے سوالات کئے، آپ اتباع سنت اور سنت کے سامنے سر تسلیم خم کرنے کے باب میں، اور دشوار گزار کلام ومسائل میں غور و خوض نہ کرنے میں سلف کے مذہب پر تھے۔ [السير 13؍215] علامہ طاہر الجزائری: اسی طرح علامہ طاہر الجزائری کے بیان سے بھی امام ابوداود کے کسی دوسرے امام کے مقلد ہو نے کی نفی اور تردید ہوتی ہے، فرماتے ہیں: «أما البخاري وأبو داود فإمامان فى الفقه وكانا من أهل الاجتهاد» ”تو یہ دونوں بخاری اور ابوداود فقہ کے امام ہیں، اور دونوں اہل اجتہاد میں سے ہیں۔“ اولاد: اولاد میں صرف ایک صاحبزادے محدث ابوبکر عبداللہ کا ذکر ملتا ہے۔ وفات: امام صاحب کی وفات (16) شوال بروز جمعہ 275 ھ (73) برس کی عمر میں ہوئی۔ «رحمة الله عليه رحمة واسعة»"
}