{
    "book_name": "Bayhaqi",
    "urdu_text": "نام : امام ابی بکر احمد بن الحسین البیہقی نام و نسب امام ابو بکر احمد بن حسین بن علی بن عبداللہ بن موسیٰ النیسابوری، الحسروجردی، البیہقي  رحمۃ اللہ علیہ ۔ شعبان ۳۸۴ ھ میں بیہقی کے علاقہ خسرو جرد میں پیدا ہوئے ۔ علم و فضل سے معمور ماحول میں پرورش پائی ۔ ابتدائی لکھنا پڑھنا وہیں کے مکاتب میں سیکھا، تقریباً پندرہ برس کی عمر میں باقاعدہ علمی مجالس میں شرکت شروع کر دی اور ہمہ تن ہوش حصول علم میں مشغول ہوگئے۔ امامِ بیہقی  رحمۃ اللہ علیہ کے خاندان کے حالات کے حوالے سے اگرچہ تاریخ کے اوراق خالی ہیں لیکن بچپن میں آپ کی علم کی طرف بے پناہ رغبت اور اپنے آپ کو علم کی تحصیل کے لیے وقف کر دینا اس بات کی دلیل ہے کہ خاندان میں علمی ذوق شوق موجود تھا اور اس سے معاشی اعتبار سے خاندان کی اطمینان بخش کیفیت کا بھی احساس ہوتا ہے کہ جس میں ایک نوجوان کو ضروریات زندگی کے فراہم کرنے سے قطعی الگ کرکے فقط تعلیم و تعلم کے لیے آزاد چھوڑ دیا جائے۔ امام بیہقی رحمۃ اللہ علیہ نے حصولِ علم کا آغاز کس چیز سے کیا اس بارے میں کچھ صراحت موجود نہیں لیکن مسلمانوں کے عمومی معمولات کو دیکھتے ہوئے یہ کہنا بہر حال ممکن ہے کہ آپ نے ابتداء حفظِ قرآن سے ہی کی ہوگی اور پھر مجالسِ حدیث و فقہ میں شرکت اختیار کی ہوگی۔ محدثین کے طریقہ کے موافق آپ نے سب سے اول اپنے علاقے کے اہلِ علم سے کسبِ فیض کیا اور پھر باقی بلادِعلم کی طرف رختِ سفر باندھا۔ گویا کہ آپ کی پہلی علمی جولان گاہ بلادِخراسان ہی تھے اور اس کے بعد تقریباً تمام دنیا کے علمی مراکز میں جا جا کر وقت کے اساطینِ علم سے علمی سیرابی کا سامان کیا۔ خراسان اور خراسان سے باہر جس شہروں کی طرف آپ نے علمی پیاس بجھانے کے لیے سفر کیا، ان میں توقان، اسفرآئین، طوس، مھرجان، أسد آباد، ھمدان، دامغان، اَجھان، رے، طابران، نیشاپور، روذبار، بغداد، کوفہ اور مکہ مکرمہ شامل ہیں۔ گویا کہ حضرتِ امام نے خراسان کے تمام شہروں میں جو کچھ علمی سرمایہ تھا وہ سب جمع کر لیا اور پھر عراق اور حجاز کے بڑے علمی مراکز کا رُخ کیا، ان مراکز میں آپ نے جن جن شیوخ سے استفادہ فرمایا اور خزانۂ علمیہ کے گوہر ہائے گراں مایہ کو جمع کیا ان کی تعداد کے بارے میں امام سبکی رحمۃ اللہ علیہ  نے طبقات الشافعیۃ میں لکھا ہے: بلغ شیوخہ أکثر من مائۃ شیخ ولم یقع للترمذی، ولانسائی ولا ابن ماجہ ’’ان کے شیوخ ایک سوسے بھی اوپر ہیں اور شیوخ کی یہ فراوانی امام ترمذی، نسائی اور ابن ماجہ میں سے کسی کو نصیب نہیں ہوئی۔‘‘ ڈاکٹر ضیاء الرحمن الاعظمیٰ نے المدخل الی السنن الکبرٰی کی تحقیق میں ذکر کیا ہے کہ میں جب سنن کبرٰی کا ابتداء سے آخر تک پورے اہتمام سے جائزہ لیا تو صرف سنن کبرٰی میں آپ کے اساتذہ کی تعداد کو ایک سو سے زیادہ پایا۔ جس میں نواسی حضرات کے حالات بھی انھیں مل گئے جنھیں کتاب میں درج کر دیا ہے اور بیالیس ایسے اساتذہ ہیں جن کے تفصیلی حالات تک آگاہی حاصل نہیں ہو سکی۔ یعنی ڈاکٹر  اعظمیٰ کی تحقیق کے موافق صرف سنن کبرٰی میں آپ کے اساتذہ کی تعداد ایک سواکتیس تک جاپہنچتی ہے۔ ان تمام اساتذہ کرام میں انتہائی شہرت کے حامل یہ حضرات ہیں: ابو الحسن محمد بن حسین العلوی، امام ابو عبداللہ الحاکم، ابو اسحاق، اسفرائینی، عبداللہ بن یوسف اصبھانی، ابو علی الروزباری، امام بزاز، ابو بکر ابن فورک رحمۃ اللہ علیہم وغیرہ۔ اخلاق و آداب سلف و صالحین کا خصوصی امتیاز یہ تھا کہ جس قدر ان کے پاس دولت علم ہوتی تھی اسی قدر ان کی زندگی عمل صالح سے بھی معمور ہوتی تھی اور عالم باعمل کی حقیقی تصویر ہوا کرتے تھے۔ بالکل ایسا ہی کچھ جناب امام بیہقی رحمۃ اللہ علیہ  کا طرزِ زندگی تھا کہ آپ بڑے زاہد عن الدنیا، انتہائی قانع، بہت بڑے متقی اور پارسا شخص تھے۔ آپ کے ان اوصاف کی گواہی اہل تاریخ نے دی ہے، امام ابن عساکر رحمۃ اللہ علیہ  رقم فرماتے ہیں: ’’مجھے شیخ ابو الحسن الفارسی نے جنابِ امام بیہقی رحمۃ اللہ علیہ  کی بابت لکھا کہ آپ سیرتِ علماء کا عملی نمونہ تھے، انتہائی تھوڑے پر قناعت فرمانے والے اور زہد و ورع کے اعلیٰ اوصاف سے مزین تھے اور حدیہ ہے کہ تادمِ زیست اسی طرزِ حیات پر کاربند رہے۔‘‘ تبیین کذب المفتری:۲۶۶ امام ابنِ کثیر  رحمۃ اللہ علیہ نے ان کے ایسے ہی اعلیٰ اخلاق کی گواہی دی ہے، آپ تحریر فرماتے ہیں: ’’آپ زاہد عن الدنیا، بہت تھوڑے پر راضی ہونے والے اور عبادت و ورع میں بہت آگے بڑھے ہوئے تھے۔‘‘ علمی مقام و مرتبہ آپ کو خدائے تعالیٰ نے آپ کی زندگی میں ہی بہت زیادہ علمی شان و شوکت سے بہرہ مند فرما دیا تھا۔ امام ابنِ عساکر رحمۃ اللہ علیہ  ابو الحسن الفارسی سے نقل کرتے ہیں: ابوبکر احمد بن الحسین البیہقی تمام اصنافِ علم کے امام، حدیث کے حافظ، بہت بڑے فقیہ اور اُصولی تھے۔ پھر متدین اور خدا سے ڈرنے والے بھی تھے۔ اپنے زمانے کے سب سے بڑے حافظِ حدیث، اور معاصرین میں ضبط و اتقان میں انفرادیت کے حامل تھے۔ امام ابو عبداللہ الحاکم رحمۃ اللہ علیہ  سے کثرت سے روایت کرنے والے کبار اصحاب میں آپ کا شمار ہوتا تھا اور پھر اس پر اُنھوں نے اپنی محنت و کاوش سے دیگر علوم میں بھی مہارت پیدا کی۔ کتابت اور حفظِ حدیث بچپن سے شروع کیا اور اسی میں ہی پلے بڑھے اور تفقہ فی الدین کی منازل طے کرتے ہوئے ان میں نکھار پیدا کیا اور اُصولِ دین میں مہارت حاصل کی۔ تبیین کذب المفتری:۲۶۶ ابن ناصر الدین رحمۃ اللہ علیہ  حضرتِ امام کے مناقب میں یوں رقم طراز ہیں: آپ حفظ و اتقان میں اپنے زمانہ کے نادرہ روز گار تھے۔ ثقہ اور بااعتماد امام تھے اور پورے خراسان کے بالاتفاق شیخ تھے۔ آپ کے رشحاتِ قلم کا زمانہ بہی خواہ ہے، جن میں السنن الکبری، السنن الصغریٰ، المعارف، الأسماء والصفات، دلائل النبوۃ، الآداب، الدعوات الکبیر، الترغیب والترھیب اور کتاب الزھد شامل ہیں۔ امام ذہبی  رحمۃ اللہ علیہ آپ کے بلند علمی پایہ پر عجب انداز میں روشنی ڈالتے ہیں، آپ لکھتے ہیں: اگر بیہقی  رحمۃ اللہ علیہ چاہتے تو اپنی علمی وسعت اور اختلافِ ائمہ پر حاوی ہونے کی بنا پر اس پر قادر تھے کہ ایک الگ اپنا مکتب فکر قائم کرتے اور اجتھادات سے علیحدہ طور پر دنیا کو مستفید کرتے۔ المدخل الی السنن الکبری:۱۶ عبدالغافر فارسی رحمۃ اللہ علیہ  آپ کی عظمت کایوں اعتراف کرتے ہیں: امام بیہقی رحمۃ اللہ علیہ  علم حدیث، علم فقہ اور علم علل الحدیث کے جامع تھے۔ خود آپ کے معاصر اور متاخرین علماء نے آپ کی قدر و منزلت کا نہ صرف اعتراف کیا ہے بلکہ یہاں تک کہا کہ وہ دیگر تمام علماء سے آگے نکل گئے تھے۔ پھر آپ کا خصوصی امتیاز یہ تھا کہ سنت نبوی کی محبت میں فنا تھے۔آپ نے سنن کو جس خوب صورتی سے جمع و ترتیب دیا ہے اس کی اس سے پہلے نظیر ملنا ممکن نہیں۔ شوافع پر آپ کے احسانات آپ چونکہ خود بھی مجتہد تھے اور تمام مذاہبِ فقہ کا انتہائی باریک بینی سے جائزہ لیا تھا؛ اس لیے تمام فقہاء کی آراء اور ان کے اُصول نہ صرف آپ کے سامنے عیاں تھے بلکہ آپ نے تمام کا ناقدانہ تجزیہ بھی کر رکھا تھا، اس لیے آپ نے سنت سے قریب تر ہونے کی وجہ سے اپنے لیے امام شافعی رحمۃ اللہ علیہ  کے مکتب فکر کا انتخاب کیا اور پھر اس کی وہ خدمت کی کہ علماء یہاں تک کہنے پر مجبور ہو گئے کہ دنیا میں کوئی بھی شافعی المسلک شخص ایسا نہیں کہ جس پر امام شافعی رحمۃ اللہ علیہ کے احسانات نہ ہوں سوائے امام بیہقی رحمۃ اللہ علیہ  کے، کہ جن کے مذہبِ شافعی کی نصرت میں لکھی گئی کتب کا احسان امام شافعی رحمۃ اللہ علیہ  پر ہے۔ تذکرۃ الحفاظ:۲؍۱۱۳۲ اسی لیے بعض حضرات نے خواب میں امام شافعی رحمۃ اللہ علیہ کو امام بیہقی رحمۃ اللہ علیہ  کی تعریف کرتے سنا۔ مذہبِ شافعی کے لیے خدمات کے حوالے سے ابن خلکان رحمۃ اللہ علیہ  رقم طراز ہیں: وہ پہلے شخص ہیں جنھوں نے امام شافعی رحمۃ اللہ علیہ  کی نصوص کو دس مجلدات میں جمع کیا اور کرۂ ارض پر ان سے زیادہ مذہب شافعی کی نصرت کرنے والا کوئی نہیں۔ ارشد تلامذہ کسی بھی عالم کے علمی مقام کا جہاں ان کی کتب سے اندازہ ہوتا ہے وہاں اس سے بھی بڑھ کر اس کا تعارف اس کے وہ ارشد تلامذہ ہوتے ہیں جنھیں وہ انتہائی محنت اور جانفشانی سے تیار کرتا ہے۔ بالکل ایسے ہی امام بیہقی رحمۃ اللہ علیہ  اگر اپنی گراں قدر تصانیف نہ بھی عالمِ وجود میں چھوڑ کر جاتے تو ان کو زندہ رکھنے کے لیے ان کے تلامذہ ہی کافی تھے۔ جنھوں نے آپ کی کتب کو آئندہ نسلوں کی طرف منتقل کیا اور ہمیشہ آپ کی ملازمت اختیار کی ہے، ان میں ابو عبداللہ محمد بن الفضل الفرادی، ابو عبداللہ محمد عبدالجبار بن محمد بن احمد البیہقي الخواری، ابو نصر علی بن مسعود بن محمد الشجاعی، ابو عبداللہ بن ابو مسعود الصاعدی، فرزندِ حضرت ِامام اسماعیل بن احمد البیہقي اور آپ کے پوتے ابو الحسن عبید اللہ بن محمد بن احمدj شامل ہیں۔ امام بیہقی نے جب اس کتاب کو تصنیف کرنا چاہا تو انہوں نے سرور کونین ﷺ کی سنتوں کو جمع کیا ور احکام شرعی کے سلسلہ میں جن کی ضرورت تھی ان میں صحابہ کرام کے آثار کو بھی جمع کیا خواہ وہ موقوف ہو یا مقطوع ان سب کو فقہ کے ابواب کے طرز پر جمع کیا۔ درپردہ آپ کا مقصد امام شافعی کے مذہب کو صحیح ثابت کرنا تھا اور یہ بھی واضح کرنا تھا کہ شافعی مذہب کتاب و سنت پر قائم ہے۔ اس کے ساتھ امام بیہقی یہ بھی چاہتے تھے کہ وہ مذہب کی مدد کرنے سے پہلے حدیث پر کام کریں۔ امام بیہقی نے نبیﷺ کی سنتوں پر جامع کتاب مرتب کی اور اس کا نام ’’السنن الکبریٰ‘‘ رکھا اور وضاحت کے ساتھ اس میں سنن پر احادیث جمع کیں اور صحابہ کے ان آثار کو جمع کیا جن کی ضرورت پڑتی ہے خواہ وہ آثار موقوف ہوں یا مقطوع۔ اس کا موضوع احکام کی وہ احادیث ہیں جنہیں فقہی ابواب پر مرتب کیا گیا ہے پس یہی کتاب کا اصل موضوع ہے امام بیہقی نے ’السنن الکبریٰ‘ میں عبارات کو مختصر کرنے کا طریقہ استعمال کیا ہے ’’حافظ ابو عبد اللہ‘‘ اس سے مراد امام بیہقی اپنے استاد محمد بن عبداللہ حاکم نیشاپوری لیتے ہیں اور جب حدثنا أبو عبد اللہ یا قال عبد اللہ کہتے ہیں تو اس سے مراد امام حاکم لیتے ہیں۔ ’’ابو بکر ابن اسحاق‘‘ اس سے آپ امام محمد بن اسحاق بن خزیمہ مراد لیتے ہیں۔ ’’ابو حمد‘‘ اس کنیت سے امام عبداللہ بن عدی جرجانی مراد لیتے ہیں جو ابن عدی سے مشہور ہیں۔ ’’علی ‘‘ یا ’’علی بن عمر ‘‘ اس سے وہ امام دار قطنی مراد لیتے ہیں۔ امام بیہقی نے اپنی تمام تالیفات میں یہی طریقہ استعمال کیا۔ اپنے ہم عصر اساتذہ سے حدیث بیان کرتے ہوئے کنیت اور القاب کا بہت زیادہ استعمال کرتے ہیں امام بیہقی کا تعارف امام ابوبکر احمد بن الحسین بیہقی (پیدائش: ستمبر 994ء— وفات: 9 اپریل 1066ء) مشہور ائمۃ الحدیث اور صاحب تصنیف ہیں۔ نام آپ کا اسم گرامی ابو بکر احمد بن حسین بن علی بن عبد اللہ بن موسیٰ خسروجردی، بیہقی، خراسانی ہے۔ انہیں امام بیہقی بھی لکھا جاتا ہے ولادت آپ شعبان 384ھ 994ء میں خسرو جرد نامی بستی میں پیدا ہوئے جو بیہق(نیشاپور) کے نواح میں واقع ہے ۔ سیرت وخصائص امام بیہقی تمام اصنافِ علم کے امام، حدیث کے حافظ، بہت بڑے فقیہ اور اُصولی تھے۔ پھر متدین اور خدا سے ڈرنے والے بھی تھے۔ اپنے زمانے کے سب سے بڑے حافظِ حدیث اور معاصرین میں ضبط و اتقان میں انفرادیت کے حامل تھے۔ امام ابو عبد اللہ الحاکم سے کثرت سے روایت کرنے والے کبار اصحاب میں آپ کا شمار ہوتا تھا اور پھر اس پر اُنھوں نے اپنی محنت و کاوش سے دیگر علوم میں بھی مہارت پیدا کی۔ کتابت اور حفظِ حدیث بچپن سے شروع کیا اور اسی میں ہی پلے بڑھے اور تفقہ فی الدین کی منازل طے کرتے ہوئے ان میں نکھار پیدا کیا اور اُصولِ دین میں مہارت حاصل کی۔سلف و صالحین کا خصوصی امتیاز یہ تھا جس قدر ان کے پاس دولت علم ہوتی تھی اسی قدر ان کی زندگی عمل صالح سے بھی معمور ہوتی تھی اور عالم باعمل کی حقیقی تصویر ہوا کرتے تھے، بالکل ایسا ہی کچھ جناب امام بیہقی رحمۃ اللہ علیہ کا طرزِ زندگی تھا کہ آپ بڑے زاہد عن الدنیا، انتہائی قانع، بہت بڑے متقی اور پارسا شخص تھے۔ آپ کے ان اوصاف کی گواہی اہل تاریخ نے دی ہے۔ امام ابن عساکر رحمۃ اللہ علیہ رقم فرماتے ہیں:\"مجھے شیخ ابو الحسن الفارسی نے جنابِ امام بیہقی کی بابت لکھا کہ آپ سیرتِ علما کا عملی نمونہ تھے، انتہائی تھوڑے پر قناعت فرمانے والے اور زہد و ورع کے اعلیٰ اوصاف سے مزین تھے اور حدیہ ہے کہ تادمِ زیست اسی طرزِ حیات پر کاربند رہے\"۔آپ زاہد عن الدنیا، بہت تھوڑے پر راضی ہونے والے اور عبادت و ورع میں بہت آگے بڑھے ہوئے تھے۔آپ حفظ و اتقان میں اپنے زمانہ کے نادرہ روز گار تھے۔ ثقہ اور بااعتماد امام تھے اور پورے خراسان کے بالاتفاق شیخ تھے۔ وفات امام بیہقی کی وفات کے سلسلے میں امام ذہبی لکھتے ہیں کہ آخر عمر میں وہ نیشاپور اُٹھ گئے تھے اور وہاں اپنی کتب کے درس میں مشغول ہو گئے، لیکن جلد ہی وقتِ رحلت آن پہنچا اور 10 جمادی الاولیٰ 458ھ- 1066ء میں نیشاپور میں ہی داعیٔ اجل کو لبیک کہا اور بیہقی میں لاکر آپ کو سپرد خاک کیا گیا وفات امام بیہقی رحمۃ اللہ علیہ  کی وفات کے سلسلے میں امام ذہبی رحمۃ اللہ علیہ  لکھتے ہیں کہ آخر عمر میں وہ نیشاپور اُٹھ گئے تھے اور وہاں اپنی کتب کے درس میں مشغول ہو گئے، لیکن جلد ہی وقتِ رحلت آن پہنچا اور ۱۰ جمادی الاولیٰ ۴۵۸ھ میں نیشاپور میں ہی داعیٔ اجل کو لبیک کہا اور بیہقی میں لاکر آپ کو سپرد خاک کیا گیا۔ ؒ علیہ رحمۃ واسعۃ"
}