{
    "book_name": "Bukhari",
    "urdu_text": "سوانح حیات: امام المسلمین، قدوة الموحدین، امیرالمحدثین سیدنا امام ابو عبداللہ محمد بن اسماعیل بخاری رحمہ اللہ علیہ اسلام کے ان مایہ ناز فرزندوں میں سے ہیں جن کا نام نامی اسلام اور قرآن کے ساتھ ساتھ دنیا میں زندہ رہے گا۔ احادیث رسول صلی اللہ علیہ وسلم کی جانچ پڑتال، پھر ان کی جمع و ترتیب پر آپ کی مساعی جمیلہ کو آنے والی تمام مسلمان نسلیں خراج تحسین پیش کرتی رہیں گی۔ آپ کا ظہور پر سرور عین اس قرآنی پیش گوئی کے مطابق ہوا جو اللہ تبارک وتعالیٰ نے سورہ جمعہ میں فرمائی تھی۔ «وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ وَهُوَ الْعَزِيزُ الْحَكِيمُ» [62-الجمعة:3] یعنی زمانہ رسالت کے بعد کچھ اور لوگ بھی وجود میں آئیں گے جو علوم کتاب و حکمت کے حامل ہوں گے۔ امام بخاری رحمہ اللہ علیہ یقینا ان ہی پاک نفوس کے سرخیل ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ آل فارس میں سے کچھ ایسے لوگ پیدا ہوں گے کہ اگر دینی علوم ثریا ستارے پر ہوں گے تو وہاں سے بھی وہ ان کو ڈھونڈ نکالیں گے۔ نام و نسب و پیدائش: امیر المؤمنین فی الحدیث سیدنا امام بخاری رحمہ اللہ کا نام نامی ”محمد“ اور کنیت ابو عبداللہ ہے۔ سلسلہ نسب یہ ہے محمد بن اسماعیل بن ابراہیم بن مغیرہ بن بردزبہ بن بذذبہ الجعفی البخاری۔ حافظ ابن حجر رحمہ اللہ نے بردزبہ کے متعلق لکھا ہے کہ وہ آتش پرست تھے۔ اس سے آپ کا فارسی النسل ہونا ظاہر ہے۔ امام بخاری کے پردادا مغیرہ نے یمان الجعفی حاکم بخارا کے ہاتھ پر اسلام قبول کیا اور شہر بخارا ہی میں سکونت پذیر ہو گئے۔ اسی وجہ سے امام بخاری رحمہ اللہ کو الجعفی البخاری کہا جاتا ہے۔ آپ کے والد ماجد العلام مولانا اسماعیل صاحب رحمہ اللہ اکابر محدثین میں سے ہیں۔ کنیت ابوالحسن ہے۔ امام مالک رحمہ اللہ کے اخص تلامذہ میں سے ہیں۔ اور امام مالک رحمہ اللہ کے علاوہ حماد بن زید رحمہ اللہ اور ابو معاویہ ”عبداللہ بن مبارک رحمہ اللہ“ وغیرہ سے آپ نے احادیث روایت کی ہیں۔ احمد بن حفص رحمہ اللہ، نصر بن حسین رحمہ اللہ وغیرہ آپ کے شاگرد ہیں۔ اس قدر پاکباز، متدین، محتاط تھے خاص طور پر اکل حلال میں کہ آپ کے مال میں ایک درم بھی ایسا نہ تھا جسے مشکوک یا حرام قرار دیا جا سکے۔ ان کے شاگرد احمد بن حفص کا بیان ہے کہ میں مولانا اسماعیل کی وفات کے وقت حاضر تھا۔ اس وقت آپ نے فرمایا کہ میں اپنے کمائے ہوئے مال میں ایک درم بھی مشتبہ چھوڑ کر نہیں چلا ہوں۔ امام بخاری قدس سرہ شہر بخارا میں بتاریخ 13 شوال 194ھ نماز جمعہ کے بعد پیدا ہوئے۔ یہ فخر امت میں کم ہی لوگوں کو حاصل ہوا ہے کہ باپ بھی محدث ہو اور بیٹا بھی محدث بلکہ سیدالمحدثین۔ اللہ تعالیٰ نے یہ شرف امام بخاری رحمہ اللہ کو نصیب فرمایا: جس طرح یوسف علیہ السلام کو «كريم ابن الكريم ابن كريم» کہا گیا ہے اسی طرح امام بخاری رحمہ اللہ بھی محدث ابن المحدث قرار پائے۔ مگر صد افسوس کہ والد ماجد نے اپنے ہونہاز فرزند کا علمی زمانہ نہیں دیکھا اورآپ کو بچپن ہی میں داغ مفارقت دے گئے۔ امام بخاری رحمہ اللہ کی تربیت کی پوری ذمہ داری والدہ محترمہ پر آ گئی جو نہایت ہی خدا رسیدہ عبادت گزار شب بیدار خاتون تھیں۔ والدین کی علمی شان و دینداری کے پیش نظر اندازہ لگایا جا سکتا ہے کہ امام کی تعلیم وتربیت کس انداز کے ساتھ ہوئی ہو گی۔ اولین کرامت: فنجار نے تاریخ بخارا میں اور لاسکائی نے شرح السنہ باب کرامات الاولیاء میں نقل کیا ہے کہ بچپن میں امام بخاری رحمہ اللہ علیہ کی بصارت جاتی رہی تھی۔ والدہ ماجدہ کے لئے اپنی بیوگی ہی کا صدمہ کم نہ تھا کہ اچانک یہ سانحہ پیش آیا۔ اطباء علاج سے عاجز آ گئے۔ والدہ ماجدہ اپنے یتیم بچے کی اس حالت پر رات دن روتیں اور دعا کرتیں۔ آخر ایک رات بعد عشاء مصلی ہی پر روتے اور دعا کرتے ہوئے آپ کو نیند آ گئی۔ خواب میں خلیل اللہ ابراہیم علیہ السلام تشریف لائے اور بشارت دی کہ ”تمہارے رونے اور دعا کرنے سے اللہ پاک نے تمہارے بچے کی بینائی درست کر دی ہے“، صبح ہوئی تو فی الواقع آپ کی آنکھیں درست تھیں۔ بعد میں اللہ پاک نے آپ کو اس قدر روشنی عطا فرمائی کہ ”تاریخ کبیر“ کا پورا مسودہ آپ نے چاندنی راتوں میں تحریر فرمایا۔ تاج الدین سبکی نے طبقات کبریٰ میں لکھا ہے کہ دھوپ اور گرمی کی شدت میں امام نے طلب علم کے لئے سفر فرمایا تو دوبارہ آپ کی بینائی ختم ہو گئی۔ خراساں پہنچنے پر آپ نے کسی حکیم حاذق کے مشورہ سے سر کے بال صاف کرائے اور گل خطمی کا ضماد کیا۔ اس سے اللہ پاک نے آپ کو شفائے کامل عطا فرمائی۔ دس سال کی عمر تھی کہ آپ مکتبی تعلیم سے فارغ ہو گئے۔ اور اسی ننھی عمر سے ہی آپ کو احادیث نبوی یاد کرنے کا شوق دامن گیر ہو گیا اور آپ مختلف حلقہ ہائے درس میں شرکت فرمانے لگے۔ ستر ہزار احایث کا حفظ اور آپ کی عمر: ان دنوں شہر بخارا میں علوم قرآن و حدیث کے بہت سے مراکز تھے۔ جہاں «قال الله وقال الرسول» کی صدائیں بلند ہو رہی تھیں۔ امام ان مراکز سے استفادہ فرمانے لگے۔ ایک دن محدث بخارا امام داخلی رحمہ اللہ کے حلقہ درس میں شریک تھے کہ امام داخلی نے ایک حدیث کی سند بیان کرتے وقت «سفيان عن ابي الزبير عن ابراهيم» فرما دیا۔ امام بخاری رحمہ اللہ بولے کہ حضرت یہ سند اس طرح نہیں ہے کیونکہ ابو الزبیر نے ابراہیم سے روایت نہیں کی ہے۔ ایک نوعمر شاگرد کی اس گرفت سے محدث بخارا چونک پڑے اور خفگی کے لہجے میں آپ سے مخاطب ہوئے۔ آپ نے استاد محترم کا پورا ادب ملحوظ رکھتے ہوئے بڑی آہستگی سے فرمایا کہ اگر آپ کے پاس اصل کتاب ہو تو اس کی طرف مراجعت فرما لیجئے۔ علامہ نے گھر جا کر اصل کتاب کو ملاحظہ فرمایا تو امام بخاری کی گرفت کو تسلیم فرما لیا اور واپسی پر اس سند کی تصحیح کے بارے میں آپ سے سوال کیا۔ امام بخاری نے برجستہ جواب دیا کہ صحیح سند یوں سے «سفيان عن الزبير وهو ابن عدي عن ابراهيم» ۔ اس وقت امام بخاری رحمہ اللہ کی عمر صرف گیارہ سال کی تھی۔ انہی ایام میں آپ نے بخارا کے اٹھارہ محدثین سے فیوض حاصل کرتے ہوئے بیشتر ذخیرہ احادیث محفوظ فرما لیا تھا۔ امام وکیع اور امام عبداللہ بن مبارک کی کتابیں آپ کو برنوک زبان یاد تھیں۔ علامہ داخلی کے ساتھہ واقعہ مذکورہ سے بخارا کے ہر علمی مرکز میں آپ کا چرچا ہونے لگا۔ نوبت یہاں تک پہنچی کہ بڑے بڑے اساتذہ کرام آپ کے حفظ و ذہانت کے قائل ہونے لگے۔ علامہ بیکندی علیہ الرحمہ جو ایک مشہور محدث بخار ہیں۔ فرمایا کرتے تھے کہ میرے حلقہ درس میں جب بھی محمد بن اسماعیل آجاتے ہیں مجھہ پر عالم تحیر طاری ہو جاتا ہے۔ ایک دن ان علامہ کی خدمت میں ایک بزرگ سلیم بن مجاہد حاضر ہوئے۔ آپ نے ان سے فرمایا کہ اگر تم ذرا پہلے آ جاتے تو ایک ایسا ہونہار نوجوان دیکھتے جسے ستر ہزار حدیثیں حفظ ہیں۔ سلیم بن مجاہد یہ سن کر حیرت زدہ ہو گئے۔ اور سیدنا امام کی ملاقات کے اشتیاق میں نکلے۔ ملاقات ہوئی تو امام بخاری رحمہ اللہ نے فرمایا کہ نہ صرف ستر ہزار بلکہ ان سے بھی زائد احادیث مجھے یاد ہیں۔ بلکہ سلسلہ سند، حالات رجال سے جیسا بھی سوال کریں گے جواب دوں گا حتی کہ اقوال صحابہ و تابعین کے بارے میں بھی بتلا سکتا ہوں کہ وہ کن کن آیات قرآنی و احادیث نبوی سے ماخوذ ہیں۔ [مقدمہ فتح الباری] طلب حدیث کے لیے بلاد اسلامیہ کی رحلت: لفظ رحلت کے لغوی معنی کوچ کرنے کے ہیں مگر اصطلاح محدثین میں یہ لفظ اس سفر کے لئے اصطلاح بن گیا ہے جو حدیث یا حدیث کی کسی سند عالی کے لئے کیا جائے۔ صحابہ و تابعین ہی کے بابرکت زمانوں سے اکابر امت میں یہ شوق پیدا ہو گیا تھا کہ وہ علوم کی تحصیل کے لئے دور دور تک کا سفر کرنے لگے۔ قرآن مجید میں اللہ تعالیٰ کا ارشاد ہے، مسلمانوں کا ایک گروہ ضرور دینی علوم کی تحصیل و فقاہت کے لئے گھر سے باہر نکلنا چاہیے۔ اسی کی تعمیل کے لئے محدثین کرام رحم اللہ اجمعین کمربستہ ہوئے اور انہوں نے اس پاکیزہ مقصد کے لئے ایسے ایسے کٹھن سفر اختیار کئے کہ وہ دنیا کی تاریخ میں بے مثال بن گئے۔ امام بخاری رحمہ اللہ کے سفر کے سلسلہ میں مرو، بلخ، ہرات، نیشا پور، رئے وغیرہ بہت سے دور دراز شہروں کے نام آئے ہیں۔ آپ نے طلب حدیث کے لئے تقریبا تمام ہی اسلامی ممالک کا سفر فرمایا۔ جعفر بن محمد خطان کہتے ہیں کہ میں نے امام بخاری رحمہ اللہ سے سنا ہے کہ وہ فرماتے تھے کہ میں نے ایک ہزار سے زائد اساتذہ سے احادیث سنی ہیں۔ اور میرے پاس جس قدر بھی احادیث ہیں ان کی سندیں اور رواة کے جمیع احوال مجھے محفوظ ہیں۔ سفر حج: سید المحدثین امیر المومنین فی الحدیث امام بخاری رحمہ اللہ اپنی عمر کے سولہویں سال 210ھ میں اپنی والدہ محترمہ اور محترم بھائی احمد کے ساتھ سفر حج پر روانہ ہوئے اور مکة المکرمہ پہنچے۔ آپ نے اس مرکز اسلام میں بڑے بڑے علمائے کرام و محدثین سے ملاقات فرمائی، اور حج کے بعد والدہ محترمہ کی اجازت سے تحصیل علوم حدیث کے لئے مکہ ہی میں سکونت اختیار کی۔ اس وقت مکہ شریف کے ارباب علم و فضل میں عبداللہ بن یزید، ابوبکر عبداللہ بن الزبیر، ابوالولید احمد بن الارزقی اور علامہ حمیدی وغیرہ ممتاز شخصیتوں کے مالک تھے۔ آپ نے پورے دو سال مکة الکرمہ میں رہ کر ظاہری و باطنی کمالات حاصل فرمائے اور 212ھ میں مدینہ المنورہ کا سفر اختیار فرمایا اور وہاں کے مشاہیر محدثین کرام مطرف بن عبداللہ، ابراہیم بن منذر، ابو ثابت محمد بن عبیداللہ، ابراہیم بن حمزہ وغیرہ وغیرہ بزرگوں سے اکتساب فیض فرمایا۔ بلاد حجاز میں آپ کی اقامت چھ سال رہی۔ پھر آپ نے بصرہ کا رخ فرمایا۔ اس کے بعد کوفہ کا قصد کیا۔ سیدنا وراق بخاری نے کوفہ اور بغداد کے بارے میں آپ کا یہ قول نقل کیا ہے ”میں شمار نہیں کر سکتا کہ کوفہ اور بغداد میں محدثین کے ہمراہ کتنی مرتبہ داخل ہوا ہوں“۔ بغداد چونکہ عباسی حکومت کا پایہ تخت رہا ہے اس لئے وہ علوم و فنون کا مرکز بن گیا تھا۔ بڑے بڑے اکابر عصر بغداد میں جمع تھے۔ اسی لئے امام بخاری رحمہ اللہ نے بار بار بغداد کا سفر فرمایا۔ وہاں کے مشائخ حدیث میں امام احمد بن حنبل رحمہ اللہ کا نام نامی خصوصیت سے قابل ذکر ہے۔ آٹھویں مرتبہ جب امام بخاری رحمہ اللہ بغداد سے آخری سفر کرنے لگے تو امام احمد بن حنبل رحمہ اللہ علیہ نے بڑے پر درد لہجے میں فرمایا ”کیا آپ لوگوں کو اوربغداد کے اس زمانہ کو اور یہاں کے علوم و فنون کے مراکز کو چھوڑ کر خراسان چلے جائیں گے؟“ بخارا کے ابتلائی دور میں جب کہ وہاں کا حاکم آپ سے ناراض ہو گیا تھا، آپ امام احمد رحمہ اللہ کے اس مقولہ کو بہت یاد فرمایا کرتے تھے۔ اٹھارہ سال کی عمر میں تصانیف اور حافظہ: امام بخاری رحمہ اللہ خود فرماتے ہیں کہ جب میری عمر 18 سال کی تھی تو میں نے کتاب قضایائے صحابہ و تابعین نامی تصنیف کی، پھر میں نے مدینہ منورہ میں روضہ منورہ کے پاس بیٹھ کر تاریخ تصنیف کی جسے میں چاندنی راتوں میں لکھا کرتا تھا۔ پھر میں نے شام اور مصر اور جزیرہ اور بغداد و بصرہ کا سفر کیا۔ حاشد بن اسماعیل آپ کے ہم عصر کہتے ہیں کہ آپ بصرہ میں ہمارے ساتھ حاضر درس ہوا کرتے تھے۔ محض سماعت فرماتے اور کچھ نہ لکھتے۔ آخر سولہ دن اسی طرح گزر گئے ایک دن میں نے آپ کو نہ لکھنے پر ملامت کی تو آپ بولے کہ اس عرصہ میں جو کچھ تم نے لکھا ہے اسے حاضر کرو اور مجھ سے ان سب کو برزبان سن لو۔۔ چنانچہ پندرہ ہزار احادیث سے زیادہ تھیں جن کو امام بخاری نے صرف اپنی یادداشت سے اس اہتمام سے سنایا کہ بہت سے مقامات پر ہم کو اپنی کتابت میں تصحیح کرنے کا موقعہ ملا۔ ابوبکر بن ابی عتاب ایک بزرگ محدث فرماتے ہیں کہ ہم سے امام بخاری نے حدیث لکھی اور اس وقت تک ان کی داڑھی مونچھ کے بال نہیں نکلے تھے۔ حافظ ابن حجر رحمہ اللہ فرماتے ہیں کہ محمد بن یوسف فریابی نے 212ھ میں انتقال فرمایا اس وقت امام بخاری کا سن اٹھارہ برس یا کم تھا۔ محمد بن ازہر سختیانی نے کہا کہ میں سلمان بن حرب کی مجلس میں تھا اور امام بخاری ہمارے شریک درس تھے مگر احادیث کو قلمبند نہیں کرتے تھے۔ لوگوں نے اس پر استعجاب کیا تو انہوں نے کہا کہ وہ بخارا جا کر اپنی یاد سے ان سب احادیث کو ضبط کر لیں گے۔ یوسف بن موسیٰ مروزی کہتے ہیں کہ میں بصرہ کی جامع مسجد میں تھا کہ امام المحدثین کی تشریف آوری کا اعلان کیا گیا۔ لوگ جوق در جوق آپ کے لائق شان استقبال کو جانے لگے جن میں میں بھی شامل ہوا۔ اس وقت امام بخاری عالم شباب میں تھے۔ بے حد حسین، سیاہ ریش۔ آپ نے پہلے مسجد میں نماز ادا فرمائی پھر لوگوں نے ان کو درس حدیث کے لئے گھیر لیا۔ آپ نے دوسرے روز کے لئے درخواست منظور فرما لی۔ چنانچہ دوسرے دن بصرہ کے محدثین و حفاظ جمع ہوئے۔ آپ نے فرمایا کہ بصرہ والو! آج کی مجلس میں تم کو اہل بصرہ ہی کی روایت پیش کروں گا جو تمہارے ہاں نہیں ہیں۔ پھر آپ نے اس حدیث کا املاء کرا دیا۔ «حدثنا عبدالله بن عثمان بن جبلة بن ابي رواد العقلي ببلدكم قال حدثني ابي عن شعبة عن منصور وغيره عن سالم بن ابي الجعد عن انس بن مالك ان اعرابيا جآءالي النبى صي الله عليه وسلم فقال يا رسول الله الرجل يحب القوم ... الحديث» حدیث املاء کرا کر ارشاد فرمایا کہ اے اہل بصرہ یہ حدیث تمہارے پاس منصور کے واسطہ نہیں۔ اور اسی شان کے ساتھ آپ نے گھنٹوں اس مجلس کو بہت سی احادیث املاء کرائیں۔ آپ کی قوت حافظ سے متعلق بہت سے واقعات مورخین نے نقل کئے ہیں۔ جن کو جمع کیا جائے تو ایک مستقل کتاب تیار ہو سکتی ہے۔ خانگی پاکیزہ زندگی، اخلاص واتباع سنت: سید المحدثین امام المتقین فدائے سنن سید المرسلین امام بخاری رحمہ اللہ کو اپنے والد ماجد مولانا محمد اسماعیل رحمہ اللہ کے ترکہ سے کافی دولت حاصل ہوئی تھی۔ آپ نے اس پاکیزہ مال کو بصورت مضاربت تجارت میں لگا دیا تھا۔ تاکہ خود تجارتی جھمیلوں سے آزاد رہ کر بہ سکون قلب خدمت حدیث نبوی علیہ فداہ ابی وامی کر سکیں۔ اللہ پاک نے اس تجارت کے ذریعہ آپ کو فارغ البالی عطا فرمائی تھی۔ باوجود اس کے ایام طالب علمی میں آپ نے بے انتہا فقر کیشی برداشت کیں۔ اور کسی مرحلہ پر بھی صبر و شکر کو ہاتھ سے نہ جانے دیا۔ وراق بخاری کے بیان کے مطابق ایک دفعہ سیدنا امام اپنے استاد آدم بن ابی ایاس کے پاس طلب حدیث کے لئے تشریف لے گئے مگر توشہ ختم ہو گیا۔ اور سفر میں تین دن متواتر گھاس اور پتوں پر گزارہ کیا۔ آخر ایک اجنبی انسان ملا اور اس نے ایک تھیلی دی جس میں دینار تھے۔ حفص بن عمر الاشقر آپ کے بصرہ کے ہم سبق بیان کرتے ہیں کہ ایک مرتبہ آپ کئی روز تک شریک درس نہ ہوئے۔ معلوم ہوا کہ خرچ ختم ہو گیا تھا اور نوبت یہاں تک پہنچ چکی تھی کہ آپ کو بدن کے کپڑے بھی فروخت کرنے پڑ گئے۔ چنانچہ ہم نے آپ کے لئے امدادی چندہ کر کے کپڑے تیار کرائے تب آپ درس میں حاضر ہوئے۔ ابوالحسن یوسف بن ابی ذربخاری کہتے ہیں کہ اسی فقر کیشی کی وجہ سے ایک دفعہ سیدنا امام علیل ہوگئے۔ طبیبوں نے آپ کا قارورہ دیکھ کر فیصلہ کیا کہ کہ یہ قارورہ ایسے درویشوں کے قارورے سے مشابہت رکھتا ہے جو روٹیوں کے ساتھ سالن کا استعمال نہیں کرتے۔ جو صرف سوکھی روٹیاں کھا کر گزارہ کیا کرتے ہیں۔ دریافت کرنے پر معلوم ہوا کہ چالیس سال سے آپ کا یہی عمل ہے کہ صرف سوکھی روٹی کھا کر گزارہ کرتے رہے ہیں۔ عرض کیا گیا کہ اطباء نے آپ کے علاج میں سالن کھانا تجویز کیا ہے۔ آپ نے یہ سن کر علاج سے انکار کر دیا۔ جب آپ کے شیوخ نے بہت مجبور کیا تو روٹیوں کے ساتھ شکر کھانی منظور فرمائی۔ ابو حفص نامی بزرگ آپ کے والد ماجد کے خاص تلامذہ میں سے ہیں۔ انہوں نے ایک دفعہ کچھ مال آپ کی خدمت میں پیش کیا۔ اتفاق حسنہ کہ شام کو بعض تاجروں نے اسی مال پر پانچ ہزار منافع دے کر اسے خریدنا چاہا۔ آپ نے فرمایا کہ صبح بات پختہ کروں گا۔ صبح ہوئی تو دوسرے تاجر پہنچے اور انہوں نے دس ہزار منافع دے کر وہ مال خریدنا چاہا۔ آپ نے فرمایا کہ میں نے شام کو آنے والے اور صرف پانچ ہزار دینے والے تاجر کو یہ مال دے دینے کی نیت کر لی تھی۔ اب میں اپنی نیت کو توڑنا پسند نہیں کرتا۔ چنانچہ آپ نے دس ہزار کے نفع کو چھوڑ دیا اور پہلے تاجر ہی کے مال حوالہ فرما دیا۔ اخلاص و اتباع سنت: مزاج میں انتہا درجہ کی رحمدلی اور نرمی اللہ نے بخشی تھی۔ ایک دفعہ آپ کا ایک مضارب (شریک تجارت، پارٹنر) آپ کے 25 ہزار درہم دبا بیٹھا۔ آپ کے بعض شاگردوں (محمد بن ابی حاتم وغیرہ) نے کہا کہ وہ قرضدار شہر آمل میں آ گیا ہے اب اس سے روپیہ وصول کرنے میں آسانی ہو گی۔ آپ نے فرمایا کہ میں قرض دار کو پریشانی میں ڈالنا نہیں چاہتا۔ قرض دار خوف سے خوارزم چلا گیا۔ آپ سے کہا گیا کہ گورنر کی طرف سے ایک خط حاکم خوارزم کو لکھوا کر اسے گرفتار کرا دیجئے۔ آپ نے فرمایا کہ میں حکومت سے ایک خط کے لئے طمع کروں گا اس کے عوض حکومت کل میرے دین میں طمع کرے گی میں یہ بوجھ برداشت کرنے کے لئے تیار نہیں۔ بالآخر امام نے مقروض سے اس بات پر مصالحت کر لی کہ وہ ہر ماہ ایک مخصوص رقم حضرت کو ادا کیا کرے گا۔ لیکن وہ تمام روپیہ ضائع ہو گیا اور وہ امام کا ایک پیسہ بھی نہ واپس کر سکا۔ مگر آپ نے حلم و عفو کا دامن ہاتھ سے نہیں چھوڑا۔ امام کرمانی کا بیان ہے کہ امام بخاری رحمہ اللہ کئی کئی دن مسلسل بغیر کھائے پئے گزار دیا کرتے تھے۔ اور کبھی صرف دو تین بادام کھا لینا ہی ان کے لئے کافی ہو جاتا تھا۔ لیکن اس کے ساتھ وہ بہت ہی سخی اور غرباء نواز و مساکین دوست انسان تھے۔ اپنی تجارت سے حاصل شدہ نفع طلبہ و محدثین پر صرف فرما دیتے تھے۔ ہر ماہ فقراء و مساکین و طلبہ و محدثین کے لئے پانچ سو درہم تقسیم فرمایا کرتے تھے۔ بے نفسی کا یہ عالم کہ ایک دفعہ آپ کی ایک لونڈی گھر میں اس طرف سے گزری جہاں آپ کاغذ، دوات، قلم وغیرہ رکھا کرتے تھے۔ اس باندی کی ٹھوکر سے آپ کی دوات کی ساری روشنائی فرش پر پھیل گئی۔ امام بخاری رحمہ اللہ نے اس حرکت پر باندی کو ٹوکا تو اس نے جواب دیا کہ جب کسی جانب راستہ ہی نہ ہو تو کیا کیا جائے۔ امام بخاری رحمہ اللہ اس نامعقول جواب سے برانگیختہ نہیں ہوئے بلکہ ہاتھ دراز کر کے فرمایا کہہ جاؤ میں نے تم کو آزاد کر دیا۔ اس پر آپ سے پوچھا گیا کہ اس نے تو ناراضگی کا کام کیا تھا آپ نے اسے آزاد کیوں فرما دیا آپ نے کہا اس کے اس کام سے میں نے اپنے نفس کی اصلاح کر لی اور اسی خوشی میں اسے پروانہ آزادی دے دیا۔ ایک مرتبہ آپ نے ابومعشر ایک نابینا بزرگ سے فرمایا کہ اے ابو معشر تم مجھے معاف کر دو۔ انہوں نے حیرت و استعجاب کے ساتھ کہا کہ حضرت یہ معافی کس بات کی ہے؟ آپ نے بتلایا کہ آپ ایک مرتبہ حدیث بیان کرتے ہوئے فرط مسرت میں انوکھے انداز سے اپنے سر اور ہاتھوں کو حرکت دے رہے تھے۔ جس پر مجھ کو ہنسی آ گئی۔ میں آپ کی شان میں اسی گستاخی کے لئے آپ سے معافی کا طلبگار ہوں۔ ابومعشر نے جواب میں عرض کیا کہ اے حضرت امام! آپ سے کسی قسم کی باز پرس نہیں ہے۔ خالد بن احمد ذہلی حاکم بخارا نے ایک مرتبہ آپ کی خدمت میں درخواست بھیجی کہ آپ دربار شاہی میں تشریف لا کر مجھے اور میرے شہزادوں کو صحیح بخاری اور تاریخ کا درس دیا کریں۔ آپ نے قاصد کی زبانی کہلا بھیجا کہ میں آپ کے دربار میں آ کر شاہی خوشامدیوں کی فہرست میں اضافہ نہیں کرنا چاہتا اور نہ مجھے علم کی بے قدری گوارا ہے۔ حاکم نے دوبارہ کہلوایا کہ پھر شاہزادوں کے لئے کوئی وقت مخصوص فرما دیں۔ امام بخاری رحمہ اللہ نے جواب دیا کہ میراث نبوت میں کسی امیر غریب کا امتیاز نہیں ہے۔ اس لئے میں اس سے بھی معذور ہوں۔ اگر حاکم بخارا کو میرا یہ جواب ناگوار خاطر ہو تو جبرا میرا درس حدیث روک سکتے ہیں تاکہ میں اللہ تعالیٰ کے دربار یں عذر خواہی کر سکوں۔ ان جوابات سے حاکم بخارا سخت برہم ہوئے اور اس نے حضرت امام کو بخارا سے نکالنے کی سازش کی۔ اتباع سنت: عبادت میں آپ کا استغراق اس درجہ تھا کہ امام کو ایک باغ میں مدعو کیا گیا۔ جب امام ظہر کی نماز سے فارغ ہوگئے تو نوافل کی نیت باندھ لی۔ نماز سے فراغت کے بعد قمیص کا دامن اٹھا کر کسی سے فرمایا کہ دیکھنا قمیض میں کوئی موذی جانور محسوس ہو رہا ہے۔ دیکھا گیا تو ایک زنبور نے سترہ جگہ ڈنگ لگائے تھے۔ اور جسم کے نیش زدہ حصوں پر ورم آرہا تھا۔ کہا گیا کہ آپ نے پہلی ہی بار کیوں نہ نماز چھوڑ دی۔ امام نے فرمایا کہ میں نے ایک ایسی سورة شروع کر رکھی تھی کہ درمیان میں اس کا قطع کرنا گوارا نہ ہوا۔ آخر رات میں تیرہ رکعتوں کا آپ ہمیشہ معمول رکھتے تھے۔ اسوہ حسنہ کی پیروی میں تہجد کی نماز کبھی ترک نہ فرماتے۔ رمضان شریف میں نماز تراویح سے فارغ ہو کر نصف شب سے لے کر سحر تک خلوت میں تلاوت قرآن پاک فرماتے اور ہر تیسرے دن ایک قرآن کریم ختم فرما دیتے اور دعا کرتے اور فرماتے کہ ہر ختم پر ایک دعا ضرور قبول ہوتی ہے۔ اتباع سنت کا اس قدر جذبہ تھا کہ خالص اسوہ حسنہ کے پیش نظر تیر اندازی کی مشق فرمائی۔ اس قدر کہ آپ کا نشانہ کبھی چوکتا نہیں دیکھا گیا ایک دفعہ آپ کا تیر ایک پل کی میخ پر جا لگا جس سے پل کا نقصان ہو گیا۔ آپ نے پل کے مالک سے درخواست کی کہ یا تو پل کی مرمت کے لئے اجازت دی جائے یا اس کا تاوان لے لیا جائے تاکہ ہماری غلطی کی تلافی ہو سکے۔ پل کے مالک حمید بن الاخضر نے جواب میں آپ کو بہت بہت سلام کہلا بھیجا اور کہا کہ آپ بہر حال صورت بے قصور ہیں۔ میری تمام دولت آپ پر قربان ہے۔ پیغام پہنچنے پر آپ نے پانچ سو احادیث بیان فرمائی اور تین سو درہم بطور صدقہ فقراء و مساکین میں تقسیم فرمائے۔ [مقدمہ فتح الباری] امام بخاری قدس سرہ کی بے نظیر ثقاہت: علامہ عجلونی نے آپ کی ثقاہت کے بارے میں یہ عجیب واقعہ نقل کیا ہے کہ ایک مرتبہ آپ دریا کا سفر کر رہے تھے اور آپ کے پاس ایک ہزار اشرفیاں تھیں۔ ایک رفیق سفر نے عقیدت مندانہ راہ و رسم بڑھا کر اپنا اعتماد قائم کر لیا۔ امام بخاری رحمہ اللہ نے اپنی اشرفیوں کی اسے اطلاع دے دی۔ ایک روز آپ کا یہ رفیق سو کر اٹھا تو اس نے با آواز بلند رونا شروع کر دیا۔ اور کہنے لگا کہ میری ایک ہزار اشرفیاں گم ہو گئی ہیں۔ چنانہ تمام مسافروں کی تلاشی شروع ہوئی۔ امام نے یہ دیکھ کر کہ اشرفیاں میرے پاس ہیں اور وہ ایک ہزار ہیں۔ تلاشی میں ضرور مجھ پر چوری کا الزام لگایا جائے گا۔ اور یہی اس کا مقصد تھا۔ امام نے یہ دیکھ کر وہ تھیلی سمندر کے حوالہ کر دی۔ امام کی بھی تلاشی لی گئی۔ مگر وہ اشرفیاں ہاتھ نہ آئیں اور جہاز والوں نے خود اسی مکار رفیق کو ملامت کی۔ سفر ختم ہونے پر اس نے امام سے اشرفیوں کے بارے میں دریافت کیا تو آپ نے فرمایا کہ میں نے ان کو سمندر میں ڈال دیا۔ وہ بولا کہ اتنی بڑی رقم کا نقصان آپ نے کیسے برداشت فرما لیا۔ آپ نے جواب دیا کہ جس دولت ثقاہت کو میں نے تمام عمر عزیز گنوا کر حاصل کیا ہے۔ اور میری ثقاہت جو تمام دنیا میں مشہور ہے کیا میں اس کو چوری کا اشتباہ اپنے اوپر لے کر ضائع کر دیتا۔ اور ان اشرفیوں کے عوض اپنی دیانت وامانت و ثقاہت کا سودا کر لیتا میرے لئے ہرگز یہ مناسب نہ تھا۔ امیرا لمومنین فی الحدیث امام بخاری رحمہ اللہ بغداد میں: عباسی حکومت کا پایہ تخت بغداد کبھی دنیائے اسلام کا مرکز اور اسلامی علوم و فنون کا بیش بہا مخزن رہ چکا ہے۔ یہی سید المحدثین امام بخاری رحمہ اللہ کی شہرت و علمی قبولیت کا زمانہ ہے۔ متکلمین و محدثین فقہاء ومفسرین اطراف عالم سے سمٹ سمٹ کر بغداد میں جمع ہو چکے تھے۔ اس دور میں امام بخاری رحمہ اللہ بغداد میں تشریف لائے۔ پورا بغداد آپ کی شہرت سے گونج اٹھا۔ ہر مسجد ہر مدرسہ ہر خانقاہ میں آپ کے ذہن و حفظ و ذہانت و مہارت حدیث کا چرچا ہونے لگا۔ آخر دارالخلافہ کے بعض محدثین نے آپ کے امتحان کی ایک ترکیب سوچی وہ یہ کہ سو احادیث نبوی میں سے ہر حدیث کی سند دوسری حدیث کے متن میں ملا دی اوران کو دس آدمیوں پر برابر تقسیم کر دیا اور مقررہ تاریخ پر مجمع عام میں آپ کے امتحان کا فیصلہ کیا گیا۔ چنانچہ مقررہ وقت پر سارا شہر امنڈ آیا۔ ان دس آدمیوں نے نمبروار اختلاط کی ہوئی احادیث امام صاحب کے سامنے پڑھنی شروع کیں۔ اور آپ سے استصواب چاہا۔ مگر آپ ہر شخص اور ہر حدیث کے بارے میں یہی فرماتے رہے کہ «لا اعرفه» (میں اس حدیث کو نہیں جانتا) اس طرح جب سو احادیث ختم ہو چکیں تو لوگوں میں چہ میگوئیاں شروع ہوئیں۔ کسی کا خیال تھا کہ امام حقیقت حال کو پہچان چکے ہیں۔ اور کسی کا خیال تھا کہ آپ نے محدثین بغداد کے سامنے سپر ڈال دی ہے۔ امام المحدثین اسی وقت کھڑے ہوکر پہلے سائل کی طرف متوجہ ہوئے اور فرمایا: «اما حديثك الاول فبهذا الاسناد خطاءو صوابه كذا» یعنی تم نے پہلی حدیث جس سند سے بیان کی تھی وہ غلط تھی اس کی اصل سند یہ ہے۔ اسی طرح آپ نے دسوں اشخاص کی سنائی ہوئی احادیث کو بالکل صحیح درست کر کے بہ ترتیب سوالات پڑھ کر سنا دیا۔ اس خداداد حافظہ و مہارت فن حدیث کو دیکھ کر اہل بغداد حیرت زدہ ہوگئے۔ اور بالا تفاق تسلیم کر لیا کہ فن حدیث میں عصر حاضر میں آپ کا کوئی ثانی نہیں ہے۔ وجہ تالیف الجامع الصحیح البخاری: حافظ ابن حجر رحمہ اللہ نے مقدمہ فتح الباری میں تفصیلا لکھا ہے کہ رسول کریم صلی اللہ علیہ وسلم اور صحابہ و تابعین کے پاکیزہ زمانوں میں احادیث کی جمع و ترتیب کا سلسلہ کماحقہ نہ تھا۔ ایک تو اس لئے کہ شروع زمانہ میں اس کی ممانعت تھی جیسا کہ صحیح مسلم کی روایت سے ثابت ہے۔ محض اس ڈر سے کہ کہیں قرآن مجید اور احادیث کے متون باہمی طور پر گڈمڈ نہ ہوجائیں۔ دوسرے یہ کہ ان لوگوں کے حافظے وسیع تھے۔ ذہن صاف تھے۔ کتابت سے زیادہ ان کو اپنے حافظہ پر اعتماد تھا اور اکثر لوگ فن کتابت سے واقف نہ تھے۔ اس کا یہ مطلب نہیں ہے کہ کتابت احادیث کا سلسلہ زمانہ رسالت میں بالکل نہ تھا۔ یہ کہا جا سکتا ہے کہ وجوہ بالا کی بنا پر کما حقہ نہ تھا۔ پھر تابعین کے آخر زمانہ میں احادیث کی ترتیب وتبویب شروع ہوئی۔ خلیفہ خامس عمر بن عبدالعزیز رحمہ اللہ نے حدیث کو ایک فن کی حیثیت سے جمع کرانے کا اہتمام فرمایا۔ تاریخ میں ربیع بن صبیح اور سعید بن عروبہ وغیرہ وغیرہ حضرات کے نام آتے ہیں جنہوں نے اس فن شریف پر باضابطہ قلم اٹھایا۔ اب وہ دور ہو چلا تھا جس میں اہل بدعت نے من گھڑت احادیث کا ایک خطرناک سلسلہ شروع کر دیا تھا۔ ان حالات کے پیش نظر طبقہ ثالثہ کے لوگ اٹھے اور انہوں نے احکام کو جمع کیا۔ امام مالک رحمہ اللہ نے موطا تصنیف کی جس میں اہل حجاز کی قوی روایتیں جمع کیں، اور اقوال صحابہ فتاوی و تابعین کو بھی شریک کیا۔ ابو محمد عبدالملک بن عبدالعزیز بن جریج نے مکة المکرمہ میں اور ابو عمرو عبدالرحمن بن عمر اوزاعی نے شام میں اور عبداللہ سفیان بن سعدی ثوری نے کوفہ میں اور ابو سلمہ حماد بن سلمہ دینار نے بصرہ میں حدیث کی جمع ترتیب و تالیف پر توجہ فرمائی۔ ان کے بعد بہت سے لوگوں نے جمع احادیث کی خدمت انجام دی اور دوسری صدی کے آخر میں بہت سی مسندات وجود پذیز ہو گئیں جیسے مسند امام احمد بن حنبل، مسند امام اسحق بن راہویہ، مسند امام عثمان بن ابی شیبہ، مسند امام ابوبکر بن ابی شیبہ وغیرہ وغیرہ۔ ان حالات میں سید المحدثین امام الائمہ امام بخاری رحمہ اللہ کا دور آیا۔ آپ نے ان جملہ تصانیف کو دیکھا، ان کو روایت کیا۔ انہوں نے دیکھا کہ ان کتابوں میں صحیح اور حسن ضعیف سب قسم کی احادیث موجود ہیں۔ ایک مبارک خواب: حدیث رسول پاک صلی اللہ علیہ وسلم کے لئے آپ کے قلب مبارک میں ایک خاص الخاص جذبہ تھا۔ ایک رات آپ خواب دیکھتے ہیں کہ نبی صلی اللہ علیہ وسلم آرام فرما رہے ہیں اور آپ، نبی صلی اللہ علیہ وسلم کے سرہانے کھڑے ہو کر پنکھا جھل رہے ہیں اور مکھی وغیرہ موذی جانوروں کو آپ سے دور کر رہے ہیں۔ بیدار ہو کر معبرین سے تعبیر پوچھی گئی تو انہوں نے بتلایا کہ آپ رسول کریم صلی اللہ علیہ وسلم کی احادیث پاک کی عظیم خدمت انجام دیں گے۔ اور جھوٹے لوگوں نے جو احادیث خود وضع کر لی ہیں، صحیح احادیث کو آپ ان سے بالکل علیحدہ چھانٹ دیں گے۔ اسی دوران آپ کے بزرگ ترین استاد اسحق بن راہویہ نے ایک روز فرمایا: کاش آپ نبی صلی اللہ علیہ وسلم کی صحیح صحیح احادیث پر مشتمل ایک جامع مختصر کتاب تصنیف کر دیتے۔ امام بخاری رحمہ اللہ فرماتے ہیں میرے دل میں یہ بات بیٹھ گئی اور میں نے اسی دن سے جامع صحیح کی تدوین کا عزم بالجزم کر لیا۔ اسی سلسلہ میں نجم بن فضیل اور وراق بخاری کا خواب بھی قابل لحاظ ہے کہ رسول کریم صلی اللہ علیہ وسلم قبر شریف سے باہر تشریف لائے اور جب آپ صلی اللہ علیہ وسلم قدم مبارک اٹھاتے ہیں، امام بخاری آپ صلی اللہ علیہ وسلم کے قدم مبارک کی جگہ پر اپنا قدم رکھ دیتے ہیں۔ ابو زید مروزی کا خواب حافظ ابن حجر رحمہ اللہ علیہ نے نقل کیا ہے کہ میں رکن اور مقام کے درمیان بیت اللہ کے قریب سو رہا تھا۔ خواب میں نبی صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ اے ابوزید! کب تک شافعی کی کتاب کا درس دیتے رہو گے اور ہماری کتاب کا درس نہ دو گے۔ عرض کیا حضور «فداك ابي وامي» آپ کی کتاب کونسی ہے؟ فرمایا جسے محمد بن اسماعیل بخاری نے جمع کیا ہے۔ طریقہ تالیف الجامع الصحیح البخاری: اس بارے میں خود امام بخاری رحمہ اللہ فرماتے ہیں کہ میں نے کوئی حدیث اس کتاب میں اس وقت تک داخل نہیں کی جب تک غسل کر کے دو رکعت نماز ادا نہ کر لی ہو۔ بیت اللہ شریف میں اسے میں نے تالیف کیا اور دو رکعت نماز پڑھ کر ہر حدیث کے لئے استخارہ کیا۔ مجھے جب ہر طرح اس حدیث کی صحت کا یقین ہوا، تب میں نے اس کے اندارج کے لئے قلم اٹھایا۔ اس کو میں نے اپنی نجات کے لئے جحت بنایا ہے۔ اور چھ لاکھ حدیثوں سے چھانٹ چھانٹ کر میں نے اسے جمع کیا ہے۔ علامہ ابن عدی اپنے شیوخ کی ایک جماعت سے ناقل ہیں کہ امام بخاری الجامع الصحیح کے تمام تراجم ابواب کو حجرہ نبوی اور منبر کے درمیان بیٹھ کر اور ہر ترجمة الباب کو دو رکعت نماز پڑھ کر اور استخارہ کر کے کامل اطمینان قلب حاصل ہونے پر صاف کرتے۔ وراق نے اپنا ایک واقعہ بیان کیا ہے کہ میں امام بخاری کے ساتھ تھا۔ میں نے آپ کو کتاب التفسیر لکھنے میں دیکھا کہ رات میں پندرہ بیس مرتبہ اٹھتے چقماق سے آگ روشن کرتے اور چراغ جلاتے اور حدیثون پر نشان دے کر سو رہتے۔ اس سے پتہ چلتا ہے کہ امام صاحب سفر و حضر میں ہر جگہ تالیف کتاب میں مشغول رہا کرتے تھے اور جب بھی جہاں بھی کسی حدیث کے صحیح ہونے کا یقین ہو جاتا اس پر نشان لگا دیتے اس طرح تین مرتبہ آپ نے اپنے ذخیرہ پر نظر فرمائی۔ آخر تراجم ابواب کی ترتیب اور تہذیب اور ہر باب کے تحت حدیثوں کا درج کرنا۔ اس کو امام صاحب نے ایک بار حرم محترم میں اور دوسری بار مدینہ منورہ مسجد نبوی منبر اور محراب نبوی کے درمیان بیٹھ کر انجام دیا۔ اسی تراجم ابواب کی تہذیب و تبویب کے وقت جو حدیثیں ابواب کے تحت لکھتے پہلے غسل کر کے استخارہ کر لیتے۔ اس طرح پورے سولہ سال کی مدت میں اس عظیم کتاب کی تالیف سے فارغ ہوئے۔ جامع الصحیح کے بارے میں اکابر امت کی آراء: سیدنا امام المحدثین جبل الحفظ سیدنا امام بخاری رحمہ اللہ اور آپ کی جامع الصحیح کے بارے میں ان بارہ سو برسوں میں اکابر امت نے جن آراء مبارکہ کا اظہار کیا ہے، ان سب کی جمع و ترتیب کے لیے بھی ایک مستقل کتاب درکار ہے۔ ان سب کو ملحوظ رکھتے ہوئے بلا خوف تردید کہا جا سکتا ہے کہ امام بخاری عند اللہ مقبول اور آپ کی جامع الصحیح بھی عند اللہ مقبول اور امت کے لیے بلا شک و شبہ قرآن مجید کے بعد سب سے زیادہ صحیح تر قابل عمل کتاب ہے۔ جو شخص بھی امام کی شان میں تنقیص و تخفیف اور آپ کی جامع الصحیح کے بارے میں شکوک و شبہات کی فضا پیدا کرتا ہے وہ اجماع امت کا مخالف ہے۔ خاطی ہے، ناقابل التفات ہے بلکہ شاہ ولی اللہ محدث دہلوی قدس سرہ کے لفظوں میں وہ بدعتی ہے۔ ہم بہت ہی اختصار کے پیش نظر صرف چند آرائے مبارکہ نقل کرتے ہیں۔ امید ہے کہ صاحبان صدق و صفا کے لیے یہ کافی ہوں گی اور وہ ہرگز کسی متقشف اور نامعقول ناقد کے وسواس نامعقولات سے متاثر نہ ہوں گے۔ جامع صحیح کے متعلق پہلے خود امام بخاری رحمہ اللہ کا بیان سنئیے۔ فرماتے ہیں: «لم اخرج فى هذا الكتاب الا صحبحا» میں نے اپنی اس کتاب میں صرف صحیح احادیث کی تخریج کی ہے۔ [‏‏‏‏ مقدمه فتح الباري] اور فرمایا کہ میں نے تقریباً چھ لاکھ طرق سے جامع صحیح کی احادیث کا انتخاب کیا ہے۔ حافظ ابن الصلاح: حافظ ابن الصلاح فرماتے ہیں کہ صحیح بخاری میں تمام مسند احادیث مکررات سمیت 7275 کی تعداد میں ہیں اور مکررات کو نکال دیا جائے تو چار ہزار حدیثیں رہ جاتی ہیں۔ [‏‏‏‏ مقدمه ابن الصلاح ص 8] یہ اختلاف تعداد محض مختلف الاقسام احادیث کی گنتی کے اعتبار سے ہے اس لیے دونوں بیان صحیح ہیں۔ امام بخاری رحمہ اللہ کی حیات طیبہ میں نوے ہزار اشخاص نے براہ راست آپ سے اس عظیم کتاب کا درس لیا اور بلا واسطہ ان کی سند سے روایت کیا ہے۔ امام بخاری رحمہ اللہ جب اس کی جمع و تالیف سے فارغ ہوئے تو آپ نے اسے امام احمد بن حنبل اور امام یحییٰ بن معین اور امام علی بن مدینی وغیرہ اکابر امت کے سامنے پیش کیا۔ سب نے متفقہ طور پر اس کتاب کو مستحسن قرار دیا۔ اور اس کی صحت کی گواہی دی۔ بعض حضرات نے صرف چار احادیث سے متعلق اپنا خیال ظاہر کیا۔ مگر آخر میں ان کے متعلق بھی امام بخاری ہی کا خیال شریف صحیح ثابت ہوا۔ [‏‏‏‏ مقدمه فتح الباري ص 578] حافظ ابن حجر: حافظ ابن حجر لکھتے ہیں کہ امام قدس سرہ نے اپنی جامع صحیح کو مذکورہ بزرگوں کے علاوہ وقت کے دیگر مشائخ و فقہاء و محدثین کے سامنے بھی پیش کیا۔ سب نے متفقہ طور پر اس کتاب کی صحت کی تصدیق و توثیق فرمائی۔ ملا علی قاری: ملا علی قاری نے مشائخ عصر کے یہ لفظ نقل کئے ہیں: «انه لا نظير له فى بابه» [‏‏‏‏ مرقاة جلد اول ص 15] یعنی ”جامع صحیح اپنے باب میں بے نظیر کتاب ہے“۔ امام نسائی: امام نسائی فرماتے ہیں: «اجود هذه الكتب كتاب البخاري واجمعت الامة على صحة هذين الكتابين» یعنی ”امت کا صحیح بخاری و صحیح مسلم ہر دو کتابوں کی صحت قطعی پر اجماع ہو چکا ہے اور جملہ کتب احادیث میں صحیح بخاری سب سے افضل ہے“۔ امام فضل بن اسماعیل جرجانی: البدایہ والنہایہ جلد یاز دہم ص 28 پر امام فضل بن اسماعیل جرجانی کا ایک قصیدہ بابت مدح بخاری شریف منقول ہے جس کا خلاصہ یہ کہ صحیح بخاری سند اور متن کے اعتبار سے اس قدر اعلٰی درجہ کی کتاب ہے کہ اس کی افضیلت پر جملہ اہل علم کا اتفاق اور اجماع ہے۔ نبی کریم صلی اللہ علیہ وسلم کے دین کے لیے یہ کتاب وہ کسوٹی ہے جس کے آگے عرب و عجم سب نے سر تسلیم خم کیا ہے۔ بلاشک صحیح بخاری آب زر سے لکھنے جانے کے قابل ہے۔ صحیح بخاری کی کتابت آب زر سے: امت میں ایسے بھی قدر دان گزرے ہیں جنہوں نے قرآن مجید اور اس کے بعد صحیح بخاری شریف کو خالص آب زر سے لکھوا دیا۔ چنانچہ ایک عالم دین ابو محمد مزنی کے تذکرہ میں لکھا ہے کہ انہوں نے کتابت کرنے والوں کو حکم دیا کہ وہ قرآن مجید اور صحیح بخاری کو آب زر سے لکھ کر ان کے سامنے پیش کریں۔ چنانچہ یہ دونوں کتابیں تمام و کمال آب زر سے لکھ کر ان کے سامنے پیش کی گئیں۔ [‏‏‏‏ مفتاح السعادة جلد اول ص 7] امام ابو الفتح عجلی: امام ابو الفتح عجلی فرماتے ہیں: ”صحیح بخاری کا متن حدیث قوی اور رجال اسناد عالی مرتبہ ہیں۔ صحت میں اس کو وہ بلند مرتبہ حاصل ہے گویا ہر حدیث کو امام بخاری نے نبی کریم صلی اللہ علیہ وسلم سے براہ راست خود حاصل کیا اور درج فرمایا ہے“۔ شیخ الاسلام امام بلقینی: شیخ الاسلام امام بلقینی فرماتے ہیں کہ ”صحیح بخاری حافظ عصر سیدنا امام بخاری کی وہ اہم تصنیف ہے جس میں آپ نے نبی کریم صلی اللہ علیہ وسلم کی سنن صحیحہ کو جمع فرمایا ہے۔ رجال بخاری سب صدوق اور ثقات ہیں۔ ان فضائل و خصوصیات کی بنا پر امت کا اجماع ہے کہ قرآن شریف کے بعد دنیائے اسلام کے ہاتھوں میں سب سے زیادہ صحیح کتاب بخاری شریف ہے“۔ [ارشاد الساري جلد اول ص 44] علامہ عینی حنفی: علامہ عینی ‏‏‏‏ حنفی شارح بخاری لکھتے ہیں: «اتفق علماء الشرق والغرب على انه ليس بعد كتاب الله اصح من صحيح» «البخاري فرجع البعض صحيح مسلم على صحيح البخاري والجمهور على ترجيح البخاري على مسلم» [‏‏‏‏عمدة القاري ص 5] یعنی ”مشرق و مغرب کے تما علماء کا اس امر پر اتفاق ہے کہ کتاب اللہ کے بعد صحیح بخاری و صحیح مسلم سے زیادہ صحیح کوئی کتاب نہیں ہے۔ بعض ائمہ نے مسلم کو بخاری پر مقدم قرار دیا ہے۔ لیکن جمہور علمائے امت نے صحیح بخاری کو مسلم کے مقابلہ میں ترجیح دی ہے اور اسی کو افضل قرار دیا ہے“۔ شاہ ولی اللہ محدث دہلوی: حجۃ الاسلام شاہ ولی اللہ محدث دہلوی فرماتے ہیں: «وانه كل من يهون امرهما فهو مبتدع متبع غير سبيل» المؤمنين [‏‏‏‏ حجة الله البالغة جلد اول ص 134] یعنی ”جو شخص بخاری و مسلم کی توہین و تخفیف کرتا ہے، وہ بدعتی ہے اور اس نے وہ راستہ اختیار کیا ہے جو ایمان والوں سے علیحدہ راستہ ہے (جس کا نتیجہ دوزخ ہے)“۔ مولانا شاہ عبدالعزیز محدث دہلوی: مولانا شاہ عبدالعزیز محدث دہلوی فرماتے ہیں: ”بخاری و مسلم و مؤطا امام مالک کی احادیث نہایت صحیح ہیں۔ جامع صحیح بخاری میں بلحاظ اغلب خود مؤطا کی بھی مرفوع حدیثیں موجود ہیں، اس لحاظ سے صحیح بخاری سب سے زیادہ صحیح اور جامع کتاب ہے“۔ [‏‏‏‏عجال نافعه ص 6] مولانا احمد علی سہارنپوری: مولانا احمد علی سہارنپوری فرماتے ہیں: ”علمائے امت کا اتفاق ہے کہ کتب حدیث میں سب سے زیادہ صحیح کتاب بخاری، پھر مسلم ہے اور اس پر بھی اتفاق ہے کہ ان دونوں میں صحیح بخاری صحت میں بڑھ کر ہے اور زیادہ فوائد کی جامع ہے“۔ [‏‏‏‏ مقدمه مولانا سهارنپوري مرحوم على البخاري ص 4] مولانا انور شاہ صاحب دیوبندی: مولانا انور شاہ صاحب دیوبندی فرماتے ہیں: ”حافظ ابن الصلاح و حافظ ابن حجر و علامہ ابن تیمیہ شمس الائمہ سرخی وغیرہ اجلہ محدثین و فقہاء کا اس پر اتفاق ہے کہ صحیح بخاری و صحیح مسلم کی سب حدیثیں حجت کے لیے قطعی ہیں۔ اور ان اجلہ اصحاب الحدیث و محققین کا فیصلہ میرے نزدیک بالکل درست فیصلہ ہے“۔ [‏‏‏‏ فيض الباري] علامہ شبیر احمد عثمانی دیوبندی: علامہ شبیر احمد عثمانی دیوبندی فرماتے ہیں: ”سب سے پہلے جس نے صرف احادیث صحیحہ کو جمع فرمایا ہے، وہ امام بخاری ہیں۔ پھر ان کے نقش قدم پر امام مسلم نے اپنی صحیح کو جمع فرمایا۔ یہ دونوں کتابیں مصنفات حدیث میں سب سے زیادہ صحیح ہیں“۔ [‏‏‏‏ فتح الملهم شرح مسلم ص 54] اس قسم کے ہزارہا علماء و فضلاء اکابر امت متقدمین و متاخرین کے بیانات کتب تواریخ میں موجود ہیں۔ جن سب کا جمع کرنا اس مختصر سے مقالہ میں ناممکن ہے۔ اس لیے ان چند بیانات پر اکتفا کیا جاتا ہے۔ ان ہی سے ناظرین کو اندازہ ہو سکے گا کہ امت میں امام بخاری اور ان کی جامع الصحیح کا مقام کتنا بلند ہے۔ «والحمدلله على ذالك» دیگر تصانیف امام بخاری رحمہ اللہ: آپ کی عظیم تصنیف الجامع، صحیح پر جو کچھ لکھا گیا وہ محض مشتے نمونہ از خروارے ہے۔ یہ وہ عظیم کتاب ہے جس کے ایک ایک لفظ کی شرح و تفصیل کے لیے دفاتر درکار ہو سکتے ہیں۔ اس کی بہت سی شروحات ہیں۔ فتح الباری کو کسی قدر جامع کہا جا سکتا ہے۔ مگر عصر حاضر میں آج ایک اور فتح الباری کی ضرورت ہے۔ جس میں علوم جدیدہ کی روشنی میں احادیث نبوی کے اس عظیم خزانہ کا مطالعہ ہونا چاہیئے۔ اللہ کے لیے کوئی مشکل نہیں کہ دنیائے اسلام کا کوئی مایہ ناز فرزند علامہ ابن حجر ثانی کی شکل میں پیدا ہو اور یہ خدمت انجام دے۔ آپ نے اس کے علاوہ اور بھی بہت سی کتابیں تصنیف فرمائی ہیں۔ جن میں ”قضایا الصحابہ و التابعین“ آپ نے اپنی عمر عزیز کے اٹھارہویں سال میں پہلی تصنیف فرمائی تھی۔ مگر افسوس کہ آج اس کا کوئی نسخہ موجودہ علم میں نہ آ سکا۔ عمر کے اسی دوران آپ نے ”التاریخ الکبیر“ لکھی جسے دائرۃ المعارف حیدر آباد نے بصورت اجزا شائع کیا تھا۔ ”التاریخ الاوسط“ اور ”التاریخ الصغیر“ بھی آپ کی اہم تصانیف ہیں۔ ”خلق افعال العباد“، ”کتاب الضعفا“، ”الصغیر“، ”المسند الکبیر“، ”الادب المفرد“ بھی آپ کی شاندار یادگاریں ہیں۔ خصوصاً ”الادب المفرد“ بڑی جامع پاکیزہ اخلاقی کتاب ہے۔ جسے آپ نے بہترین مدلل طور پر جمع فرمایا ہے۔ اس کی عربی شروح اور اردو تراجم کافی شائع ہو چکے ہیں۔ ‏‏‏‏ (حج 62 ء میں ایک نسخہ معہ شرح فضل اللہ الصمد جدہ سے بطور تحفہ ملا تھا۔ جزاہ اللہ خیر الجزاء) ”جزء القرأۃ خلف الامام“ بھی آپ کا مشہور رسالہ ہے۔ جو ”قرأۃ خلف الامام“ کے متعلق ایک فیصلہ کن حیثیت رکھتا ہے۔ مصر میں طبع ہو چکا ہے۔ آپ نے اس رسالہ میں احادیث و سنن کی روشنی میں قرأت فاتحہ خلف الامام کا اثبات فرمایا ہے۔ اور خلاف دلائل پر بھی روشنی ڈالی ہے۔ اسی طرح دوسرا رسالہ آپ کا جزء رفع یدین کے نام سے مشہور ہے۔ جس میں آپ نے بطرز اہلحدیث رفع الیدین کا مدلل اثبات فرمایا ہے۔ ان دونوں اجزاء کے آپ سے روایت کرنے والے آپ کے شاگرد رشید محمود بن اسحاق خزاعی ہیں۔ آپ سیدنا امام کے وہ شاگرد ہیں جنہوں نے بخارا میں سب سے آخر میں آپ سے شرف تلمند حاصل کیا۔ ان کے علاوہ اور بھی بہت سی آپ کی قلمی یادگاریں ہیں جن میں سے اکثر ناپید ہو چکی ہیں۔ بعض کے قلمی نسخے دوسری جنگ عظیم سے قبل کتب خانہ دارالعلوم جرمن میں پائے گئے۔ اب نہ معلوم انقلابت زمانہ نے ان کو بھی باقی رکھا ہے یا نہیں۔ بہر حال «يَمْحُو اللَّـهُ مَا يَشَاءُ وَيُثْبِتُ وَعِنْدَهُ أُمُّ الْكِتَابِ» ۔ [‏‏‏‏ الرعد: 39] ◈قرآن مجید کے بعد سب سے صحیح و مقبول ترین کتاب: «الجامع الصحيح المسند من حديث رسول الله وسننه وأيامه»، جو کہ «الجامع الصحيح» یا «صحيح البخاري» کے نام سے معروف ہے۔ ◈ «الأدب المفرد» ‏‏‏‏ ◈ «التاريخ الكبير» ‏‏‏‏ (یہ تراجم کے بارے میں ایک بڑی کتاب ہے امام بخاری رحمہ اللہ نے حدیث کے راویوں کو حروف معجم پر مرتب کیا ہے)۔ ◈ «التاريخ الصغير» (یہ نبی صلی اللہ علیہ وسلم ، صحابہ کرام اور ان کے بعد کے رواۃ کی مختصر تاریخ پر مبنی ہے)۔ ◈ «خلق أفعال العباد» ◈ «جزء رفع اليدين فى الصلاة» ‏‏‏‏ ◈ «الكُنى» ◈ «التاريخ الاوسط» ◈ «التفسير الكبير» بھی ان کی کتب میں سے ہیں۔ وفات: خالد بن ذہلی حاکم بخارا کی بابت لکھا جا چکا ہے کہ وہ سید المحدثین سے محض اس بنا پر کہ آپ نے درس حدیث کے لیے شاہی دربار میں جانے اور اس کے صاحبزادوں کے لیے وقت مخصوص کرنے سے انکار فرما دیا تھا، مخالفت پر آمادہ ہو گیا تھا۔ اور چاہتا تھا کہ کسی بہانہ سے سیدنا امام کو شہر بخارا سے نکال دیا جائے۔ جس میں وہ اس زمانہ کے علمائے سوء کے تعاون سے کامیاب ہو گیا۔ انہوں نے سیدنا امام پر عقائد کے بارے میں الزام لگایا اور پھر حفظ امن کے بہانے سے سیدنا امام کو بخارا سے نکل جانے کا حکم دے دیا۔ آپ بادل ناخواستہ بخارا سے یہ کہتے ہوئے نکلے کہ ”اے اللہ! ان لوگوں نے میرے ساتھ جو ارادہ کیا تھا۔ وہی صورت حال ان کو اپنے اور ان کے اہل و عیال کے بارے میں دکھلا دے۔“ مظلوم امام کی دعا قبول ہوئی۔ اور ایک ماہ بھی نہ گزرا تھا کہ ذہلی امیر طاہر کے حکم سے معزول کر کے گدھے پر پھرایا گیا اور قید میں ڈال دیا گیا۔ اور حریث بن ابی ورقاء جو آپ کے نکلوانے میں سازشی تھا۔ اس کو اور اس کے گھر والوں کو سخت مصیبت پیش آئی۔ اور دوسرے مخالفین بھی اسی طرح غائب و خاسر ہوئے۔ دنیا کا یہی دستور ہے ایک دن وہ تھا کہ سیدنا امام بخاری اپنے علمی اسفار سے بخارا واپس لوٹے تو شہر سے تین میل کے فاصلے پر ان کے لیے ڈیرے لگائے گئے۔ اور پورا شہر ان کے استقبال کے لیے امنڈ آیا اور ان پر روپے اور اشرفیاں تصدق کئے گئے۔ ایک دن آج ہے کہ سیدنا امام کو اپنے وطن مالوف سے نکالا جا رہا ہے اور وہ دست بدعا، بے کسی کی حالت میں وطن سے بے وطن ہو رہے ہیں۔ آپ بخارا سے چل کر بیکند پہنچے۔ وہاں سے سمرقند والوں کی دعوت پر سمر قند کے لیے دعوت قبول فرمائی۔ خرتنگ نامی ایک گاؤں میں جو مضافات سمرقند سے تھا، آپ پہنچے ہی تھے کہ طبیعت خراب ہو گئی اور وہاں اپنے اقرباء میں اتر گئے۔ ایک رات آپ نے اللہ سے دعا کی کہ الٰہ العالمین اب زمین میرے لیے تنگ نظر آ رہی ہے، بہتر ہے کہ تو مجھے اپنے پاس بلا لے۔ آخر ۱۳ دن کم ۶۲ سال کی عمر میں یہ آفتاب حدیث خرتنگ کی زمین میں غائب ہو گیا۔ «انالله وانا اليه راجعون» روح پرواز کر جانے کے بعد بھی برابر جسم پر پسینہ جاری رہا۔ یہاں تک کہ آپ کو غسل دے کر کفن میں لپیٹ دیا گیا۔ کچھ لوگ سمرقند لے جانے کے خواہشمند ہوئے۔ مگر خرتنگ ہی میں تدفین کے لیے اتفاق ہو گیا۔ عیدالفطر کے دن نماز ظہر کے بعد آپ کا جنازہ اٹھایا گیا۔ ایک خلق کثیر نے تدفین میں شرکت کی۔ اور آج وہ احادیث رسول اللہ صلی اللہ علیہ وسلم کا آفتاب عالمتاب، دنیائے اسلام کا محسن اعظم خاک میں چھپ گیا اور دنیا میں تاریکی ہو گئی۔ ایک شاعر نے آپ کے سال ولادت اور سال وفات ہر دو کو ایک ہی بند میں جمع کر دیا ہے، فرماتے ہیں۔ «كان البخاري حفظا و محدثا ...... جمع الصحيح مكمل التحرير» «ميلاده صدق ومدة عمره فيها ...... حميد وانقضي فى نور» ۱۹۴ ...... ۶۲ ...... ۲۵۶ خطیب عبدالواحد بن آدم کہتے ہیں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو خواب میں چند اصحاب کرام کے ساتھ کسی کا منتظر دیکھا۔ سلام کے بعد عرض کیا حضور کس کا انتظار فرما رہے ہیں؟ ارشاد ہوا کہ میں آج محمد بن اسماعیل بخاری کے انتظار میں کھڑا ہوا ہوں۔ بعد میں جب سیدنا امام کے انتقال کی خبر پہنچی تو میں نے خواب کے وقت کے بارے میں سوچا، امام کے انتقال کا ٹھیک وہی وقت تھا۔ آپ کی وفات حسرت آیات پر دنیائے اسلام میں ایک تہلکہ برپا ہو گیا۔ ہر شہر قریہ میں مسلمانوں نے اظہار غم کیا۔ اور آپ کے لیے دعائے مغفرت کی۔ علمائے امت اور مشاہیر اسلام نے اس سانحہ پر بہت سے مقالہ جات اور اشعار لکھے جو کتب تواریخ میں لکھے ہوئے ہیں۔ اساتذہ: امام محمد بن اسماعیل البخاری رحمہ اللہ نے علم کے حصول کے لئے مختلف علاقوں، شہروں اور ملکوں کا سفر طے کیا۔ آپ رحمہ اللہ خود فرماتے ہیں کہ میں نے ایک ہزار اسّی (1080) اساتذہ سے سنا کہ ایمان قول و عمل کا نام ہے۔ [ فتح الباري] نوٹ: امام بخاری رحمہ اللہ کا یہ کہنا اس بات کی دلیل ہے کہ آپ کے ایک ہزار سے زیادہ استاد تھے اور مختلف شہروں اور ملکوں سے تعلق رکھتے تھے، چنانچہ: امام بخاری رحمہ اللہ نے: ◈ ”شہرِ بلخ“ میں جناب مکی بن ابراہیم رحمہ اللہ سے علم حاصل کیا جن سے امام بخاری رحمہ اللہ کی سند عالی بھی ہے اور ثلاثی بھی (یعنی امام بخاری رحمہ اللہ کے اپنے استاذ مکی بن ابراہیم سے روایت کردہ احادیث میں امام بخاری رحمہ اللہ اور رسول اللہ صلی اللہ علیہ وسلم کے درمیان فقط تین واسطے ہیں)۔ ◈ اور ”شہرِ مرو“ میں عبدان بن عثمان، علی بن حسن بن شقيق، صدقۃ بن الفضل رحمھم اللہ سمیت اہلِ علم کی ایک جماعت سے علم حاصل کیا۔ ◈ اور ”نیشاپور“ میں یحی بن یحی رحمہ اللہ اور ایک جماعت سے علم حاصل کیا۔ ◈ اور ”بغداد“ میں محمد بن عيسى بن الطباع، سريج بن النعمان، محمد بن سابق اور عفان رحمۃ اللہ علیہم سے علم حاصل کیا۔ ◈ اور ”بصرہ“ میں ابوعاصم النبيل الانصاری، عبد الرحمن بن حماد الشعيثی (صاحب ابن عون)، محمد بن عرعرة،حجاج بن منھال، بدل بن المحبر، عبد الله بن رجاء رحمۃ اللہ علیہم سے علم حاصل کیا۔ ◈ اور ”کوفہ“ میں عبيد الله بن موسى،ابونعيم، خالد بن مخلد اور طلق بن غنام رحمۃ اللہ علیہم سے علم حاصل کیا۔ ◈ اور ”مکہ“ میں ابوعبد الرحمن المقری،خلاد بن يحيى،حسان بن حسان البصری،ابو الوليد احمد بن محمد الازرقی اور حميدی رحمۃ اللہ علیہم سے علم حاصل کیا۔ ◈ اور ”مدینہ“ میں عبد العزيز الاويسی، ايوب بن سليمان بن بلال، اسماعيل بن ابواويس رحمۃ اللہ علیہم سے استفادہ کیا۔ ◈ اور ”مصر“ میں سعيد بن ابی مريم و احمد بن اشكاب، عبد الله بن يوسف، اصبغ رحمۃ اللہ علیہم اور دیگر سے استفادہ کیا۔ ◈ اور ”شام“ میں ابو اليمان،آدم بن ابی اياس،علی بن عياش اور بشر بن شعيب رحمۃ اللہ علیہم سے علم حاصل کیا۔ دیکھیے: [سير اعلام النبلاء للامام الذهبي رحمه الله] شاگرد: امام بخاری رحمہ اللہ کو یہ مقام و مرتبہ حاصل ہے کہ امت مسلمہ کے بڑے بڑے اور مشہور ائمہ و فقہاء سمیت ایک بہت بڑی تعداد نے آپ رحمہ اللہ سے شرف تلمّذ حاصل کیا جن میں چند کے نام درج ذیل ہیں: امام مسلم، امام ابو عيسى الترمذی، امام ابو حاتم،امام ابراهيم بن اسحاق الحربی، امام ابوبكر محمد بن اسحاق بن خزيمۃ، امام ابوبكر بن ابی الدنيا، امام ابوبكر احمد بن عمرو بن ابی عاصم، صالح بن محمد جزرة، محمد بن عبد الله الحضرمی مطين، ابراهيم بن معقل النسفی،عبدالله بن ناجيۃ، عمر بن محمد بن بجير، ابو قريش محمد بن جمعۃ، يحيى بن محمد بن صاعد،محمد بن يوسف الفربری رحم اللہ الجمیع جو کہ صحیح بخاری کے راوی ہیں۔ اسی طرح منصور بن محمد مزبزدة، ابو بكر بن ابی داؤد، الحسين، القاسم (جو کہ محاملی کے بیٹے ہیں)، عبد الله بن محمد بن الاشقر، محمد بن سليمان بن فارس، محمود بن عنبر النسفي وغیرھم رحم اللہ الجمیع۔ محدث اعظم و مجتہد معظم امام بخاری رحمہ اللہ اور مسالک مروجہ:​ مسالک مروجہ سے مراد: مسالک مروجہ سے مراد مذاہب اربعہ ہیں جو ائمہ اربعہ امام ابوحنیفہ، امام شافعی، امام احمد بن حنبل، امام مالک رحمۃ اللہ علیہم اجمعین کی طرف منسوب ہیں۔ ان مسالک کے پیروکار اپنے اپنے امام کی تقلید علی الاطلاق اپنے لیے واجب جانتے ہیں۔ اور تقلید شخصی کا ترک ان کے ہاں کسی طرح بھی جائز نہیں۔ تقلید کی تعریف: تقلید کی تعریف یوں کی گئی ہے: «التقليد اتباع الرجل غيره فيما» «سمعه بقوله اوفي فعله على زعم انه محقق بلانظر فى الدليل» [‏‏‏‏ حاشيه نور الانوار لكهنو ص 216] یعنی ”تقلید کہتے ہیں کسی کا قول محض اس حسن ظن پر مان لینا کہ یہ دلیل کے موافق ہی ہو گا۔ اور اس سے دلیل کی تحقیق نہ کرنا“۔ صاحب مسلم الثبوت: صاحب مسلم الثبوت لکھتے ہیں: «التقليد العمل بقول الغير من غير حجة» [‏‏‏‏ مسلم ص 289] یعنی ”بغیر دلیل کسی کی بات کو عملاً مان لینا تقلید ہے“۔ عام طور پر مقلدین مذاہب اربعہ کا یہی طریقہ ہے۔ اس روشنی میں سیدنا محدث اعظم مجہتد معظم سیدنا امام بخاری رحمہ اللہ کو مسالک اربعہ میں سے کسی ایک مسلک کا مقلد بتانا ایسا ہی ہے جیسا کہ چمکتے ہوئے سورج کو رات سے تعبیر کرنا۔ یہ حقیقت ہے کہ امام بخاری رحمہ اللہ کسی بھی مذہب منتسبہ کے مقلد نہ تھے۔ ان کا علم و فضل، ان کا درجہ اجتہاد و استنباط اس حد تک پہنچا ہوا ہے کہ ان کو مقلد کہنا سراسر جہل و حماقت ہے۔ اللہ تعالیٰ نے ان کو بلند ترین مقام نصیب فرمایا تھا۔ کچھ متقدمین نے ان کو طبقات شافعیہ میں شمار کیا ہے مگر یہ ان کی محض خوش فہمی ہے یا یہ مراد ہے کہ مسائل خلافیہ میں وہ زیادہ تر امام شافعی رحمہ اللہ کو موافقت کرتے ہیں۔ اس لیے ان کو شافعی کہہ دیا گیا۔ ورنہ واقعہ یہ ہے کہ انہوں نے اپنی جامع صحیح میں جس طرح مقلدین احناف سے اختلاف کیا ہے اسی طرح مالکیہ، شافعیہ اور حنابلہ سے بھی بعض بعض مقامات پر اختلاف کیا ہے۔ شاہ ولی اللہ: شاہ ولی اللہ: شاہ ولی اللہ فرماتے ہیں: «واما البخاري فهو وان كان منتسبا الي الشافعي موافقاله فى كثير من الفقه فقد» «خالفه ايضا فى كثير الي آخره» یعنی کثرت موافقات کے سبب امام بخاری کو امام شافعی کی طرف منسوب کر دیا گیا ہے۔ مگر واقعہ یہ ہے کہ جس کثرت سے موافقت ہے اسی کثرت سے امام شافعی کی مخالفت بھی موجود ہے۔ جن کی بہت سی مثالیں بخاری شریف کا مطالعہ کرنے والوں پر ظاہر ہوں گی۔ مولانا سید انور شاہ صاحب دیوبندی: مولانا سید انور شاہ صاحب دیوبندی: مولانا سید انور شاہ صاحب دیوبندی رحمہ اللہ نے واضح طور پر بجا ارشاد فرمایا ہے کہ «ان البخاري عندي سلك مسلك الاجتهاد ولم يقلدا احدا فى كتابه الخ» [‏‏‏‏فيض الباري جلد اول ص 335] یعنی ”امام بخاری نے ایک مجتہد کی حیثیت سے اپنا مسلک بنایا ہے اور اپنی کتاب میں ہرگز انہوں نے کسی کی تقلید نہیں کی“۔ صاحب ایضاح البخاری دیوبندی: صاحب ایضاح البخاری دیوبندی: صاحب ایضاح البخاری دیوبندی لکھتے ہیں: ”لیکن حقیقت یہ ہے کہ کسی شافعی یا حنبلی سے تلمذ اور تحصیل علوم کی بنا پر کسی کو شافعی یا حنبلی کہنا مناسب نہیں بلکہ امام کے تراجم بخاری کے گہرے مطالعہ سے معلوم ہوتا ہے کہ امام ایک مجتہد ہیں۔ انہوں نے جس طرح احناف سے اختلاف کیا ہے وہاں حضرات شوافع سے اختلاف کی تعداد بھی کچھ کم نہیں ہے۔ ہاں اتنا ضرور ہے کہ احناف کے ساتھ ان کا لب و لہجہ کرخت ہے۔ اور مشہور مسائل میں ان کی رائے حضرات شوافع کے موافق ہے ...... امام کے اجتہاد اور تراجم ابواب میں ان کی بالغ نظری کے پیش نظر ان کو کسی فقہ کا پابند نہیں کہا جا سکتا۔“ [‏‏‏‏ايضاح البخاري جز اول ص 30] خلاصۃ المرام: خلاصۃ المرام یہ ہے کہ سیدنا سید المحدثین امام بخاری رحمہ اللہ ایک مجتہد اعظم تھے۔ وہ قرآن و حدیث کو براہ راست اپنا مدار عمل قرار دیتے تھے۔ اور صحیح معنوں میں وہ نہ صرف اہلحدیث بلکہ امام اہلحدیث تھے۔ ان کی جامع الصحیح کا ایک ایک ورق اس حقیقت پر شاہد ہے۔ احادیث نبوی ہی ان کا اوڑھنا بچھونا تھا۔ حدیث کی ادنٰی سی مخالفت بھی ان کے لیے ناقابل برداشت تھی۔ وہ صحیح معنوں میں فدائے رسول تھے۔ وہ درحقیقت مینار ہدایت تھے۔ امام بخاری مجتہد تھے:​ علامہ ذہبی: علامہ ذہبی جن کے متعلق محمد حسین نیلوی حنفی لکھتے ہیں:​ ”جب امام ذہبی اس کی تصحیح کر دیں تو قطعی صحیح بن جائے گی جس کا منکر کافر نہیں تو کم از کم فاسق ضرور ہو گا کیونکہ امام ذہبی رحمہ اللہ کا قول حجت ہے“۔ [نداء حق 285] ​ علامہ ذہبی لکھتے ہیں:​ «وكان إماما حافظا حجة رأسا فى الفقه والحديث مجتهدا من أفراد العالم مع الدين والورع والتأله .» ​”آپ امام، حافظ، حجت چوٹی کے فقیہ و محدث اور مجتہد تھے، نیز دین داری تقوی و پرہیز گاری اور عبادت گزاری کے ساتھ ساتھ یگانہ روزگار تھے۔“ [الكاشف للذهبي 3 / 18] رشید احمد گنگوہی حنفی: رشید احمد گنگوہی جن کے متعلق عاشق الہی میرٹھی حنفی نے واشگاف الفاظ میں لکھا ہے:​ «قطب العالم، قدوة العلماء، غوث الأعظم، أسوة الفقهاء، جامع الفضائل والفواضل العلية، مستجمع الصفات الخصائل البهية والسنية، حامي دين مبين مجدد زمان وسيلتنا إلى الله الصمد الذى لم يلد و لم يولد شيخ المشائخ» [تذكرة الرشيد 2] ​ رشید احمد گنگوہی لکھتے ہیں:​ «الإمام البخاري عندي مجتهد برأسه و هذا أيضا ظاهر من ملاحظة تراجمه بدقة النظر» [لامع الداري على جامع البخاري 19] ​ ”امام بخاری میرے نزدیک مجتہد مستقل ہیں اور یہ دقیق نظر کے ساتھ ان کے تراجم ابواب کے ملاحظہ سے ظاہر ہے“۔ علامہ عبد الرشید نعمانی حنفی: محمد عبد الرشید نعمانی حنفی لکھتے ہیں:​ «قال سليمان بن إبراهيم العلوي: البخاري إمام مجتهد برأسه كأبي حنيفة والشافعي ومالك و أحمد .» [ما تمس إليه الحاجة 26] ​ ”امام بخاری رحمہ اللہ ائمہ اربعہ ابوحنیفہ، امام شافعی، امام مالک اور امام احمد کی طرح چوٹی کے مجتہد تھے“۔ انور شاہ کشمیری حنفی: مولانا انور شاہ کشمیری حنفی جن کے متعلق انظر شاہ حنفی [نقش دوام حیات کشمیری ص 290] پر شیخ علی کا قول نقل کرتے ہیں:​ «لو حلفت أنه أعلم بأبي حنيفة لما حنثت» وہ (انور شاہ کشمیری حنفی) لکھتے ہیں:​ «واعلم أن البخاري مجتهد لا ريب فيه» [مقدمه فيض الباري 1 / 58] ​ ”یہ بات جان لینی چاہیے کہ امام بخاری رحمہ اللہ مجتہد ہیں اس میں کوئی شک و شبہ نہیں ہے۔“ ایک اور مقام پر امام بخاری کو شافعی المذہب کہنے والوں کا رد کرتے ہوئے لکھتے ہیں: «لكن الحق أن البخاري مجتهد» [العرف الشذي 126/1] ​ محمد زکریا حنفی: محمد زکریا حنفی لکھتے ہیں: ”یہاں ایک مسئلہ یہ ہے کہ اہل حدیث اور ائمہ محدثین مقلد تھے یا غیر مقلد؟ پھر مقلد ہونے کی صورت میں کس کی تقلید کرتے تھے؟ اس کے اندر علماء کا اختلاف ہے اور یہ بات ہے کہ جو آدمی بڑا ہوتا ہے اس کو ہر شخص چاہتا ہے کہ ہماری پارٹی میں شامل ہو جائے، کیونکہ اس میں تجاذب اور کشش بہت ہوتی ہے اور ہر ایک اپنی طرف کھینچتا ہے، چنانچہ امام بخاری رحمہ اللہ کے متعلق غیر مقلدین تو کہتے ہیں کہ وہ غیر مقلد تھے اور مقلدین ان کو مقلد مانتے ہیں، اسی طرح بہت سے شوافع نے اپنے طبقات میں ان کو شافعی تحریر کیا ہے، چکی کا پاٹ یہ ہے کہ امام بخاری پختہ طور پر مجتہد تھے“۔ [تقرير بخاري شريف 41] ​ سلیم اللہ خان حنفی: سلیم اللہ خان حنفی (مہتمم جامعہ فاروقیہ کراچی) لکھتے ہیں: ”بخاری مجتہد مطلق ہیں۔“ [فضل الباري 36/1] محمد عاشق الہی حنفی: محمد عاشق الہی بلندی شہری حنفی، محمد زکریا حنفی کی سوانح عمری میں لکھتے ہیں:​ ”میرے نزدیک صحیح بات یہ ہے کہ امام بخاری رحمہ اللہ پختہ طور پر مجتہد تھے، اگر امام صاحب کو مقلد مان لیا جائے تو یہ ہمارے جیسے مقلد نہیں کہلائیں گے کہ جو امام نے کہہ دیا بس اسی پر عمل کر لیا“۔ [سوانح عمري محمد زكريا ص 334] ​ احمد رضا بجنوری حنفی: احمد رضا بجنوری حنفی لکھتے ہیں:​ ”جامع صحیح بخاری مجموعی حیثیت سے اپنے بعد کی تمام کتابوں پر فوقیت و امتیاز رکھتی ہے، اس کے تراجم و ابواب کو بھی امام بخاری رحمہ اللہ کی فقہی ذکاوت و دقت نظر کے باعث خصوصی فضیلت و برتری حاصل ہے، لیکن امام بخاری رحمہ اللہ چونکہ خود درجہ اجتہاد رکھتے تھے، اس لیے انہوں نے جمع احادیث کا کام اپنے نقطہ نظر سے قائم کئے ہوئے تراجم و ابواب کے مطابق کیا۔“ [أنوار الباري شرح اردو صحيح البخاري 34/3] ​ علامہ اسماعیل عجلونی حنفی: ابن عابدین شامی حنفی کے استاذ علامہ اسماعیل عجلونی حنفی لکھتے ہیں کہ:​ «كان مجتهدا مطلقا» [الفوائد الدارري بحواله الكوثر الجاري 7] ​ محمد عبد القوی حنفی: محمد عبدالقوی حنفی لکھتے ہیں:​ ”جمہور علماء کی تحقیق میں امام بخاری مجتہد ہیں۔“ [ مفتاح النجاح 28] محمد صدیق حنفی: محمد صدیق حنفی لکھتے ہیں:​ ”امام بخاری مجتہد ہیں، بعض نے کہا شافعی المسلک ہیں لیکن راجح یہی ہے کہ مجتہد ہیں۔“ [الخبر الساري فى تشريحات البخاري 68] ​ عبد الحی لکھنوی حنفی: عبد الحی لکھنوی حنفی لکھتے ہیں:​ «فقد وجد بعدهم أيضا أرباب الاجتهاد المستقل كأبي ثور البغدادي و داود الظاهري و محمد بن إسماعيل البخاري وغيرهم على ما [ لا] يخفى على من طالع كتب الطبقات .» [النافع الكبير 16] ​ ”ان کے بعد اجتہاد مستقل والے حضرات ہوئے ہیں جس طرح کہ ابوثور بغدادی، داؤد ظاہری اور محمد بن اسماعیل بخاری وغیرہ ہیں، جس نے کتب طبقات کامطالعہ کیا ہے اس پر یہ بات پوشیدہ نہیں ہے۔“ ابوالحسن سندھی حنفی: ابو الحسن سندھی حنفی حاشیہ بخاری (مصری) میں قول فیصل لکھتے ہیں:​ «والصحيح أنه مجتهد» [بحواله الكوثر الجاري​ لأبي القاسم بنارسي 7] ​ ”صحیح بات یہ ہے کہ وہ مجتہد تھے۔“ قاری محمد طیب حنفی: قاری طیب حنفی لکھتے ہیں:​ ”امام بخاری رحمہ اللہ کی یہ صفت تمام محدثین کرام میں امتیازی طور پر معروف ہے، نسائی رحمہ اللہ کو کہتے ہیں کہ انہوں نے امام بخاری رحمہ اللہ کا کچھ نقش قدم اختیار کیا مگر بہرحال اصل اصل ہے، فرع فرع ہے، صنع بخاری یہ بہت اونچی چیز ہے اور تراجم بخاری یہ تو فی الحقیقت فقہ کا ایک مستقل باب ہے «فقه البخاري فى تراجمه» تو امام بخاری رحمہ اللہ محدث بھی ہیں اور فقیہ بھی ہیں نیز اجتہاد کے رتبے کو پہنچے ہوئے ہیں۔“ [خطبات حكيم الاسلام 456/5] ​ نور الحق حنفی: نور الحق حنفی لکھتے ہیں: ​ «وے درزمان خود در حفظ احاديث و اتقان آن و فهم معاني كتاب وسنت و حدت ذهن و جودت قريحت و وفور فقه و كمال زهد و غايت ورع و كثرت اطلاع بر طرق حديث و علل آں ودقت نظر و قوت اجتهاد و استنباط فروع از اصول نظيرے نداشت .» ”وہ اپنے زمانہ میں حدیث حفظ و اتقان، معانی کتاب و سنت کے فہم، ذہن کی تیزی، حافظہ کی عمدگی، و فورقہ، کمال زہد، غایت ورع، اسانید و علل حدیث پر کثرتِ اطلاع، دقت، قوت اجتہاد اور اصول سے فروع استنباط کرنے میں اپنی مثال نہیں رکھتے تھے۔“ امام بخاری کسی فقہی مذہب کے پابند نہ تھے:​ قاضی عبدالرحمٰن حنفی: قاضی عبد الرحمن حنفی فاضل دار العلوم دیوبند لکھتے ہیں: ”بعض فقہی مسائل میں امام شافعی رحمہ اللہ کی موافقت کی وجہ سے امام بخاری رحمہ اللہ کو شافعی کہنے کا جواز نکل سکتا ہے اور اسی طرح بعض قرائن سے انہیں حنبلی کہا جا سکتا ہے تو اسحاق بن راہویہ کا شاگرد ہونے کی وجہ سے امام بخاری رحمہ اللہ کو حنفی المسلک بھی کہا جا سکتا ہے، پھر بہت سے مسائل میں امام بخاری رحمہ اللہ نے امام شافعی کی مخالفت اور حنفیہ کی تائید بھی کی ہے، انہوں نے جس طرح احناف سے اختلاف کیا ہے اسی طرح شوافع سے بھی کیا ہے، حقیقت یہ ہے کہ امام بخاری رحمہ اللہ کے تراجم ابواب میں جو بالغ نظری پائی جاتی ہے اس کے پیش نظر ان کو کسی مسلک کا پابند نہیں کہا جا سکتا وہ کسی مسلک کے متبع نہ تھے بلکہ خود ایک مجتہد کی شام رکھتے تھے۔“ [فضل الباري 64/1] انور شاہ کشمیری حنفی: انور شاہ کشمیری حنفی جن کے متعلق مولانا اشرف علی تھانوی حنفی کہتے ہیں: «إن وجود مثله فى الملة الإسلامية آية على أن الإسلام دين حق وصدق .» ‏‏‏‏ [ترجمة صاحب العرف الشذي على جامع الترمذي، مكتبه رحمانيه لاهور] ​ وہ (انور شاہ کشمیری حنفی) لکھتے ہیں: «واعلم أن البخاري مجتهد لا ريب فيه وما اشتهر أنه شافعي فلموافقته إياه فى السمائل المشهورة و إلا فموافقته للإمام الأعظم ليس بأقل مما وافق فيه الشافعي، وكونه من تلامذة الحميدي لا ينفع لأنه من تلامذة إسحاق بن راهويه أيضا فهو حنفي، فعده شافعيا باعتبار الطبقة ليس بأولى من عده حنفيا .» [فيض الباري 58/1] عبارت مذکورہ کا خلاصہ یہ ہے کہ امام بخاری رحمہ اللہ مجتہد تھے اس میں کوئی شک و شبہ نہیں ہے، اور یہ جو مشہور ہے کہ آپ شافعی ہیں تو وہ مسائل مشہورہ میں امام شافعی رحمہ اللہ سے موافقت کی وجہ سے ہے، اگر یہ بات کہی جائے کہ امام بخاری رحمہ اللہ امام حمیدی رحمہ اللہ کے شاگرد ہیں جو کہ شافعی ہیں تو یہ بات بھی اس کے لیے دلیل اور فائدہ مند نہیں ہے کیونکہ آپ اسحاق بن راہویہ کے بھی شاگرد ہیں جو کہ حنفی ہیں رہی بات امام شافعی سے موافقت والی تو آپ نے بہت سے مسائل میں امام ابوحنیفہ رحمہ اللہ سے موافقت کی ہے۔"
}