{
    "book_name": "Bulugh Al Maram",
    "urdu_text": "سوانح حیات حافظ ابن حجر عسقلانی رحمہ اللہ نام و نسب: اس کتاب کے مؤلف ابوالفضل شہاب الدین احمد بن علی بن محمد بن محمد بن احمد کنانی شافعی ہیں جو ابن حجر عسقلانی کے نام سے مشہور ہیں۔ آپ سنت نبوی کا علم بلند کرنے والے قاضی القضاۃ اور حفاظ و رواۃ میں منفرد شخصیت ہیں۔ ولادت: 10 شعبان 773 ہجری کو مصر میں پیدا ہوئے اور مصر ہی میں پرورش پائی۔ ابتدائی تعلیم، سفر اور اساتذہ کرام: نو سال کی عمر میں قرآن مجید حفظ کیا اور الحاوی، مختصر ابن حاجب اور دیگر کتب حفظ کر لیں، بعد ازاں اپنے ایک وصِی کے ہمراہ مکہ مکرمہ کا سفر کیا اور وہاں اہل علم سے سماع کیا، پھر آپ کو طلب حدیث کا شوق ہوا تو آپ حجاز، شام اور مصر کے کبار شیوخ الحدیث سے علم حدیث حاصل کرنے میں مشغول ہو گئے، چنانچہ آپ نے دس سال تک علم حاصل کرنے کے لیے زین عراقی کے پاس قیام کیا اور بلقینی، ابن ملقن اور دیگر اہلِ علم سے فقہ حاصل کی۔ آپ کو اتنی کثیر تعداد میں جلیل القدر ائمہ و شیوخ الحدیث کے پاس بیٹھنے اور علم حاصل کرنے کا شرف حاصل ہوا جو کسی دوسرے کو میسر نہ ہو سکا۔ متقدم الذکر ائمہ و شیوخ نے آپ کو فتویٰ دینے اور تدریس کرنے کا اجازت نامہ عنایت کیا۔ آپ نے دونوں اصول، یعنی کتاب و سنت اور دیگر علوم ”عز بن جماعہ“ سے، لغت ”مجد فیروز آبادی“ سے، عربی زبان ”عماری“ سے، ادب و عروض ”بدر مشتکی“ سے اور کتابت ایک جماعت سے حاصل کی، اور فنون و علوم میں اس قدر محنت اور سعی کی کہ ان کی چوٹیوں کو چھونے لگے، نیز آپ نے قرأت سبعہ میں قرآن مجید کا کچھ حصہ ”تنوخی“ سے پڑھا۔ تعلیمی سفر: پھر علم حدیث کی نشر و اشاعت کی طرف متوجہ ہوئے اور مطالعہ، قرأت، تدریس و تصنیف اور افتا کی صورت میں اس پر جمے رہے، اور متعدد جگہوں میں تفسیر، حدیث اور فقہ کی تدریس کی، وعظ و نصیحت میں مشغول رہے اور ازہر ”جامع مسجد عمرو“ اور دیگر مقامات پر خطبہ دیتے رہے، نیز اپنے سینے میں محفوظ خزینے کی املا کروانے کا سلسلہ جاری کیا، چنانچہ بڑے بڑے فضلاء اور نامور علماء آپ سے فیض یاب ہوئے اور آپ کے علمی چشمے سے سیراب ہونے کے لیے آپ کے پاس آتے رہے۔ تصانیف: آپ کی تصانیف 150 کتب سے متجاوز ہیں۔ علم حدیث کے فنون میں شاید ہی کوئی ایسا فن ہو جس میں آپ نے ضخیم کتب تصنیف نہ کی ہوں۔ اور آپ کی یہ تصانیف آپ کی حیات ہی میں طباعت کے زیور سے آراستہ ہو گئی تھیں۔ بادشاہ اور اُمراء ایک دوسرے کو ان کتب کے تحائف دیا کرتے تھے۔ اگر ”فتح الباری“ شرح صحیح بخاری کے علاوہ آپ کی کوئی اور تالیف نہ بھی ہوتی تو یہی فتح الباری آپ کی شہرت اور آپ کے عظیم المرتبت ہونے پر واقفیت حاصل کرنے کے لیے کافی تھی۔ اس بات میں کوئی شک و شبہ نہیں کہ آپ کی یہ کتاب، سنت نبوی کے لیے قاموس کا مقام رکھتی ہے۔ 813 ہجری میں اس کا مقدمہ مکمل کرنے کے بعد آپ نے سے 817 ہجری میں اس کی تالیف کا آغاز کر کے شروع رجب 842 ہجری میں اس کی تکمیل کی۔ اور اس کی تکمیل پر آپ نے ایک دعوت عام کا اہتمام کیا، جس میں تمام عام و خاص مسلمان شریک ہوئے۔ اس دعوت پر آپ نے پانچ سو دینار خرچ کیے اور ایک بادشاہ نے آپ سے یہ کتاب طلب کر کے تین سو دینار میں خرید لی۔ اللہ تعالیٰ آپ کو سنت نبوی کی خدمت پر نہایت اچھا صلہ عطا فرمائے۔ «آمين» اہم مناصب: پہلے پہل آپ (حافظ ابن حجر رحمہ اللہ) مصری علاقوں کے قاضی بنے، پھر چند سال کے بعد مستقل طور پر شامی علاقے بھی آپ کی قضا میں شامل کر دیے گئے، جو اکیس سال سے زائد عرصے تک آپ کے زیر قضا رہے، شروع میں آپ قاضی بننے سے پرہیز کرتے رہے حتی کہ بادشاہِ وقت نے آپ کو ایک خاص مقدمے میں قاضی مقرر کیا، پھر آپ بلقینی کے اصرار پر ان کے نائب بنے، بلقینی کی جانشینی کی وجہ سے انہیں کئی اور لوگوں کا نائب بننا پڑا، یہاں تک کہ آپ قاضی القضاۃ (چیف جسٹس) مقرر ہوئے، آپ کی یہ تقرری بروز ہفتہ 12 محرم 827 ہجری میں ہوئی، پھر سات مرتبہ آپ کی قاضی القضاۃ کے عہدے پر تقرری ہوئی اور سات دفعہ ہی اس سے الگ ہوئے، پھر جمادیٰ الثانیہ 852 ہجری کو آخری مرتبہ اس عہدے سے دستبردار ہوئے اور اسی سال آپ اس دارِ فانی سے کوچ فرما گئے۔ منفرد شخصیت: اس کے علاوہ آپ تواضع، بردباری، صبر و تحمل، خوش طبعی، وسعت ظرافت، قیام و صیام، احتیاط و ورع، جود و سخا، حوصلہ و برداشت، دقیق و لطیف کلام اور عمدہ و نفیس نوادر کی طرف میلان میں مشہور و معروف تھے، جس طرح کہ آپ ائمہ متقدمین و متأخرین، اور اپنے پاس بیٹھنے والے ہر چھوٹے بڑے کا ادب و احترام کرنے میں منفرد اور بے مثال تھے۔ وفات: آپ ہفتے کی رات 8 ذی الحجہ 852 ہجری کو عشاء کی نماز کے بعد اپنے خالقِ حقیقی سے جا ملے۔ اللہ تعالیٰ انہیں انتہائی عمدہ ثواب اور بہترین بدلہ عطا فرمائے۔ آمین! تلخیص از: التبر المسبوک وغیرہ"
}