{
    "book_name": "Fatah Alrabani",
    "urdu_text": "امام احمد بن حنبل﷫( 164ھ -241) بغداد میں پیدا ہوئے۔ آپ ابتدائی تعلیم حاصل کرنے کے بعد 179ھ میں علم حدیث کے حصول میں مشغول ہوئے جبکہ اُن کی عمر محض 15 سال تھی۔ 183ھ میں کوفہ کا سفر اختیار کیا اور اپنے استاد ہثیم کی وفات تک وہاں مقیم رہے، اِس کے بعد دیگر شہروں اور ملکوں میں علم حدیث کے حصول کی خاطر سفر کرتے رہے۔ امام احمد جس درجہ کے محدث تھے اسی درجہ کے فقیہ اورمجتہد بھی تھے۔ حنبلی مسلک کی نسبت امام صاحب ہی کی جانب ہے۔ اس مسلک کا اصل دار و مدار نقل و روایت اور احادیث و آثار پر ہے۔ آپ امام شافعی﷫ کے شاگرد ہیں۔ اپنے زمانہ کے مشہور علمائے حدیث میں آپ کا شمار ہوتا تھا۔ مسئلہ خلق قرآن میں خلیفہ معتصم کی رائے سے اختلاف کی پاداش میں آپ نے کوڑے کھائے لیکن غلط بات کی طرف رجوع نہ کیا۔ آپ کوڑے کھا کھا کر بے ہوش ہو جاتے لیکن غلط بات کی تصدیق سے انکار کر دیتے۔ انہوں نے حق کی پاداش میں جس طرح صعوبتیں اٹھائیں اُس کی بنا پر اتنی ہردلعزیزی پائی کہ وہ لوگوں کے دلوں کے حکمران بن گئے۔ آپ کی عمر کا ایک طویل حصہ جیل کی تنگ و تاریک کوٹھریوں میں بسر ہوا۔ پاؤں میں بیڑیاں پڑی رہتیں، طرح طرح کی اذیتیں دی جاتیں تاکہ آپ کسی طرح خلق قرآن کے قائل ہو جائیں لیکن وہ عزم و ایمان کا ہمالہ ایک انچ اپنے مقام سے نہ سرکا۔ حق پہ جیا اور حق پہ وفات پائی۔ امام صاحب نے 77 سال کی عمر میں 12 ربیع الاول 214ھ کوانتقال فرمایا۔ اس پر سارا شہر امنڈ آیا۔ کسی کے جنازے میں خلقت کا ایسا ہجوم دیکھنے میں کبھی نہیں آیا تھا۔ جنازہ میں شرکت کرنے والوں کی تعداد محتاط اندازہ کے مطابق تیرا لاکھ مرد اور ساٹھ ہزار خواتین تھیں۔ (وفیات الاعیان : 1؍48) حافظ ابن کثیر﷫ فرماتے ہیں کہ امام صاحب کایہ قول اللہ تعالیٰ نےبرحق ثابت کردیا کہ: ’’ان اہل بدع ،مخالفین سے کہہ دوکہ ہمارے اور تمہارے درمیان فرق جنازے کے دن کا ہے (سیراعلام النبلاء:11؍ 343) امام صاحب نے کئی تصنیفات یادگار چھوڑیں۔ ان کی سب سے مشہوراور حدیث کی مہتم بالشان کتاب ’’مسنداحمد‘‘ ہے۔ اس سے پہلےاور اس کے بعد مسانید کے کئی مجموعے مرتب کیے گئے مگر ان میں سے کسی کو بھی مسند احمد جیسی شہرت، مقبولیت نہیں ملی۔ یہ سات سو صحابہ کی حدیثوں کا مجموعہ ہے۔ اس میں روایات کی تعداد چالیس ہزار ہے۔ امام احمد نے اس کو بڑی احتیاط سے مرتب کیا تھا۔ اس لیے اس کا شمار حدیث کی صحیح اور معتبر کتابوں میں ہوتا ہے۔ حضرت شاہ ولی اللہ دہلوی نے اس کو کتبِ حدیث کے دوسرے درجہ کی کتابوں یعنی سنن ابی داؤد، سنن نسائی اور جامع ترمذی کے ہم پایہ قرار دیا ہے۔ مسنداحمد کی اہمیت کی بنا پر ہر زمانہ کے علما نے اس کے ساتھ اعتنا کیا ہےاور یہ نصاب درس میں بھی شامل رہی ہے۔ بہت سے علماء نے مسند احمد کی احادیث کی شرح لکھی بعض نے اختصار کیا بعض نےاس کی غریب احادیث پر کام کیا۔ بعض نے اس کے خصائص پر لکھا اوربعض نے اطراف الحدیث کا کام کیا۔ اس کتاب کے بارے میں: مصر کے مشہور محدث احمد بن عبدالرحمن البنا الساعاتی نے الفتح الربانى بترتيب مسند الامام احمد بن حنبل الشيباني کے نام سے مسند احمد کی فقہی ترتیب لگائی اور بلوغ الامانى من اسرار الفتح الربانى کے نام سے مسند احمد پر علمی حواشی لکھے۔ اور شیخ شعیب الارناؤوط نے علماء محققین کی ایک جماعت کے ساتھ مل کر الموسوعة الحديثية کے نام سے مسند کی علمی تخریج او رحواشی مرتب کیے جوکہ بیروت سے 50 جلدوںمیں شائع ہوئے ہیں۔ مسند احمد کی اہمیت وافادیت کے پیش نظر اسے اردو قالب میں بھی ڈھالا جاچکا ہے۔ زیر تبصرہ کتاب’’مسند احمد امام احمد بن حنبل‘‘ مسند احمد کا 12 جلدوں پر مشتمل ترجمہ وفوائد ہیں۔ مترجمین میں پروفیسر سعید مجتبیٰ سعیدی﷾ (سابق شیخ الحدیث جامعہ لاہور الاسلامیہ، لاہور) شیخ الحدیث عباس انجم گوندلوی﷾، ابو القاسم محمد محفوظ اعوان ﷾ کےاسمائےگرامی شامل ہیں۔ تخریج وتحقیق اور شرح کا کام جناب ابو القاسم محمد محفوظ اعوان ﷾ کی کاوش ہے۔ موصوف نے آیات قرآنیہ اور احادیث نبویہ کی روشنی میں احادیث کی تشریح وتوضیح کی ہے اورمختلف فیہ مسائل میں زیادہ ترصرف راحج قول پیش کرنے پر اکتفا کیا ہے۔ شرح میں شیخ ناصر البانی ﷫ کے بعض فقہی مباحث بھی موجود ہیں ۔فوائد میں امام البانی ﷫ جیسے محققین پر اعتماد کرتے ہوئے احادیث صحیحہ کاذکر کیاگیا ہے۔ احادیث کی تخریج، صحت وضعف کاحکم لگاتے وقت ’’الموسوعۃ الحدیثیۃ‘‘ کو سامنے رکھاہے۔ اور بعض مقامامات پر حکم لگاتے وقت شیخ البانی کی رائے کو ترجیح دی ہے۔ کتاب کے آخر میں الف بائی ترتیب کے ساتھ احادیث کے اطراف قلمبند کردئیے گئےہیں۔ تاکہ قارئین آسانی کےساتھ اپنے مقصد تک رسائی حاصل کرسکیں۔ اور اسے شیخ احمد عبدالرحمن البنا کی فقہی ترتیب کے مطابق مرتب کر کے شائع کیا گیا ہے۔ اللہ تعالیٰ جزائے خیر عطا فرمائے مولانا حافظ عبد اللہ رفیق﷾ (شیخ الحدیث جامعہ محمد یہ لوکوورکشاپ، لاہور) کو جنہوں نے اس کتاب پرنظرثانی فرماکر اس میں موجود نقائص کو دور کرنے کی بھر پور سعی کی ہے۔ اور اللہ تعالیٰ اجر عظیم سے نوازے جناب شیخ الحدیث ومفتی پاکستان حافظ عبدالستار حماد﷾ کوکہ جنہوں نےاپنی نگرانی میں مسند احمد کا ترجمہ بزبان اردو کروانے کی ذمہ داری لی۔ جو کہ بعد میں یہ سعادت محمد رمضان محمدی صاحب کے حصہ میں آئی جن کی نگرانی میں یہ کام پایۂ تکمیل تک پہنچا۔"
}