{
    "book_name": "Ibn E Maja",
    "urdu_text": "سوانح حیات: امام ابن ماجہ رحمہ اللہ علم حدیث کے ا‏‏‏‏ن درخشندہ ستاروں میں سے ہیں جو افق عالم پر آج بھی روشن اور تاباں ہیں۔ آپ کا شمار فن حدیث کے جلیل القدر اور عظیم ترین ائمہ میں ہوتا ہے۔ آپ کو یہ شرف بھی حاصل ہے کہ آپ کا نام ان ائمہ ستہ کی فہرست میں آتا ہے جن کی کتب حدیث کو مسلمانوں کے ہاں قبول عام حاصل ہے۔ دوسرے ائمہ کی طرح امام ابن ماجہ رحمہ اللہ نے بھی خدمت حدیث میں بڑا نام کمایا اور تدوین حدیث میں اہم کردار ادا کیا۔ آپ نے پوری زندگی گلستان حدیث کی آبیاری کرتے ہوئے گزاری۔ فرامین نبوی کی جمع و تدوین کے لیے مختلف ممالک کی طرف رخت سفر باندھا اور اپنے دور کے عظیم شیوخ الحدیث و محدثین سے کسب فیض اور حدیث نبوی کے لؤلوئے آبدار سے نہ صرف اپنے ہی دامن کو بھرا بلکہ آنے والی نسلوں کے لیے بھی ان کو یکجا کر دیا۔ امام ابن ماجہ رحمہ اللہ حدیث، تفسیر اور تاریخ کے بہت بڑے عالم تھے، خصوصاً علم حدیث میں تو آپ حافظ اور ماہر فن گردانے جاتے تھے، اسی لیے حافظ شمس الدین ذہبی، حافظ ابن حجر رحہما اللہ اور دیگر ناقدین فن نے علم حدیث میں آپ کی امامت، رفعت شان، وسعت نظر، حفظ حدیث اور ثقاہت کا اعتراف کیا ہے اور آپ کی علمی و فنی خدمات کو سراہا ہے۔ نام و نسب: ابوعبداللہ محمد بن یزید بن عبداللہ الربعی القزوینی المعروف بابن ماجہ۔ آپ عجمی الاصل تھے۔ «ربعئ» ربیعہ کی طرف نسبت ہے اور یہ نسبت «وَلاء» ہے اور اپنے علاقے قزوین (ایران) کی طرف نسبت کی وجہ سے آپ قزوینی کہلاتے ہیں۔ آپ ابن ماجہ کے نام سے معروف ہیں۔ اس کے متعلق علامہ زبیدی رحمہ اللہ نے تاج العروس میں مختلف اقوال ذکر کیے ہیں۔ ایک قول یہ ہے کہ «ماجه» آپ کی والدہ کا نام ہے۔ امام نووی رحمہ اللہ نے بھی اسی کو ترجیج دی ہے اور شاہ عبدالعزیز دہلوی رحمہ اللہ بھی بستان المحدثین میں نقل کرتے ہیں: «وصحيح انست كه ماجه (بتخفيف جيم) مادر او بود» یعنی صحیح بات یہ ہے کہ ماجہ آپ کی والدہ تھیں۔ یہی وجہ ہے کہ ”ابن ماجہ“ میں «الف» کے ساتھ امتیاز کیا گیا ہے تاہم معلوم ہو کہ ابن ماجہ، محمد کی صفت ہے نہ کہ عبداللہ کی۔ بعض علماء کے نزدیک ماجہ آپ کے والد گرامی کا لقب تھا۔ حافظ ابن حجر رحمہ اللہ نے اسی کو اختیار کیا ہے۔ «وَاللهُ اَعْلَمُ» ولادت اور ابتدائی تعلیم: 209 ہجری بمطابق 824 عیسوی میں آپ کی ولادت باسعادت ہوئی، چنانچہ یاقوت بن عبداللہ الحموی نے جعفر بن ادریس کی تاریخ قزوین کے حوالے سے نقل کیا ہے: «مات ابوعبدالله سنة 273 ه وسمته يقول ولدت سنة 209 ه» امام ابن ماجہ رحمہ اللہ کا عہد طفولیت اگرچہ پردہ خفا میں ہے، تاہم معلوم ہوتا ہے کہ عام دستور کے مطابق ابتدائی تعلیم کی تکمیل کے بعد امام صاحب نے علم حدیث کی طرف رجوع کیا اور اس کی ابتدا اپنے ہی شہر سے کی جو اس وقت علم حدیث کا گہوارہ بن چکا تھا ۔ طلب حدیث کے لیے بلاد اسلامیہ کا سفر: اپنے شہر اور گرد و نواح کے شیوخ سے کسب فیض کے بعد 230 ہجری میں جب آپ کی عمر تقریباً 21، 22 سال تھی۔ آپ نے تلاش علم حدیث کے لیے دوسرے ممالک کی طرف رخت و سفر باندھا، چنانچہ ابن الجوزی ”لمنتظم“ میں لکھتے ہیں: ”پھر آپ نے خراسان، عراق، حجاز، مصر اور شام کے شہروں کے سفر کیے اور محدثین کی مجالس میں حاضر ہوتے رہے۔“ امام حنبلی رحمہ اللہ لکھتے ہیں: «ارتحل الي العراقين و مصر و شام» یعنی آپ نے عراقین (کوفہ و بصرہ)، مصر اور شام کی طرف سفر کیے۔ علاوہ ازیں آپ نے مکہ اور مدینہ کے شیوخ سے بھی استفادہ کیا اور پھر بغداد کی طرف سفر کیا جو اس وقت بقول امام ذہبی رحمہ اللہ کے «دار الاسناد العالي والحفظ و منزل الخلافة والعلم» تھا۔“ اسی پر بس نہیں بلکہ آپ نے اپنے علمی ذوق کی تسکین اور حدیث نبوی کی جمع و تدوین کے لیے دمشق، حمص، مصر، اصفہان، عسقلان اور نیشاپور تک کے اساطین علم و حدیث کے سامنے زانوئے تلمذ تہ کیے۔ اس سے بخوبی اندازہ ہوتا ہے کہ امام ابن ماجہ رحمہ اللہ نے حدیث نبوی کے حصول کے لیے کتنی تگ و دو اور سعی کی اور ان جواہر پاروں کو جمع کرنے کے لیے اپنے دور کے تقریباً تمام علمی مراکز تک رسائی حاصل کی اور اکابر محدیثن کی مجالس میں حاضر ہو کر استفادہ کیا اور اپنے قلب و ذہن کو حدیث نبوی سے منور کیا۔ اساتذہ کرام: امام ابن ماجہ رحمہ اللہ کو اپنے وقت کے عظیم محدثین سے شرف تلمذ حاصل رہا جن میں مکی، مدنی اور قزوینی محدثین بھی شامل ہیں، چنانچہ مدینے میں آپ کے اساتذہ میں: ➊ حافظ ابن مصعب الزبیری ➋ احمد بن ابوبکر العوفی ➌ حافظ ابراہیم بن المنذر اہل قزوین میں سے: ➐ عمرو بن رافع بجلی ➑ اسماعیل بن توبہ ➒ محمد بن ابوخالد القزوینی ان کے علاوہ: ➓ جبارہ بن المغلس ⓫ ابوبکر بن ابی شیبہ ⓬ نصر بن علی الجھضمی ⓭ محمد بن یحییٰ نیشاپوری ⓮ ابوبکر بن خلاد باہلی ⓯ محمد بن بشار ⓰ علی بن محمد الطنافسی ⓱ علی بن منذر آپ کے قابل ذکر اساتذہ ہیں۔ تلامذہ: امام ابن ماجہ رحمہ اللہ سے کسب فیض کرنے والے حضرات کی بھی ایک طویل فہرست ہے۔ آپ کے تلامذہ نہ صرف قزوین ہی میں تھے بلکہ ہمدان، اصفہان، بغداد اور دنیا کے دیگر علمی مراکز تک پھیلے ہوئے تھے۔ ان میں علی بن سعید بن عبداللہ الفلانی، ابراہیم بن دینار الجرشی، احمد بن ابراہیم القزوینی، حافظ ابو یعلیٰ الخلیلی اور ابوعمرو احمد بن محمد بن حکیم المدنی الاصفہانی قابل ذکر ہیں۔ سنن ابن ماجہ کے راوی: آپ کے وہ شاگردان خاص جنہیں سنن ابن ماجہ روایت کرنے کا شرف حاصل ہوا، ان میں سے چند قابل ذکر یہ ہیں: ابوالحسن القطان، سلیمان بن یزید، ابو جعفر محمد بن عیسٰی، ابوبکر حامد الابہری۔ اہل علم کی طرف سے اعتراف عظمت: امام ابن ماجہ رحمہ اللہ اپنے دور کے عظیم محدث، مفسر اور مؤرخ تھے۔ فن حدیث میں آپ کے علمی مقام و مرتبہ کا اعتراف ہر دور کے علماء و ماہرین فن نے کیا ہے۔ امام ذہبی: امام ذہبی رحمہ اللہ فرماتے ہیں: ”امام ابن ماجہ حافظ الحدیث، ناقد فن، راست باز اور وسیع علم رکھنے والے تھے۔“ تذکرۃ الحفاظ میں امام ذہبی رحمہ اللہ ان کی بابت لکھتے ہیں: ”آپ بہت بڑے حافظ اور اہل قزوین میں سے محدث و مفسر تھے۔“ ابویعلیٰ خلیلی: ابویعلیٰ خلیلی کہتے ہیں: ”آپ بہت ثقہ، قابل حجت اور علوم حدیث کی معرفت رکھنے والے تھے۔“ علامہ سندی: علامہ سندی کہتے ہیں: ”آپ ائمۃ المسلمین میں سے بلند مرتبہ، پرہیزگار اور بالاتفاق ثقہ امام تھے۔“ امام صاحب کی تصنیفی خدمات: امام ابن ماجہ رحمہ اللہ نے تحصیل علم کے بعد تالیف و تصنیف میں بھی دلچسپی لی اور الباقیات الصالحات کے طور تین بڑی کتابیں چھوڑیں جو درج ذیل ہیں: ➊ «السنن:» ‏‏‏‏ اس کا شمار صحاح ستہ (کتب ستہ) میں ہوتا ہے اور درجے کے لحاظ سے یہ چھٹی کتاب ہے۔ ➋ «التفسير:» ‏‏‏‏ یہ ایک بہت بڑی تفسیر تھی جس میں آپ نے احادیث، آثار صحابہ و تابعین کو بالاسناد جمع کیا تھا۔ امام سیوطی رحمہ اللہ نے تفسیر طبری کے بعد تفسیر ابن ابی حاتم اور تفسیر ابن جاجہ کو بڑی تفاسیر میں شمار کیا ہے۔ البدایہ میں امام ابن کثیر رحمہ اللہ نے بھی اسے بہت بڑی تفسیر قرار دیا ہے۔ ➌ «التاريخ:» ‏‏‏‏ یہ بھی مؤلف کی جلالت علمی کی مظہر ہے اور ان کے علم و فضل کے مطابق ایک اہم تاریخ ہے۔ امام ابن کثیر رحمہ اللہ نے اسے تاریخ کامل کہا اور مشہور مؤرخ ابن خلکان نے اسے تاریخ ملیح کہا ہے لیکن افسوس کہ مؤخرالذ کر دونوں کتابیں اب ناپید ہیں۔ وفات: 22 رمضان المبارک 273 ہجری بمطابق 887 عیسوی کو 64 سال کی عمر میں پیر کے دن آپ نے داعی اجل کو لبیک کہا اور دارفانی سے رحلت فرما کر داربقا میں تشریف فرما ہوئے۔ «اللهم اغفرله وارحمه وعافه واعف عنه» آپ کی تجہیز و تکفین میں آپ کے برادران ابوبکر اور عبداللہ اور صاجزادہ عبداللہ پیش پیش تھے۔ آپ کی نماز جنازہ آپ کے بھائی عبداللہ نے پڑھائی۔ متعدد شعراء نے آپ کی وفات حسرت آیات پر درد ناک مرثیے بھی لکھے۔ محمد بن اسود قزوینی کا ایک شعر حافظ ابن حجر رحمہ اللہ نے تہذیب التہذیب میں ذکر کیا ہے «لقد أوهي دعائم عرس علم *** وضعضع ركنه فقد ابن ماجه» ”ابن ماجہ کی موت نے ایوان علم کی بنیادوں کو کمزور کر دیا اور اس کے ستون کو ہلا کر رکھ دیا۔“"
}