{
    "book_name": "Imam Malik",
    "urdu_text": "سوانح حیات امام مالک بن انس المدنی رحمہ اللہ سوانح حیات​:​ نام ونسب: ابوعبداللہ مالک بن انس بن ابی عامر بن عمرو الاصبحی المدنی رحمہ اللہ پیدائش: 93ھ یا 94ھ بمقام مدینہ طیبہ اساتذہ: ➊ محمد بن مسلم بن عبیداللہ بن عبداللہ بن شہاب الزہری ➋ نافع مولىٰ ابن عمر ➌ ایوب السختیانی ➍ جعفر بن محمد الصادق ➎ حمید الطّویل ➏ زید بن اسلم ➐ ابوحازم سلمہ بن دینار ➑ ہشام بن عروہ ➒ عبداللہ بن دینار وغیرہم۔ توثیق: ◈ امام یحییٰ بن معین رحمہ اللہ نے فرمایا: «ثقة» [تقدمة الجرح و التعديل، ص: 16، وسنده صحيح] ◈ امام احمد بن حنبل رحمہ اللہ نے فرمایا: «مالك أثبت فى كل شئ» ”مالک ہر چیز میں ثقہ ہیں۔“ [كتاب العلل و معرفة الرجال 349/2 رقم: 2543] ◈ اور فرمایا: ”مالک (روایت حدیث میں) حجت ہیں۔“ [سوالات المروذي: 45] ◈ ابوحاتم الرازی نے کہا: «ثقة إمام أهل الحجاز و هو أثبت أصحاب الزهري...» ”اہلِ حجاز کے امام ہیں اور زہری کے شاگردوں میں سب سے زیادہ ثقہ ہیں۔“ [الجرح و التعديل 17/1] ◈ علی بن عبداللہ المدینی نے فرمایا: ”مالک صحیح الحدیث ہیں۔“ [تقدمة الجرح و التعديل، ص: 14، وسنده صحيح] ◈ حافظ ابن حبان نے انہیں کتاب الثقات میں ذکر کیا اور فرمایا: ”آپ 93 یا 94ھ میں پیدا ہوئے۔“ [ابن حبان 459/7] ◈ عبدالرحمٰن بن مہدی رحمہ اللہ مشہور ثقہ ثبت حافظ سے پوچھا گیا مجھے پتا چلا ہے کہ آپ نے مالک بن انس کو ابوحنیفہ سے بڑا عالم کہا ہے؟ انھوں نے فرمایا: ”میں نے یہ بات نہیں کہی بلکہ میں تو یہ کہتا ہوں کہ وہ ابوحنیفہ کے استاذ یعنی حماد (بن ابی سلیمان) سے بھی بڑے عالم ہیں۔“ [الجرح و التعديل 11/1، وسنده صحيح] ◈ یحییٰ بن سعید القطان نے فرمایا: ”مالک حدیث میں امام تھے۔“ [تقدمة الجرح و التعديل، ص: 14، وسنده صحيح] ◈ امام ابوعبداللہ محمد بن ادریس الشافعی رحمہ اللہ نے فرمایا: ”جب مالک سے حدیث آجائے تو اسے مضبوط ہاتھوں سے پکڑ لو۔“ [تقدمة، ص: 14، وسنده صحيح] ◈ امام شعبہ رحمہ اللہ نے فرمایا: ”میں مدینہ میں داخل ہوا اور نافع زندہ تھے اور مالک کا حلقہ قائم تھا۔“ [الجرح و التعديل 26/1، وسنده صحيح] امام نافع رحمہ اللہ 117ھ میں فوت ہوئے اور اس وقت امام مالک کی عمر 23 یا 24 سال تھی، یعنی جوانی میں ہی آپ کی امامت و مسندِ تدریس قائم ہو گئی تھی۔ امام مالک کی توثیق و تعریف پر اجماع ہے۔ آپ کی بیان کردہ احادیث صحیح بخاری، صحیح مسلم، صحیح ابن خزیمہ، صحیح ابن حبان، صحیح ابن الجارود، صحیح ابی عوانہ، سننِ اربعہ، کتاب الام للشافعی، مسند احمد اور مسلمانوں کی دیگر بڑی کتبِ احادیث میں موجود ہیں۔ الموطأ: ◈ امام شافعی رحمہ اللہ نے (صحیح بخاری و صحیح مسلم کی تصنیف سے پہلے) فرمایا: ”رُوئے زمین پر علمی کتابوں میں موطأ مالک سے زیادہ سے کوئی کتاب نہیں ہے۔“ [الجرح و التعديل 12/1، وسنده صحيح] موطأ امام مالک کا ذکر صحیح ابن خزیمہ (140) اور صحیح ابن حبان (الاحسان: 5638، دوسرا نسخہ 5667) وغیرہما میں کثرت سے موجود ہے۔ ◈ امام احمد بن حنبل رحمہ اللہ سے امام مالک کی کتاب کے بارے میں پوچھا گیا تو انھوں نے فرمایا: «ما أحسن لمن تدين به» ”جو شخص دین پر چلنا چاہتا ہے، اس کے لئے کتنی اچھی کتاب ہے۔“ [كشف المغطا فى فضل الموطا لابن عساكر، ص: 41، وسنده حسن]، نیز دیکھئے [الاستذكار 12/1، 13] تلامذه: ◈ سعید بن منصور، سفیان ثوری، ◈ سفیان بن عیینہ، ◈ شعبہ، عبداللہ بن ادریس، ◈ عبداللہ بن المبارک، ◈ قعنبی، عبداللہ بن وہب، ◈ اوزاعی، ◈ عبدالرحمٰن بن مہدی، ◈ یحییٰ بن سعید القطان، ◈ ابن جریج، ◈ قتیبہ بن سعید، ◈ شافعی، ◈ وکیع، ◈ عبدالرحمٰن بن القاسم ◈ امام فزاری وغیرہم۔ وفات: 179ھ بمقام مدینہ طیبہ۔"
}