{
    "book_name": "Muajam Tabarani Saghir",
    "urdu_text": "سوانح حیات امام طبرانی رحمہ اللہ سوانح حیات​:​ نام و نسب اور نسبت: آپ کا نام سلیمان، کنیت ابوالقاسم اور سلسلۂ نسب یہ ہے: سلیمان بن احمد بن ایوب بن مطیر۔ ولادت: آپ ماه صفر 260ھ میں پیدا ہوئے۔ [تذكرة الحفاظ: 126/2] خاندان: آپ کا قبیلہ الخم سے نسبتی تعلق تھا، اس لیے لخمی کہلاتے تھے، لخم دراصل یمن کا ایک قبیلہ ہے، اس کی ایک شاخ شام میں آباد ہو گئی تھی۔ امام صاحب کے والد بزرگوار کو علم و فن سے بڑی دلچسپی تھی، اس لیے وہ اپنے فرزند کو بھی علم کی تحصیل و تکمیل کی تلقین کرتے رہتے تھے۔ وطن: ان کا اصلی وطن طبریہ ہے مگر آخر عمر میں انہوں نے اصبہان میں مستقل سکونت اختیار کر لی تھی، طبریہ اردن کے قریب واقع ہے۔ 13ھ میں شرحبیل بن حسنہ نے اس کو اسلامی سلطنت کے زیر نگیں کیا تھا، اس کی نسبت سے وہ طبرانی کہلاتے ہیں۔ علامہ ذہبی رقمطراز ہیں کہ وہ عکا میں پیدا ہوئے، یہاں سے طبریہ کی مسافت دو روز میں طے ہوتی تھی۔ [تذكرة الحفاظ: 126/3 وغيره] مشائخ کرام: امام طبرانی نے ایک ہزار سے زائد محدثین سے علم حاصل کیا، آپ کے بعض مشہور مشائخ کے نام یہ ہیں: ابراہیم بن ابی سفیان قیسرانی، ابراہیم بن محمد عرق حمصی، ابراہیم بن موید شیبانی، ابوزرعہ دمشقی، ابوعبدالرحمٰن نسائی، ابومسلم کجی، احمد بن انس، احمد بن عبدالرحیم حوطی، احمد بن عبدالقاہر، احمد بن معلیٰ، احمد بن یحییٰ، ادریس بن جعفر عطاء، اسحاق بن ابراہیم دیری، ابوعلی اسماعیل بن محمد بن قیراط، بشر بن موسیٰ، حسن بن سہل، حسن بن عبدالاعلیٰ بوسی، حفص بن عمر، عبداللہ بن محمد بن سعید بن ابی مریم، علی بن عبدالعزیز بغوی، ابوخلیفہ فضل بن حباب حمجی، ابوسعید بن ہاشم بن مرثد طبرانی , یحییٰ بن ایوب علاف وغیرہ۔ [كتاب الانساب، ورق 495 و 366 - ابن خلكان: 383/1 - كتاب المنتظم: 54/7 - معجم البلدان: 23/6 تا 25] تلامذه: ان کے تلامذہ و منتسبین کی تعداد بھی بے شمار ہے اور ان سے استفادہ کرنے والوں میں ان کے بعض شیوخ بھی شامل ہیں۔ بعض تلامذہ کے نام یہ ہیں: ابن عقدہ، ابوبکر بن زبدہ، ابوبکر بن مردویہ، ابواحمد بن عبداللہ بن عدی جرجانی، ابوالحسن بن قادیہ، ابوعمر محمد بن حسین بسطامی، حافظ ابونعیم احمد بن عبداللہ، احمد بن محمد صحاف، حسین بن احمد بن مرزبان، عبدالرحمٰن بن احمد صفاء، ابوبکر عبدالرحمٰن بن علی ذکوانی، ابوالفضل محمد بن احمد جارودی، ابوعمر محمد بن حسین بسطامی، محمد بن عبیداللہ بن شہریار۔ امام طبرانی کے حلقہ فیض سے دو صاحب کمال وزراء بھی وابستہ تھے، ان میں ابن عمید لغت و عربیت اور شعر و ادب میں سرآمد روزگار تھا، اس کے متعلق کہا جاتا ہے کہ دیلمی حکومت میں اس لیاقت و قابلیت کا کوئی اور وزیر نہیں گزرا، اور دوسرا وزیر صاحب بن عباد بھی ممتاز ادیب و انشا پرداز اور امام طبرانی کا شاگرد اور تربیت یافتہ تھا۔ [تذكرة الحفاظ: 127/3 - بستان المحدثين، ص: 55 - كتاب الانساب، ورق: 366] رحلات علمیہ: امام طبرانی 273ھ میں علم و فن کی تحصیل میں مشغول ہوئے تھے، اس وقت ان کی عمر تیرہ برس تھی، پہلے انھوں نے اپنے وطن طبریہ کے اصحاب علم و فضل سے استفادہ کیا، 274ھ میں قدس، اور 275ھ میں قیساریہ تشریف لے گئے، اس کے بعد انہوں نے دوسرے اسلامی ملکوں، اہم مقامات اور مشہور مراکز حدیث کا رخ کیا اور حمص، جبلہ، مدائن، شام، مکہ معظّمہ، مدینہ منورہ، یمن، مصر، بغداد، کوفہ، بصرہ، جزیره، فارس اور اصبہان وغیرہ کی طرف تحصیل علم کے لیے سفر کیا۔ اصبہان کی مرکزیت کی وجہ سے یہیں بود و باش بھی اختیار کر لی تھی، علم کی تلاش و جستجو اور احادیث کی تحصیل میں ان کو سخت مشکلات اور پریشانیوں کا سامنا کرنا پڑا، لیکن ان کے ذوق و شوق اور سرگرمی و انہماک میں کبھی کمی نہیں آئی۔ شاہ عبدالعزیز رحمہ اللہ لکھتے ہیں: ”30 سال تک ان کو بستر پر سونا نصیب نہ ہوا، مگر وہ آرام و آسائش کا خیال کیے بغیر حدیث کی تحصیل میں مشغول اور بوریا پر سوتے رہے۔“ [تذكرة الحفاظ: 127/3 - بستان المحدثين، ص: 55 - كتاب الانساب، ورق: 366 - العبر: 316/2] . . . سہنے پڑتے ہیں اس راہ میں رنج و الم بہت . . . اور بقول دیگر: «مَنْ بَلَغَ الْعُلىٰ سَحِرَ اللَّيَالِيَ» ”جو بلندیوں پر پہنچا، اس نے راتیں جاگ کے گزاریں۔“ حفظ و ثقاہت: حفظ و ضبط اور ثقاہت و اتقان میں ان کا مرتبہ بلند تھا، ان کے معاصرین فضلا اور کبار محدثین نے ان کے حافظہ اور ثقاہت کا اعتراف کیا ہے، علمائے سیر و تراجم نے ان کو «الحافظ الكبير، أَحَدُ الحفاظ، الحافظ العلم، واسع الحفظ، الحجة» اور «من الثقات الاثبات المعدلين» وغیرہ لکھا ہے۔ ابراہیم بن محمد بن حمزہ کا بیان ہے کہ ”میں نے ان سے بڑا کوئی حافظ نہیں دیکھا۔“ ابن خلکان لکھتے ہیں کہ ”وہ اپنے عہد کے ممتاز حافظ تھے۔“ علامہ ابن الجوزی رقمطراز ہیں کہ ”امام سلیمان کا حافظہ نہایت قوی تھا۔ صاحب بن عباد ان کے حافظے کی قوت اور یادداشت کی زیادتی کے معترف تھے۔“ ان کے صدق و ثقاہت کے بارے میں بھی علمائے فن کا اتفاق ہے، حافظ ذہبی فرماتے ہیں کہ ”وہ ضبط و ثقاہت اور صدق و امانت کے ساتھ بڑے عظیم رتبہ اور شان کے محدث تھے۔“ احمد بن منصور اور امین ناصرالدین کہتے ہیں کہ ”وہ ثقہ تھے۔“ علامہ ابن حجر نے ان کو ”ثابت و ضابط“ لکھا ہے۔ یافعی اور ابن عماد تحریر فرماتے ہیں کہ ”طبرانی ثقہ و صدوق اور حدیثوں کے علل، رجال و ابواب کے اچھے واقف کار تھے۔“ [تذكرة الحفاظ: 126/3 و 130 - لسان الميزان: 73/3 - مرآة الجنان: 372/2 و شذرات الذهب: 30/2] حدیث میں درجہ: امام طبرانی علم و فضل کے جامع اور فن حدیث میں نہایت ممتاز تھے، علامہ ذہبی نے انھیں ”الامام العلامہ اور مسند الدنیا“ اور یافعی و ابن عماد نے ”مسند العصر“ لکھا ہے، ابن ناصرالدین کہتے ہیں کہ وہ ”مسند الآفاق“ تھے۔ ایک دفعہ ابن عقدہ سے ایک اصبہانی شخص نے کوئی مسئلہ دریافت کیا، انہوں نے پوچھا کہ تم نے سلیمان بن احمد لخمی سے سماع کیا ہے؟ اس نے جواب دیا کہ میں ان سے واقف نہیں، ابن عقدہ نے حیرت سے سبحان اللہ کہا اور فرمایا کہ ان کے ہوتے ہوئے تم لوگ ان سے حدیثیں نہیں سنتے اور ہم لوگوں کو خواہ مخواه دق کرتے ہو، میں نے طبرانی کا کوئی مثیل اور نظیر نہیں دیکھا۔ ابوبکر بن علی کا بیان ہے کہ وہ بڑے وسیع العلم تھے۔ حدیث میں ان کی وسعت نظر اور کمال کا اس سے اندازہ ہوتا ہے کہ احمد بن منصور شیرازی نے ان سے تین لاکھ حدیثیں لکھی تھیں۔ حافظ ذہبی کا بیان ہے کہ حدیث کی کثرت اور علوِ اسناد میں ان کی ذات نہایت ممتاز تھی اور حدیث میں ان کی بالغ نظری کا پوری دنیائے اسلام میں چرچا تھا، شاہ عبدالعزیز لکھتے ہیں کہ حدیث میں وسعت اور کثرت روایت میں وہ یکتا اور منفرد تھے۔ [ايضًا و بستان المحدثين، ص: 54] فقہی مذہب: اغلب بات یہ ہے کہ امام طبرانی کا فقہی مسلک وہی رہا جو محدثین اور ائمہ سنت کا ہے، بعض لوگوں نے انھیں شافعی بتایا ہے مگر یہ بات نادرست ہے۔ [فوائد جامعه بر عجاله نافعه، ص: 180] ابوبکر چغابی سے ایک دلچسپ مناظرہ: امام طبرانی کے علم و فضل اور حدیث میں عظمت و کمال کا اندازہ اس مناظرہ سے بھی ہوتا ہے جو ان کے اور ابوبکر چغابی کے درمیان ہوا تھا، صاحب بن عباد بیان کرتے ہیں: مجھے دنیا میں وزارت سے زیادہ کوئی چیز مرغوب اور عزیز نہ تھی اور میں اس سے زیادہ کسی منصب کو اعلیٰ اور برتر نہیں خیال کرتا تھا، کیونکہ اسی کی بدولت مجھے ہر طرح کا اعزاز اور ہر طبقے میں مقبولیت حاصل تھی، لیکن ایک روز میرے سامنے مشہور محدث ابوبکر چغابی اور ابوالقاسم طبرانی میں حدیث کے بارے میں ایک مباحثہ ہوا، حفظ و ضبط میں طبرانی اور ذہانت و فطانت میں چغابی فائق معلوم ہوتے تھے، یہ مباحثہ دیر تک ہوتا رہا، دونوں طرف سے بڑے جوش و خروش کا اظہار اور پر زور آوازیں بلند ہو رہی تھیں، اسی اثنا میں چغابی نے کہا: میرے پاس ایک حدیث ایسی ہے جو اور کسی کو معلوم نہیں، طبرانی نے اسے بیان کرنے کے لیے کہا تو انھوں نے فرمایا: «حدثنا ابوخليفة قال حدثنا سليمان بن ايوب ابوالقاسم ............» ”ہم سے ابوخلیفہ نے حدیث بیان کی، انہوں نے کہا: ہم سے سلیمان بن ایوب ابوالقاسم نے روایت کی ......۔“ طبرانی نے کہا: جناب! سلیمان بن ایوب تو میں ہی ہوں اور ابوخلیفہ میرے شاگرد ہیں، اگر آپ اس حدیث کو میرے واسطہ سے بیان کریں تو آپ کی سند زیاده عالی ہو گی، اس سے بے چارے ابوبکر بہت نادم ہوئے، ان کی ندامت اور طبرانی کی فتح و مسرت دیکھ کر مجھے خیال ہوا کہ کاش میں طبرانی ہوتا تو آج وہی سرور و انبساط اور غلبہ و کامرانی جو انھیں حاصل ہوئی ہے، مجھے حاصل ہوتی، یہ منظر دیکھ کر میرے دل سے وزارت کی اہمیت جاتی رہی کیونکہ علم و فضل کی بدولت اس سے کہیں بڑھ کر اعزاز و اکرام اور جاہ و مرتبہ حاصل ہوتا ہے۔ [تذكرة الحفاظ: 129/3] بعض مؤرخین نے صاحب بن عباد کے بجائے ابن عمید کی نسبت سے یہ واقعہ تحریر کیا ہے۔ حضرت شاہ عبدالعزیز رحمہ اللہ نے اس پر بڑا دلچسپ اور بہترین تبصرہ فرمایا ہے وہ لکھتے ہیں: ایں تمنا و آرزوے ہم از بقائے ...... وزارت و ریاست او بود والا علمائے ربانیین را بسبب ایں غلبہ ہائے ...... تغیرے نمی شود و نفس ایشاں بحرکت نمی آید ولکن المرء یقيس على نفس ...... [بستان المحدثين، ص: 55] ”صاحب بن عباد کا اس قسم کی آرزو و تمنا کرنا درحقیقت وزارت و ریاست ہی کے اثر کا نتیجہ تھا، ورنہ علمائے ربانی کے اندر اس طرح کی فتح و کامرانی کے بعد بھی کوئی عجیب تبدیلی نہیں آتی، اور نہ ان کی طبیعتیں اس قسم کے واقعات سے متاثر ہوتی ہیں، مگر آدمی دوسروں کو بھی اپنے ہی اوپر قیاس کرتا ہے۔“ دینی غیرت و حمیت: امام طبرانی میں بڑی دینی غیرت و حمیت تھی، ابن جوزی کا بیان ہے کہ وہ دین کے معاملہ میں نہایت سخت تھے۔ [المنتظم: 54/7] ان کو صحابہ کرام سے غیر معمولی محبت و عقیدت تھی، اس لیے ان کی مذمت اور تنقیص گوارا نہیں کرتے تھے، بعض مصنّفین کا بیان ہے کہ وہ پہلی دفعہ اصبہان تشریف لے گئے تو ابوعلی زنیم نے جو زکوٰة و خراج کا عامل تھا، ان کی بڑی آؤ بھگت کی، امام صاحب اس کے یہاں برابر تشریف لے جاتے تھے، اس کی وفات کے بعد اس کے لڑکے نے امام صاحب کے لیے پانچ سو درہم ماہوار وظیفہ مقرر کر دیا تھا لیکن جب اس نے سیدنا ابوبکر و سیدنا عمر رضی اللہ عنہما کے بارے میں مخالفانہ اور معاندانہ رویہ اختیار کیا تو امام طبرانی اس سے سخت آزردہ ہو گئے یہاں تک کہ اس کے یہاں آمد و رفت بھی بند کر دی۔ [تذكرة الحفاظ: 128/3 و 129] اس زمانہ میں قرامطہ اور فرقہ اسماعیلیہ کا بڑا زور و اثر تھا، یہ لوگ محدثین سے بڑی کدورت اور سخت عناد رکھتے تھے، ان لوگوں نے امام صاحب کی دینی معاملات میں شدت پسندی کی وجہ سے ان پر جادو کروا دیا تھا، جس کی وجہ سے ان کی بصارت ختم ہو گئی تھی۔ [بستان المحدثين، ص: 54] وفات: امام طبرانی نے بروز شنبہ 28 ذوالقعده 360ھ کو سو سال کی عمر میں انتقال فرمایا اور ایک صحابی رسول حضرت حمدوسی رضی اللہ عنہ کی قبر کے پہلو میں دفن کیے گئے۔ حافظ ابونعیم اصبہانی نے نماز جنازہ پڑھائی۔ [تذكرة الحفاظ: 130/3 - ابن خلكان: 383/1 - المنتظم: 54/7] تصانیف: امام طبرانی کثیر التصانیف تھے لیکن قدیم مصنّفین کی طرح ان کی بھی اکثر کتابیں محفوظ نہیں، ذیل میں ان کی تصنيفات کے نام اور بعض کے متعلق مختصر معلومات درج ہیں: (1) کتاب الاوائل۔ (2) کتاب التفسیر۔ (3) کتاب المناسک۔ (4) کتاب عشرة النساء۔ (5) کتاب السنۃ۔ (6) کتاب الطّوالات۔ (7) کتاب النوادر۔ (8) کتاب دلائل النبوة۔ (9) کتاب مسند شعبہ۔ (10) کتاب مسند سفیان۔ (11) کتاب حدیث الشامیین۔ (12) کتاب الرمی۔ (13) مسند العشرة۔ (14) معرفۃ الصحابہ۔ (15) فوائد معرفۃ الصحابہ۔ (16) مسند ابی ہریرہ رضی اللہ عنہ۔ (17) مسند عائشہ رضی اللہ عنہا۔ (18) حدیث الاعمش۔ (19) حديث الاوزاعی۔ (20) حدیث شیبان۔ (21) حديث ایوب۔ (22) مسند ابی ذر رضی اللہ عنہ۔ (23) کتاب الرؤیۃ۔ (24) کتاب الجود۔ (25) المعلم الالویہ۔ (26) فضل رمضان۔ (27) کتاب الفرائض۔ (28) کتاب الرد على المعتزلہ۔ (29) کتاب الرد على الجہمیۃ۔ (30) مکارم اخلاق العزاء۔ (31) الصلوٰة على الرسول صلی اللہ علیہ وسلم۔ (32) کتاب المامون۔ (33) کتاب الغسل۔ (34) کتاب فضل العلم۔ (35) کتاب ذم الرای۔ (36) کتاب تفسیر الحسن۔ (37) کتاب الزہری عن انس۔ (38) کتاب ابن المنکدر عن جابر۔ (39) مسند ابی اسحاق السبیعی۔ (40) حدیث یحییٰ بن ابی کثیر۔ (41) حدیث مالک بن دینار۔ (42) کتاب ماروی الحسن عن انس۔ (43) حدیث ربیعہ۔ (44) حدیث حمزة الزيات۔ (45) حدیث مسعر۔ (46) حدیث ابی سعد البقال۔ (47) طرق حديث من کذب علی۔ (48) کتاب النوح۔ (49) مسند ابی جحادہ۔ (50) کتاب من اسمہ عطاء۔ (51) کتاب من اسمہ شعبہ۔ (52) کتاب اخبار عمر بن عبدالعزیز رحمہ اللہ۔ (53) کتاب اخبار عبدالعزیز بن رفیع۔ (54) مسند روح ابن القاسم۔ (55) کتاب فضل عکرمہ۔ (56) کتاب امہات النبی۔ (57) مسند عمارة بن غزیہ۔ (58) مسند طلحہ بن مسرف و جماعۃ۔ (59) مسند العبادلہ۔ (60) احادیث ابی عمرو بن العلاء۔ (61) کتاب غرائب مالک۔ (62) جزوابان بن تغلب۔ (63) جزء حریث ابن ابی مطر۔ (64) وصيۃ ابی ہریرہ رضی اللہ عنہ۔ (65) مسند الحارث العکلی۔ (66) فضائل الاربعۃ الراشدین۔ (67) مسند ابن عجلان۔ (68) کتاب الاشربۃ۔ (69) كتاب الطہارة۔ (70) کتاب الامارة۔ (71) مسند ابی ایوب الافریقی۔ (72) مسند زیاد الجصاص۔ (73) مند زافر۔ (74) حدیث شعبہ۔ (75) کتاب من اسمہ عباده [عجاله نافعه: 80 و 81] (76) کتاب الدعا۔ معاجم ثلاثہ: امام طبرانی نے معجم میں تین کتابیں لکھیں، یہ ان کی مشہور و معروف تصانیف ہیں جو علمِ حدیث کی بلند پایہ کتابیں سمجھی جاتی ہیں، شاہ ولی اللہ دہلوی نے ان کو حدیث کے تیسرے طبقہ کی کتابوں میں شامل کیا ہے، ان کی بدولت امام طبرانی کو لازوال شہرت ملی۔ معجم کی تعریف: محدثین کی اصطلاح میں ان کتابوں کو معجم کہا جاتا ہے جن میں شیوخ کی ترتیب پر حدیثیں درج کی گئی ہوں، اس طرح کی بعض کتابوں میں شیوخ کی وفات اور بعض میں ان کے علم و تقویٰ کے تقدم کا لحاظ کیا گیا ہے، لیکن عموماً حروف تہجی کی ترتیب کو ملحوظ رکھا گیا ہے، شیوخ کے بجائے صحابہ یا بلا دوامصار کی ترتیب پر بھی معاجم مرتب کیے گئے ہیں۔ (77) معجم کبیر۔ (78) معجم اوسط۔ (79) معجم صغیر۔ کچھ کتاب کے بارے میں:: یہ سب معاجم میں مختصر ہونے کی وجہ سے زیادہ مقبول اور متداول ہے، اس کی ترتیب شیوخ کے ناموں پر ہے، اس میں انھوں نے حروفِ تہجی کے مطابق ایک ہزار سے زیادہ شیوخ کی ایک ایک حدیث درج کی ہے، آخر میں بعض خواتین محدثات کی بھی حدیثیں ہیں، ان کی حدیثوں کی تعداد دو ہزار بتائی گئی ہے، لیکن بعض نے ڈیڑھ ہزار بھی کہا ہے، اس کے زوائد بھی ابوالحسن ہیثمی نے علیحدہ مرتب کیے تھے، معجم صغیر کے نسخے کئی کتب خانوں میں موجود ہیں، 1311ھ میں یہ مطبع انصاری دہلی سے شائع ہوئی ہے، اس کی بعض خصوصیات ملاحظہ ہوں: ➊ اس میں روایت اور راوی کے متعلق مختلف قسم کی تصریحات کی گئی ہیں، مثلاً حدیث کے ضعف و قوت، رفع و اتصال تفرد، شہرت اور غرابت، راویوں کے ضبط و ثقاہت یا وہم و ضعف، کنیت، نسبت، نام، لقب، قبیلہ، وطن اور بعض کے نسب نامے اور روایتوں میں فرق و اختلاف اور کمی بیشی کی تصریح کی گئی ہے، جس سنہ اور مقام پر جو روایت سنی یا لکھی گئی ہے کہیں کہیں اس کی اور بعض راویوں کی صحابیت و تابعیت کا ذکر کیا گیا ہے، بعض روایتوں کے کسی خاص لفظ یا فقرہ کے متعلق یہ وضاحت کر دی گئی ہے کہ وہ صرف اسی حدیث میں مذکور ہے، بعض شیوخ کے بارے میں یہ لکھا ہے کہ انھوں نے اپنے فلاں شیخ سے کتنی حدیثیں بیان کیں یا اس نے اور کن مشہور شیوخ سے سنیں، یا اس سے کن مشہور اشخاص اور اہم راویوں نے حدیثیں روایت کی ہیں، اسی طرح اکثر راویوں کے وہ نمایاں اوصاف بیان کیے گئے ہیں جن سے ان کی زیادہ شہرت ہے۔ ➋ حدیث کے بارے میں اہلِ علم کے بیان کردہ مفہوم و منشاء کو ذکر کرنے کے علاوہ خود بھی کہیں کہیں اس کی مراد واضح کی ہے، اور راوی نے حدیث کے بعض الفاظ کی جو وضاحت کی ہے اس کو، اور کہیں کہیں خود بھی مشکل اور غریب الفاظ کے معنی لکھے ہیں۔ ➌ امام طبرانی نے ائمہ فقہ اور محدثین کے فقہی اقوال اور آراء بھی نقل کی ہیں اور خود بعض روایتوں کی اس طرح تشریح کی ہے جن سے کسی خاص فقہی مسلک کی تائید اور وضاحت ہوتی ہے، مثلاً ایک حدیث ہے: «عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيِّ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَا بَنِيْ عَبْدِ مَنَافٍ يَا بَنِيْ عَبْدِ الْمُطَّلَبِ اِنْ وَلِّيْتُمْ هٰذَا الْأَمْرَ فَلَا تَمْنَعُوْا أَحَدًا طَافَ بِهٰذَا الْبَيْتِ أَنْ يُصَلِّى أَيَّةَ سَاعَةٍ شَاءَ مِنْ لَيْلٍ وَنَهَارٍ.» ”سیدنا ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: اے بنی عبد مناف، اے بنی عبدالمطلب! اگر تم اس معاملہ کے ذمہ دار بنو تو خانہ کعبہ کا طواف کرنے والے کسی شخص کو رات اور دن کے کسی حصہ میں نماز پڑھنے سے منع نہ کرنا۔“ امام طبرانی اس کی شرح کرتے لکھتے ہیں: «”يعني الركعتين بعد الطواف السبع أن يصلي بعد صلاة الصبح قبل طلوع الشمس وبعد صلاة العصر قبل غروب الشمس وفي كل النهار.“» [معجم صغير، ص: 12] ”آپ صلی اللہ علیہ وسلم کی مراد سات چکر طواف کے بعد کی دو رکعتوں سے ہے کہ وہ فجر کی نماز کے بعد طلوع آفتاب سے پہلے اور عصر کی نماز کے بعد غروب سے پہلے اور اسی طرح دن کے ہر حصہ میں پڑھی جا سکتی ہیں، یعنی ممنوع و منہی عنہا اوقات میں بھی ان کو پڑھ لینے میں حرج نہیں ہے۔“ ➍ انھوں نے بعض حدیثوں کے متعلق شبہات کے جواب دیے ہیں، مثلاً ایک حدیث ہے: عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے چار کام کیے اس کو چار چیزیں عطا کی جاتی ہیں“، اس کا ذکر کتاب اللہ میں بھی ہے۔ ① جس نے اللہ کو یاد کیا اللہ بھی اسے یاد کرتا ہے۔ اللہ تعالیٰ کا فرمان ہے: «﴿فَاذْكُرُونِي أَذْكُرْكُمْ﴾» [البقرة: 152] ”پس تم مجھے یاد کرو تو میں تمہیں یاد کروں گا۔“ ② جس نے دعا کی اس کی دعا قبول کی جاتی ہے، الله تعالیٰ کا ارشاد ہے: «﴿ادْعُونِي أَسْتَجِبْ لَكُمْ﴾» [غافر: 60] ”مجھ سے دعا کرو میں اسے قبول کروں گا۔“ ③ شکر کرنے والے پر الله مزید فضل و انعام کرتا ہے، ارشادِ باری تعالیٰ ہے: «﴿لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ﴾» [ابراهيم: 7] ”اگر تم میرا شکر کرو گے تو میں تمہیں اور زیادہ نوازوں گا۔“ ④ جو اللہ سے استغفار کرتا ہے، اللہ اس کی مغفرت کرتا ہے، الله تعالیٰ کا فرمان ہے: «﴿اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا﴾» [نوح: 10] ”اپنے پروردگار سے مغفرت چاہو، بلاشبہ وہ بہت بخشنے والا ہے۔“ اس حدیث کے سلسلہ میں پہلے انھوں نے بعض لوگوں کے اس شبہ کا ذکر کیا ہے کہ ”ہم لوگ دعائیں کرتے ہیں مگر وہ قبول نہیں ہوتیں“، پھر اس کا جواب یہ دیا ہے کہ: گویا یہ اعتراض اللہ پر ہے کیونکہ اس نے کہا ہے اور یقیناً اس کی بات برحق ہے کہ: «﴿ادْعُونِي أَسْتَجِبْ لَكُمْ﴾» [غافر: 60] ”مجھے پکارو! میں تمہاری پکار کا جواب دوں گا۔“ نیز: «﴿وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ﴾» [البقرة: 186] ”اور جب میرے بندے تم سے میرے متعلق پوچھیں تو (انھیں بتاؤ کہ) میں (ان کے) نزدیک ہوں اور پکارنے والے کی پکار کا جواب دیتا ہوں۔“ مگر اس حقیقت اور مفہوم سے اہل علم اور اربابِ بصیرت ہی واقف ہو سکتے ہیں۔ ایک اور حدیث میں بھی اس کی وضاحت کی گئی ہے۔ سیدنا ابوسعید خدری رضی اللہ عنہ اور بعض دوسرے صحابہ سے مروی ہے کہ: «مَا مِنْ مُسْلِمٍ يَدْعُوْا اللّٰهَ بِدَعْوَةٍ اِلَّا اسْتَجَابَ لَهُ فَهُوَ مِنْ دَعْوَتِهِ عَلَى إِحْدَيٰ ثَلَاثٍ: إِمَّا أَنْ يُّعَجِّلَ لَهُ فِي الدُّنْيَا وَإِمَّا أَنْ تَدَّخِرَ فِي الْآخِرَةِ وَإِمَّا أَنْ يَدْفَعَ عَنْهُ مِنَ الْبَلَاءِ مِثْلِهَا.» [معجم صغير، ص: 212] ”جو مسلمان بھی اللہ سے دعا کرتا ہے اس کی دعا قبول ہوتی ہے، اس کی تین صورتیں ہیں، یا تو دنیا ہی میں قبولیت عطا کی جاتی ہے، یا اس کی دعا آخرت کے لیے مؤخر کی جاتی ہے اور ذخیرہ بنتی ہے، یا دعا مانگنے والے کی اس طرح کی کوئی مصیبت دفع کر دی جاتی ہے۔“ معجم صغیر کے مطبوعہ ایڈیشن میں مختصر تشریحی حواشی بھی شامل ہیں جن میں نسخوں کے فرق کی توضیح کے ساتھ ساتھ اختلافِ متن کی تصحیح، راویوں کے ناموں کی تحقیق، اعراب کی تعیین، لغات کی تشریح، حدیث کے مشکل جملوں کی وضاحت، اختلافِ قرأت، ثلاثی حدیثوں کی نشاندہی اور دوسری کتبِ حدیث سے اس کی حدیثوں کی مطابقت اور غیر مطابقت اور دیگر بحثیں درج ہیں، شارح نے محدثین کے مسلک کی تائید کی ہے، مثلاً سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے: «قَالَ رَسُوْلُ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ لَا صَلوٰةَ بَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ وَلَا بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ.» [معجم صغير حواشي، ص: 22] ”رسول الله صلی اللہ علیہ وسلم کا ارشاد ہے کہ فجر اور عصر کے بعد طلوع و غروب آفتاب سے پہلے کوئی نماز نہیں پڑھنی چاہیے۔“ اس کے حاشیہ میں لکھتے ہیں: ”یہ حکم بلا سبب پڑھی جانے والی نفل نمازوں کے بارے میں ہے، لیکن فوت شدہ فرائض و نوافل یا کسی وجہ سے پڑھی جانے والی نفل نمازوں کو ان وقتوں میں بھی پڑھنا جائز ہے، جیسا کہ متعدد حدیثوں سے معلوم ہوتا ہے، اس کی تفصیل کے لیے مشہور محدث علامہ شمس الحق عظیم آبادی کے رسالہ «”اعلام أهل العصر بأحكام ركعتي الفجر“» کا مطالعہ کرنا چاہیے۔“ [ايضًا حواشي، ص: 22] امام طبرانی پر بعض اعتراضات اور ان کا جواب: امام طبرانی کی عظمت و جلالت کے باوجود ان پر بعض اعتراضات کیے گئے ہیں، ذیل میں دو اعتراضات نقل کیے جاتے ہیں: ➊ پہلا اعتراض ان کے تفرد کے بارے میں ہے، اسماعیل بن محمد بن فضل تیمی نے ان کے افراد و غرائب پر مشتمل حدیثوں کو جمع کرنے پر نکتہ چینی کرتے ہوئے لکھا ہے کہ ان حدیثوں میں نکارت پائی جاتی ہے اور یہ موضوع اور طعن و قدح سے خالی نہیں ہیں۔ ➋ ان پر وہم و خطا اور نسیان کا بھی الزام عائد کیا گیا ہے، اس کی مثال یہ دی گئی ہے کہ انھوں نے مغازی و سیر کے باب میں مصر کے احمد بن عبداللہ بن عبدالرحیم برقی سے روایت کی ہے، اس نام میں ان کو وہم ہوا ہے، اصل میں راوی احمد کے بجائے ان کے بھائی عبدالرحیم ہیں کیونکہ احمد طبرانی کے مصر جانے سے دس سال پہلے ہی انتقال کر چکے تھے۔ ابن مندہ نے بھی اس کی وجہ سے ان پر طعن کیا ہے اور ابوبکر بن مردویہ نے اسی بنا پر انھیں ”لین“ قرار دیا ہے، ان کے بارے میں یہ بھی کہا جاتا ہے کہ وہ طبرانی کی جانب سے صاف نہ تھے، ابن مردویہ کی جانب سے خفگی کی ایک وجہ یہ بھی منقول ہے کہ انھوں نے بغداد جا کر جب ان حدیثوں کی تحقیق و تفتیش کی جن کو ان سے طبرانی نے ادریس سے اور ادریس نے یزید بن ہارون سے اور انھوں نے روح بن عبادہ کے واسطہ سے بیان کیا تھا تو انھیں، بہت کم حدیثوں کا پتہ چلا، علاوہ ازیں یہ معلوم ہوا کہ اہلِ بغداد کے نزدیک ادریس کا پایہ بلند نہ تھا، اس لیے وہ ان سے زیادہ حدیثیں روایت نہیں کرتے تھے، مگر امام طبرانی کے نزدیک ادریس مغتنم لوگوں میں سے تھے۔ اسی نوعیت کا ایک اور اعتراض حاکم نے علوم الحدیث میں تحریر کیا ہے کہ ابوعلی نیشاپوری امام طبرانی کے بارے میں اچھی رائے نہیں رکھتے تھے، اس کا سبب یہ تھا کہ طبرانی نے شعبہ کی ایک حدیث بیان کی اور کہا کہ یہ ان کو غندر اور شبابہ کے واسطہ سے ملی ہے، ابوعلی نے سوال کیا کہ آپ سے اس کو کس نے روایت بیان کی ہے؟ انھوں نے کہا: عبداللہ بن احمد نے اپنے والد سے، انھوں نے غندر اور شبابہ سے، حالانکہ یہ غندر کی حدیث نہ تھی۔ [لسان الميزان: 73/3] اعتراضات کا جواب: ان اعتراضات کا نمبروار جواب یہ ہے کہ: ① امام طبرانی کو طویل عمر ملی اور ان سے بے شمار حدیثیں منقول ہیں، اس لیے ان کے یہاں تفرد کی بھی کثرت ہے، لیکن اربابِ فن نے ان کے تفرد کو منکر قرار نہیں دیا ہے۔ حافظ ذہبی لکھتے ہیں کہ کثرتِ روایت کی وجہ سے امام طبرانی کے تفرد کو منکر نہیں قرار دیا جاتا۔ حافظ ابن حجر نے تیمی کے مذکورہ بالا اعتراض کا جواب دیتے ہوئے لکھا ہے: ”افراد و غرائب جمع کرنے کا معاملہ صرف طبرانی کے ساتھ مخصوص نہیں ہے، اکثر قدیم محدثین کا یہی حال تھا کہ وہ تفرد کو زیادہ اہمیت نہیں دیتے تھے اور اپنی ذمہ داری سے برأت کے لیے احادیث کو ان کی اصل سندوں کے ساتھ بیان کرنے پر اکتفا کرتے تھے۔“ ② دوسرے اعتراض میں بعض ناموں کے بارے میں امام طبرانی کے سہو و نسیان کا ذکر ہے، اس کتاب میں یہ پہلے لکھا جا چکا ہے کہ وہم و نسیان علمائے فن کے نزدیک مانع ثقاہت اور قابلِ اعتراض نہیں۔ چنانچہ حافظ ذہبی اس اعتراض کا جواب دیتے ہوئے رقمطراز ہیں: ”یہ زیادہ اہم بات نہیں، احمد بن منصور شیرازی فرماتے ہیں کہ ”میں نے ان سے تین لاکھ حدیثیں لکھیں، وہ ثقہ تھے، البتہ مصر کے ایک شیخ سے انھوں نے حدیث لکھی اور غلطی سے اس کو ان کے بجائے ان کے بھائی کی جانب منسوب کر دیا۔“ [تذكرة الحفاظ: 130/3] اس سے ظاہر ہوتا ہے کہ ابن مردویہ نے جو روایت کی اس بنیاد پر بھی طبرانی کو مجروح اور قابلِ طعن قرار دینا زیادتی ہے، رہی یہ بات کہ وہ طبرانی کی جانب سے صاف نہ تھے تو یہ صحیح نہیں معلوم ہوتا، کیونکہ وہ خود ان کے حلقۂ فیض سے وابستہ تھے اور ان سے حزم و احتیاط کے ساتھ حدیثیں بھی نقل کرتے تھے، چنانچہ حافظ ابونعیم نے ان سے پوچھا کہ آپ نے طبرانی سے حدیثیں روایت کی ہیں؟ انھوں نے جواب دیا کہ ہاں، میں ان سے احتیاط کے ساتھ روایتیں کرتا ہوں۔ حافظ ضیاء کا بیان ہے کہ ابن مردویہ نے خود اپنی تاریخ میں طبرانی کا ذکر کیا ہے لیکن ان کی تضعیف نہیں کی ہے۔ اس سے ثابت ہوتا ہے کہ طبرانی ثقہ و ثبت تھے اور ابن مردویہ کے نزدیک بھی ان کی ثقاہت مسلم تھی۔ [أيضًا] اگر یہ ثابت بھی ہو جائے کہ ابن مردویہ کو واقعی ان سے بدگمانی تھی تو تنہا ان کی ذاتی رائے کی وجہ سے طبرانی کو ضعیف اور غیر معتبر قرار نہیں دیا جاسکتا۔ ابوعلی نیشاپوری کے بیان میں بھی وہم و نسیان کا ذکر ہے، اس کا جواب بھی مندرجہ بالا توضیح سے ہو گیا، لیکن حافظ ابن حجر کے بیان سے معلوم ہوتا ہے کہ اس بارے میں طبرانی کو کوئی وہم نہیں ہوا تھا، چنانچہ وہ لکھتے ہیں: ابونعیم نے ابوعلی کا تعاقب کرتے ہوئے غندر کی حدیث کو ابوعلی بن صواف سے اور انھوں نے عبداللہ بن احمد سے اسی طرح بیان کیا ہے جس طرح طبرانی نے بیان کیا ہے، اس سے طبرانی کا بری الذمہ ہونا ظاہر ہوتا ہے، حافظ ضیاء نے طبرانی کے دفاع میں ایک رسالہ لکھا تھا، جس میں وہ اس اعتراض کی تفصیل ذکر کرنے کے بعد لکھتے ہیں: «لَوْ كَانَ كُلُّ مَنْ وَهِمَ فِيْ حَدِيْثٍ أَوْ حَدِيْثَيْنِ أُتُّهِمَ لَكَانَ هٰذَا لَا يَسْلَمُ مِنْهُ أَحَدٌ.» [لسان المیزان، ج 3، ص: 74] ”اگر اسی طرح ہر شخص کو ایک یا دو حدیثوں میں وہم کی وجہ سے متہم قرار دیا جائے تو کوئی شخص بھی الزام و اعتراض سے بچ نہیں سکتا۔“ اس تفصیل سے ان اعتراضات کی حقیقت واضح ہوگئی اور یہ بھی ظاہر ہو گیا کہ اگر یہ صحیح بھی ہوں تو ان سے ان کی عظمت و اہمیت میں کوئی فرق نہیں آتا۔"
}