{
    "book_name": "Musannaf Ibn Abi Shaybah",
    "urdu_text": "سوانح حیات امام ابن ابی شیبہ رحمہ اللہ نام و نسب: ابن ابی شیبہ کا اصل نام عبدالله بن محمد بن ابراہیم بن عثمان بن خواستہ ہے۔ ان کا لقب ”ابن ابی شیبہ“ مشہور ہے۔ وہ قبیلہ بنی اسد سے تعلق رکھتے تھے۔ ولادت: ابن ابی شیبہ کی ولادت 159 ھ (775ء) میں کوفہ، عراق میں ہوئی۔ علمی پس منظر: ابن ابی شیبہ اپنے دور کے بڑے محدثین، مفسرین اور فقہا میں شمار کیے جاتے ہیں۔ انہوں نے علم حدیث اور فقہ کی بہت بڑی خدمات انجام دیں۔ ان کی تعلیمی سیرت اور علمی شہرت کی وجہ سے ان کے درسگاہ میں بڑے بڑے علماء آتے تھے۔ شیوخ: ابن ابی شیبہ نے بہت سے بزرگوں سے روایت کی ہے، جن میں سے کچھ مشہور شیوخ درج ذیل ہیں: ابو نعیم الفضل بن دکین وابصہ بن معبد سفیان الثوری شعبة بن الحجاج یحییٰ بن سعید القدری تلامذہ: ابن ابی شیبہ کے تلامذہ میں بھی بہت سے بزرگ علماء شامل ہیں جیسے: مسلم بن الحجاج (جامع صحیح کے مصنف) ابو زرعہ ابو حاتم رازی البخاری مسلم تصانیف: ابن ابی شیبہ کی کتابیں اپنے موضوع کی ابتدا ہیں اور ان کی تحقیقاتی اہمیت کی وجہ سے ان کی کتابیں علمی دنیا میں بہت زیادہ پڑھی جاتی ہیں۔ ان کی اہم تصانیف درج ذیل ہیں: المصنف: ابن ابی شیبہ کی یہ کتاب حدیث اور فقہ کی قدیم ترین کتابوں میں سے ایک ہے۔ اس کتاب میں حدیثوں کے ساتھ ان کی فقہی استدلال بھی شامل ہیں۔ اس کتاب کا اہمیت یہ ہے کہ اس میں مختلف ائمہ کے آراء اور فقہی نظریات بھی درج ہیں۔ یہ کتاب امام مالک، امام ابو حنیفہ، امام شافعی اور دیگر ائمہ کے آراء کو بھی پیش کرتی ہے۔ التفسیر: ابن ابی شیبہ کی یہ کتاب قرآن کی تفسیر پر مشتمل ہے، جس میں مختلف صحابہ اور تابعین کے قول و آراء درج ہیں۔ التاریخ: ابن ابی شیبہ نے تاریخ پر بھی ایک کتاب لکھی ہے جو ان کی علمی شخصیت کو مزید روشناس کرتی ہے۔ وفات: ابن ابی شیبہ کا انتقال 235 ھ (849ء) میں کوفہ، عراق میں ہوا۔ وہ اپنے وقت کے عظیم علماء میں سے تھے اور ان کی وفات کے بعد بھی ان کی تصانیف علمی دنیا میں اہم مقام رکھتی ہیں۔ خصوصیات: ابن ابی شیبہ کی علمی شخصیت کے بارے میں کہا جاتا ہے کہ وہ حدیث کے علم میں بہت مہارت رکھتے تھے۔ ان کی روایات کو علمائے حدیث نے بہت زیادہ اعتبار کیا ہے۔ ان کی کتاب المصنف اسلامی فقہ اور حدیث کی ابتدائی کتابوں میں سے ایک ہے اور اس کی وجہ سے وہ اپنے دور کے بہترین محدثین میں شمار کیے جاتے ہیں۔"
}