{
    "book_name": "Muslim",
    "urdu_text": "امام مسلم رحمہ اللہ کے حالات زندگی: الامام، الحافظ، الحجتہ ابوالحسین مسلم بن الحجاج بن مسلم بن ورد بن کوشاذ القشیری، النیسابوری 202 یا 204 یا 206 ھ میں نیشا پور میں پیدا ہوئے اور وہیں علم کی کئی منزلیں طے کیں۔ ان کے والدین صاحب حثیت تھے۔ اس لیے امام مسلم کو زندگی میں رزق کے لیے زیادہ تگ و دو نہیں کرنی پڑی انہوں نے اپنی زندگی علم حدیث کی خدمت کے لیے وقف کر دی۔ ​ حصول علم: اٹھارہ برس کی عمر میں سب سے پہلے حدیث کا سماع (سماع اور کتابت لازم و ملزم تھے) یحییٰ بن یحییٰ تمیمی سے کیا۔ 220ھ میں حج کیا اور مکہ میں امام مالک کے اجل ترین شاگرد عبداللہ بن مسلمہ قعنبی سے احادیث سنیں اور لکھیں۔ کوفہ میں انہوں نے [سیر أعلام النبلاء: 558/12، وتذکرۃ الحفاظ: 281/1] احمد بن یونس کے علاوہ علماء کی ایک جماعت سے، پھر حرمین، عراق اور مصر کے تقریباً دو سو بیس استاتذہ سے احدیث حاصل کیں۔ حصول حدیث کا طریقہ یہی تھا کہ احادیث مع اسناد سنی اور ساتھ لکھی جاتی تھی۔ اساتذہ: ان کے اہم اساتذہ میں امام احمد بن حنبل، احمد بن منذر قزاز، اسحاق بن راہویہ، ابراہیم بن سعید جوہری، ابراہیم بن موسٰی، ابواسحاق رازی، احمد بن ابراہیم، اسحاق بن موسٰی انصاری (ابوموسٰی)، اسماعیل بن ابی اویس، حرملہ بن یحییٰ (ابوحفص تحبیبی)، حسن بن ربیع بورانی، ابوبکر بن ابی شیبہ، یعقوب بن ابراہیم دورقی، ابوزرعہ رازی اور یحییٰ بن معین جیسے حفاظ حدیث شامل ہیں۔ روزگار: امام مسلم رحمہ اللہ کا کچھ کاروبار ایک قدیم قصبے ”خان محمش“ میں تھا، ان کی معاش کا زیادہ تر انحصار ان کی جاگیر پر تھا جو نیشاپور ہی مضافات میں واقع تھی۔ حلیہ، اولاد: امام حاکم کے والد (عبداللہ بن حمدویہ) کو ان کے والد (امام حاکم کے دادا) نے بتایا انہوں نے امام مسلم کی زیارت ”خان محمش“ میں کی تھی۔ ان کی قامت پوری، رنگ گورا اور داڑھی سفید تھی۔ انہوں نے عمامے کا ایک کنارہ دونوں کندھوں کے درمیان پشت پر لٹکایا ہوا تھا۔ امام حاکم کے والد نے امام مسلم کے گھر میں ان کی بیٹیوں کی اولاد بھی دیکھی۔ وفات: ان کی وفات کا واقعہ جس طرح تاریخ بغداد اور سیر اعلام النبلاء میں بیان کیا گیا ہے، انتہائی عجیب ہے۔ اس سے پتہ چلتا ہے کہ فن حدیث میں ان کی جستجو کا کیا عالم تھا اور اس حدیث میں ان کا انہماک کس درجے پر پہنچا ہوا تھا۔ احمد بن سلمہ کہتے ہیں: امام مسلم رحمہ اللہ سے استفادے کے لیے ایک مجلس مذکراہ منعقد کی گئی، اس میں ان کے سامنے ایک ایسی روایت کا ذکر آیا جو ان کو معلوم نہ تھی۔ گھر واپس آئے تو چراغ جلایا اور گھر والوں سے کہا کہ ان کے کمرے میں کوئی نہ آئے۔ گھر والوں نے بتایا کہ گھر میں کھجور کا ایک ٹوکرا ہدیہ بھیجا گیا ہے فرمایا: لے آؤ۔ وہ حدیث کی تلاش میں منہمک ہو گئے ٹوکرا ساتھ رکھا تھا، بےخیالی کے علام میں ٹوکرے سے کھجور کا ایک ایک دانہ اٹھا کر منہ میں ڈالتے رہے، اسی عالم میں صبح ہو گئی۔ انھیں حدیث کی تفصیلات مل گئیں ادھر ٹوکرا خالی ہو گیا۔ کہا جاتا ہے اسی وجہ سے ان کی طبیعت بگڑ گئی اور علم و عرفان کا یہ سورج ہمیشہ کے لیے غروب ہو گیا۔ امام مسلم رحمہ اللہ کی وفات 24 رجب 261ھ کے اتوار کی شام کو ہوئی، اگلے روز نیشاپور میں تدفین ہوئی۔ تصنیفات: امام مسلم رحمہ اللہ کی اہم ترین تصنیفات جنہیں امام حاکم اور دوسرے محدثین نے ذکر کیا ہے یہ ہیں: رجال: ➊ «الأسامي والكني» ➋ «كتاب الطبقات» ➌ «كتاب الوحدان» ➍ «كتاب الافراد» ➎ «كتاب الأقران» ➏ «كتاب أولاد الصحابة» ➐ «كتاب أفراد الشامبين» ➑ «كتاب مشايخ مالك» ➒ «كتاب مشايخ الثوري» ➓ «كتاب مشايخ شعبة» ⓫ «كتاب من ليس له إلا راو واحد» ⓬ «كتاب المخضرمين» ⓭ «كتاب طبقات التابعين» متون حدیث: ➊ «كتاب المسند الكبير على الرجال» ➌ «كتاب المسند الصحيح» (عرف عام ميں صحيح مسلم) ➍ «كتاب حديث عمرو بن شعيب» نقد الحدیث: ➊ «كتاب التميز» ➌ «كتاب سؤالات احمد بن حنبل» ➍ «كتاب أوهام المحديثين» فقہ الحدیث: ➊ «كتاب الانتقاع باهب السباع» یہ امام مسلم کی اہم ترین کتابوں کے نام ہیں، ان کی ساری تصنیفات کی فہرست نہیں ہے۔ صحیح مسلم اور اس کا امتیاز: حافظ ابن عساکر اور امام حاکم کہتے ہیں کہ امام مسلم اپنی کتاب صحیح مسلم کو دو اقسام میں مکمل کرنا چاہتے تھے۔ وہ چاہتے تھے کہ قسم اول میں طبقہ اولٰی کے راویوں کی صحیح احادیث اور قسم ثانی کی صحیح طبقہ ثانیہ کی صحیح احادیث لائیں۔ وہ ابھی طبقہ اولٰی پر مشتمل حصہ مکمل کر پائے تھے کہ ان کا انتقال ہو گیا گویا صحیح مسلم ان کی زندگی کے آخری مرحلے کی تصنیف ہے۔ صحیح مسلم ان کے فن کا اوج کمال ہے اور اس سے پہلے سارا کام اپنی جگہ مستقل ہونے کے ساتھ ساتھ صحیح مسلم کی تیاری یا بنیاد سازی کا کام بھی کہا جا سکتا ہے۔ رجال، متون اور علل پر مکمل عبور اور تیاری کے بعد ہی ایسی کتاب لکھی جا سکتی ہے جیسی صحیح مسلم ہے۔ اس وقت طالبان حدیث کو ایک ایسی کتاب کی تلاش تھی جو دین کے طور طریقوں، احکام، جزا و سزا اور جن چیزوں سے بچنا اور جن کو اپنانا ہے ان کے بارے میں رسول اللہ صلی اللہ علیہ وسلم کے فرامین اور سنن کی مستند روایات پر مشتمل ہو، ان روایات کی سندوں کو اہل علم نے قبول کیا ہو اور یہ روایات حسن ترتیب سے ایک تالیف میں جمع کر دی گئی ہوں جو غیر ضروری طور پر طویل نہ ہو اور جو دین کے فہم، تدبر اور استنباط کے حوالے سے دیگر کتابوں سے مستغنی کر دے۔ امام مسلم نے امت کی اس ضرورت کو محسوس کیا، ایک ایسی کتاب کی اہمیت اور اس کے فوائد پر غور کیا تو بڑے ذخیرہ حدیث میں سے صحیح ترین احادیث کے نسبتاً مختصر مجموعے کی ترتیب وتالیف کا بیڑا اٹھایا۔ امام مسلم نے احادیث کے انتخاب کے حوالے سے اپنی کتاب کے لیے بنیادی شرط رکھی کہ حدیث ”سنداً متصل ہو“ اول سے لے کر آخر تک ثقہ نے ثقہ سے روایت کی ہو اور شذوذ اور علل سے پاک ہو۔“ صحیح بخاری اور صحیح مسلم کا موازنہ: امام بخاری اور امام مسلم ہم عصر ہیں۔ دونوں نے فقہی ترتیب پر احادیث کے صحیح مجموعے کی ضرورت کو ایک ہی دور میں محسوس کیا اور اپنا اپنا مجموعہ حدیث مرتب کیا۔ صحیح بخاری اور صحیح مسلم دونوں کی صحت پر امت کا اجماع ہے۔ اس کے ساتھ یہ بھی بحث چلتی رہی ہے کہ دونوں میں سے ترجیح کس کتاب کو حاصل ہے۔ شارح مسلم امام نووی رحمہ اللہ فرماتے ہیں: علماء اس بات پر متفق ہیں کہ قرآن مجید کے بعد صحیح ترین کتابیں صحیح بخاری اور صحیح مسلم ہیں۔ امت نے انہیں اسی حثیت سے قبول کیا ہے صحیح بخاری دونوں میں سے صحیح تر ہے فوائد میں عیاں اور دقیق دونوں قسم کے معارف میں بڑھ کر ہے۔ یہ بات بھی درست ہے کہ امام مسلم امام بخاری سے مستفید ہوتے تھے اور کہا کرتے تھے کہ علم حدیث میں ان کی کوئی نظیر موجود نہیں۔ مجموعی حیثیت سے صحیح بخاری کو صحیح مسلم پر ترجیح حاصل ہے اور یہی درست نقطہ نظر ہے جس کے جمہور علماء ماہرین فن اور نکتہ سنجان علم حدیث قائل ہیں۔ امام ابوعلی حسین نیشاپوری اور مغرب (شمالی افریقہ کے مسلم ممالک) کے بعض علماء صحیح مسلم کو ترجیح دیتے ہیں۔ لیکن جمہور علماء کا نقطہ نظر یہ ہے کہ صحیح بخاری ہی کو ترجیح حاصل ہے معروف فقیہ اور نقاد حدیث حافظ ابوبکر اسماعیلی رحمہ اللہ نے اپنی کتاب ”المدخل“ میں اس بات کو دلائل سے واضح کیا ہے۔۔۔ البتہ صحیح مسلم کے بعض امتیازی پہلو ایسے ہیں جو اسی کتاب کے ساتھ خاص ہیں۔ جن لوگوں نے صحیح بخاری پر صحیح مسلم کو ترجیح دی ہے ان کے پیش نظر یہی امتیازی پہلو تھے۔ امام نووی فرماتے ہیں: امام مسلم ایک انتہائی فائدہ مند خصوصیت میں متفرد ہیں جو انہی کے شایان شان تھی۔ وہ یہ کہ (ان کی کتاب) استفادے میں آسان ہے انہوں نے ہر حدیث کو ایک ہی جگہ جو اس کے لائق تھی درج کیا ہے اور اس کی متعدد سندیں اور روایت شدہ مختلف الفاظ اس کے ساتھ ہی بیان کر دیئے ہیں۔ اس سے طالب علم کے لیے مذکورہ حدیث کی تمام صورتوں پر نظر ڈالنا اور ان سے فائدہ اٹھانا آسان ہو گیا ہے اس طریقے سے امام مسلم نے حدیث کے جو طرق (سندیں) ذکر کیے ہیں ان پر قاری کا اعتماد بڑھ جاتا ہے۔ تائید و توثیق کا حیرت انگیز سلسلہ: یہ امام مسلم رحمہ اللہ کا بہت بڑا کارنامہ ہے کہ وہ ایک ہی حدیث کو اپنے ایک استاد کے علاوہ دوسرے اساتذہ کی سندوں سے بیان کرتے ہیں پھر ان کے اوپر کی سند میں ایک ہی استاد یا متعدد اساتذہ سے بیان کرنے والے ایک سے زیادہ راویوں کی سندیں بیان کرتے ہیں اور بالکل اوپر ایک ہی حدیث کو اگر ایک سے زیادہ صحابہ نے روایت کیا ہے تو مختلف سندوں سے ان روایات کو بھی لے آتے ہیں آج اگر کوئی مطالعہ کرنے والا ایک ہی حدیث لے لیے امام مسلم کی ذکر کردہ تمام سندوں کو سامنے رکھے تو یہ واضح ہو جاتا ہے کہ امام مسلم نے ایک حدیث کو اپنے ایک استاد اور اوپر تک اس کے ایک استاد سے روایت کرنے پر اکتفا نہیں کیا، بلکہ وہ ایک ہی استاد سے روایت کرنے والے متعدد لوگوں کے پاس کتابت حدیث کے لیے حاضر ہوئے، ایک استاد مختلف اوقات میں روایت کرنے والے ان کے مختلف شاگردوں (تابعین) سے الگ الگ وہی حدیث سنی اور اس کی توثیق کی۔ اس طرح انہوں نے واضح کیا کہ جن اساتذہ نے مختلف اوقات میں مختلف لوگوں کے سامنے وہ حدیث بیان کی اور ہمیشہ ایک ہی جیسے الفاظ سے بیان کرتے رہے، وہ حقیقت میں حفظ و اتقان کے اعتبار سے انتہائی قابل اعتماد ہیں اور ان کی بیان کردہ روایت صحیح ہے۔ انہوں نے اپنے اساتذہ سے اوپر کی اسناد کی بھی اسی طرح مختلف بیان کرنے والوں کی روایات کے زریعے سے توثیق کی، حتی کہ اکثر اوقات رسول اللہ صلی الله عليه وسلم سے بیان کرنے والے مختلف صحابہ کی روایات ان کے اپنے اپنے شاگردوں سے اکھٹی کر کے ان کو بطور شواہد پیش کیا۔ ان میں سے ہر ایک کے لیے متابعات پیش کیں ان کی ایک دوسرے سے توثیق کی اور جو احادیث ہر اعتبار سے ضبط و اتقان میں مکمل تھیں، انہی کا انتخاب کیا، یہ اہتمام بڑے سے بڑے معاملے میں دی گئی شہادتوں کے لیے کسی بڑی سے بڑی عدالت یا توثیقی ادارے کے بس میں نہیں۔ اگر حدیث کے الفاظ یا سند میں کوئی انتہائی معمولی فرق بھی ہے، جیسے «حدثنا» اور «اخبرنا» کا فرق، تو اس کو بھی محفوظ کیا ہے۔ متن میں انتہائی معمولی کمی بیشی کو بھی ذکر کیا ہے۔ اس طرح صحیح مسلم احادیث رسول اللہ صلی الله عليه وسلم کا ایک ایسا مجموعہ بن گیا ہے جو اسناد و متون کے باہمی موازنے اور توثیق کا بے مثال عملی نمونہ ہے۔ صحیح مسلم میں روایات کی تعداد: اس احتیاط و اہتمام کے ساتھ امام مسلم نے جو صحیح مرتب کی، تکرار کے بغیر اس کی احادیث کی تعداد تین ہزار تینتیس ہے اور مکرر احادیث کو شمار کیا جائے تو کل احادیث سات ہزار پانچ سو تریسٹھ ہیں۔ امام مسلم نے یہ انتخاب تین لاکھ احادیث سے کیا ہے۔ یہ بات یاد رکھنی چاہیے کہ تین لاکھ احادیث سے مراد تین لاکھ متن یا مرویات نہیں۔ احادیث کی عدد شماری کا اصول اس مثال سے واضح ہوتا ہے: اگر ایک صحابی سے ایک تابعی نے حدیث بیان کی تو ایک حدیث ہے اگر دو نے کی دو حدیثیں ہیں اسی طرح تابعی سے جتنے شاگردوں نے سن کر حدیث بیان کی اسی حساب سے نمبر بڑھتا گیا ہے۔ تین لاکھ احادیث سے مراد تین لاکھ الگ الگ سندوں سے بیان کردہ روایات ہیں۔ بعض لوگ اس اصول کو نہیں سمجھتے اس لیے بہت سی غلط فہمیوں کا شکار ہو جاتے ہیں۔"
}