{
    "book_name": "Musnad Ahmed",
    "urdu_text": "بسم اللہ الرحمن الرحیم کتاب کا زمانہ تصنیف : امام احمد (رح) نے یہ کتاب 220 ہجری سے 237 کے درمیان تصنیف فرمائی۔ محدثین کرام نے کتب حدیث میں مختلف ترتیب کے تحت احادیث جمع کی ہیں اور ہر ترتیب کے لحاظ سے مجموعہ کا نام رکھا جاتا ہے۔ جس کتاب میں ابواب فقہیہ کی ترتیب سے احادیث جمع کی جائیں اس کتاب کو سنن کہتے ہیں۔ جیسے سنن ترمذی سنن نسائی وغیرہ ۔۔ اسی طرح جمع حدیث کی دیگر اصناف میں جامع، صحیح، معجم، مفرد وغیرہ بھی شامل ہیں۔ ان میں ایک ترتیب کو ' مسند ' کہا جاتا ہے۔ مسند ، حدیث کی اس کتاب یا مجموعہ کو کہتے ہیں جس میں احادیث کو صحابہ کرام رضوان اللہ علیہم اجمعین کی ترتیب سے جمع کیا ہو۔ یعنی ایک صحابی کے نام کا عنوان دے کر اس کے تحت اس کی تمام روایات ذکر کی جائیں۔ پھر دوسرے صحابی کا نام دے کر اس کے تحت اس کی تمام مرویات ذکر کیا جائیں ۔ زیر نظر کتاب مسند احمد اسی صنف سے تعلق رکھتی ہے۔ اسی لیے اس کتاب میں سب سے پہلے عشرہ مبشرہ رضوان اللہ علیہم اجمعین کی تمام احادیث ہیں۔ بعدہ مکثرین کی روایات ہیں پھر دوسرے صحابہ کی۔ اور اس کے بعد مرد صحابہ کی تمام مرویات کا ذکر کرنے کے بعد ، خواتین صحابیات کی مرویات ذکر کی گئی ہیں۔ ان میں سب سے پہلے حضرت عائشہ (رض) کی احادیث جمع کی گئی ہیں پھر باقی صحابیات کی۔ اس طرح اس مجموعہ میں تقریباً 28000 روایات آگئی ہیں۔ ترجمہ مسند : چونکہ مذکورہ سوفٹ وئیر میں مسند احمد بن حنبل کے عربی متن کے ساتھ اردو ترجمہ شامل ہے۔ اس لیے اس ترجمہ کی چند خصوصیات درج ذیل ہیں جو مترجم نے کتاب کے دیباچہ میں لکھی ہیں : 1 ۔ حدیث کا ترجمہ کرنے میں اس طرح کی آزاد ترجمانی کی گئی ہے کہ الفاظ حدیث کی رعایت بھی ہوجائے اور زبان کی روانی اور سلاست پر بھی کوئی فرق نہ پڑے۔ 2 ۔ حدیث کا ترجمہ کرنے میں اگر کسی صحابی کے متعلق دوسرے صحابی کے یا کسی راوی کے الفاظ سخت معلوم ہوئے تو ان کا ایسا نرم ترجمہ کیا گیا جس سے ان الفاظ کی تلخی بھی کم ہوجائے، مفہوم بھی ادا ہوجائے اور عام قاری کے ذہن میں صحابہ کرام (رض) کے باہمی تعلقات کے حوالے سے منفی خیالات پیدا نہ ہونے پائیں، اسی طرح حیض و نفاس اور حمل وغیرہ الفاظ کا ترجمہ بعینہ انہی الفاظ میں کرنے کی بجائے بہت حد تک متبادل الفاظ لانے کی کوشش کی گئی ہے۔ 3 ۔ حدیث کے ترجمے میں ایسے الفاظ کا انتخاب کرنے کی کوشش کی گئی ہے جن سے فقہی اختلافات بہت حد تک خود بخود کم ہوجائیں۔ 4 ۔ حدیث کا ترجمہ کرنے میں نفس ترجمہ اور کہیں کہیں مضمونِ حدیث کی وضاحت پر اکتفاء کیا گیا ہے۔ 5 ۔ عوام اور علماء کی نئی نسل کے لیے سہولت کی خاطر ہر حدیث پر اعراب کا اہتمام کیا گیا ہے تاکہ حدیث کا صحیح تلفظ کیا جاسکے۔ 6 ۔ ہر حدیث کے ساتھ اس کی تخریج اور دیگر کتب حدیث سے اس کے حوالہ جات کا التزام کیا گیا ہے۔ 7 ۔ محدثین نے اگر کسی حدیث کو ضعیف یا موضوع قرار دیا ہے تو اس کی بھی نشاندہی کی گئی ہے تاکہ کسی بھی حدیث کو بیان کرنے سے پہلے اس کا حکم معلوم کرلیا جائے، صرف اس چیز کو بنیاد نہ بنایا جائے کہ یہ روایت مسند احمد میں آتی ہے۔ امام احمد بن حنبل (رح) کے حالات زندگی نسب نامہ : امام احمد (رح) کا نسب نامہ ان کے صاحبزادے عبداللہ بن احمد (رح) نے یوں بیان فرمایا ہے۔ احمد بن محمد بن حنبل بن ہلال بن اسد بن ادریس بن عبداللہ بن حیان بن عبداللہ بن انس بن عوف بن قاسط بن مازن بن شیبان بن ذہل بن ثعلبہ بن عکابہ بن صعب بن علی بن بکر بن وائل ذہلی شیبانی، مروزی بغدادی۔ ولادت اور ابتدائی نشو و نما : امام احمد بن حنبل ماہ ربیع الثانی 164 ہجری میں پیدا ہوئے، ان کے والد عین جوانی کے عالم میں صرف تیس سال کی عمر میں ہی فوت ہوگئے تھے لہذا امام صاحب (رح) کی پرورش اور نگہداشت ان کی والدہ کے نازک کندھوں پر اپنی پوری ذمہ داریوں کے ساتھ آن پڑی، خود امام صاحب کا کہنا ہے کہ میں نے اپنے باپ دادا میں سے کسی کو نہیں دیکھا۔ طلب علم : امام احمد بن حنبل (رح) ابتدائی مکتب کی تعلیم حاصل کرنے کے بعد 179 ہجری میں علم حدیث کے حصول میں مشغول ہوئے جبکہ ان کی عمر محض پندرہ سال تھی اور 183 ہجری میں کوفہ کا سفر کیا اور اپنے استاذ ہشیم کی وفات تک وہاں مقیم رہے، اس کے بعد دیگر شہروں اور ملکوں میں علم حدیث حاصل کرنے کے لیے آتے اور جاتے رہے۔ شیوخ و اساتذہ : امام احمد بن حنبل (رح) نے جن ماہرین فن اور باکمال محدثین سے اکتساب فن کیا وہ اپنے زمانے کے آفتاب و ماہتاب تھے۔ ان میں سے چند ایک کے نام زیادہ نمایاں ہیں مثلاً اسحاق بن عیسی، اسماعیل بن علیہ، سفیان بن عیینہ، ابوداود طیالسی، عبدالرحمن بن مہدی، عبدالرزاق بن ہمام، فضل دبن دکین، قتیبہ بن سعید، وکیع بن جراح، یحییٰ بن آدم، یحییٰ بن سعید القطان وغیرہ۔ تلامذہ و شاگردان رشید : امام احمد بن حنبل (رح) سے علم حدیث حاصل کرنے والوں میں بھی اپنے زمانے میں کے بڑے بڑے محدثین کے نام آتے ہیں، جن میں سے چند ایک کے نام یہ ہیں مثلاً امام بخاری، امام مسلم، امام ابو داود، ابراہیم بن اسحاق حربی، عبداللہ بن احمد، صالح بن احمد، بشر بن موسی، بقی بن مخلد، رجاء بن مرجی، ابوزرعہ دمشقی، ابوحاتم رازی، محمد بن یوسف بیکندی وغیرہ۔ اور اس میں اہم بات یہ ہے کہ بعض ایسے حضرات کے اسماء گرامی بھی امام احمد (رح) سے سماع حدیث کرنے والے شاگردوں کے زمرے میں آتے ہیں جو خود امام احمد (رح) کے اساتذہ و شیوخ میں سے ہیں۔ مثلاً وکیع بن جراح، یحییٰ بن آدم، امام شافعی (رح) قتیبہ بن سعید اور عبدالرحمن بن مہدی وغیرہ۔ اخلاق و صفات : امام احمدر حمۃ اللہ علیہ بےمثال حافظہ، ذہانت ذکاوت اور علم کے حامل تھے۔ اس کے علاوہ کلمہ حق کی خاطر اپنی جان لڑا دینا، قرآن و سنت پر عمل اور استقامت، خصوصاً بادشاہ وقت کے سامنے کلمہ حق کا اعلان اور پھر اس پر استقامت کے معاملہ میں امام احمد بن حنبل (رح) ضرب المثل ہیں۔ مسئلہ خلق قرآن میں امام احمد کی ابتلاء و آزمائش اور قید وصعوبت کا دور اس پر گواہ ہے۔ ان کے ایک معاصر قتیبہ کا مقولہ کہ : \" جب تم کسی کو دیکھو کہ اس کو احمد بن حنبل سے محبت ہے تو سمجھ لو کہ وہ سنت کا متبع ہے \" اہل و عیال : کتب سیر میں امام احمد (رح) کے اہل و عیال میں دو بیویوں، عباسہ اور ریحانہ، اور ایک باندی \" حسن \" کا تذکرہ ملتا ہے۔ پہلی بیوی سے ایک بیٹا ہوا، جس کا نام صالح تھا۔ دوسری بیوی سے بھی ایک بیٹا جس کا نام عبداللہ رکھا گیا۔ بعد ازاں انہی نے مسند احمد کو ترتیب دیا۔ باندی سے چار بچے ہوئے۔ جن کے نام بالترتیب۔ حسن ، حسین ، حسن اور محمد ہیں۔ وفات حسرت آیات : 241 ہجری میں ربیع الال کے مہینہ کی پہلی تاریخ امام صاحب بیمار ہوئے اور بیماری بڑھتی ہی گئی یہاں تک کہ جمعہ کے دن بارہ ربیع الاول 241 ہجری کو امام صاحب خالق حقیقی سے جا ملے۔ مورخین کے مطابق امام صاحب کے جنازے میں اطراف و اکناف سے لوگوں کی اتنی بڑی تعداد جمع ہوگئی تھی کہ اس سے پہلے کسی جنازے میں لوگوں کی اتنی بڑی تعداد جمع ہوگئی تھی کہ اس سے پہلے اتنی کثیر تعداد نہیں دیکھی گئی، بعض مورخین کے مطابق ان کی نماز جنازہ میں آٹھ لاکھ مردوں اور ساٹھ ہزار خواتین کی شمولیت کا اندازہ لگایا گیا ہے، ایک عرصے تک لوگ ان کی قبر پر حاضر ہوتے رہے۔ امام احمد (رح) کے صاحبزادے عبداللہ بن احمد (رح) : ان کی ولادت ماہ جمادی الثانیہ 213 ہجری میں ہوئی، جبکہ مقام پیدائش بغداد ہے، امام احمد (رح) کے اہل وعیال کے تذکرے میں ان کی والدہ اور دیگر بہن بھائیوں کا تذکرہ آگیا ہے۔ عبداللہ ہی امام احمد (رح) کے صحیح جانشین ثابت ہوئے اور انہوں نے ہی امام صاحب (رح) کی مسند کو پایہ تکمیل تک پہنچایا اور اس میں بہت کچھ اضافے کیے، محدثین نے ان کی توثیق کی ہے، تاہم ایک وقت میں آکر انہوں نے حمص کے عہدہ قضاء کو قبول کرلیا تھا، انہوں نے 77 سال کی عمر پائی اور 21 جمادی الثانیہ 290 ہجری بروز اتوار وفات پائی، نماز جنازہ ان کے بھتیجے زہیر بن صالح نے پڑھائی اور مسلمانوں کی ایک عظیم جمعیت نے ان کی نماز جنازہ میں شرکت کی۔ مسند امام احمد بن حنبل (رح) (مترجم) \" قرآن و حدیث \" میں شامل حدیث کی 11 کتب میں سب سے ضخیم کتاب مسند امام احمد بن حنبل (مترجم) ہے، جو 14 جلدات پر مشتمل ہے۔ اصل کتاب عربی میں ہے۔ جس کے مصنف امام احمد بن حنبل (رح) اور اس کی ترتیب و تدوین کا کام ان کے بیٹے عبداللہ بن احمد کا سر انجام دیا ہوا ہے۔ عربی کتاب کی تصنیف کے تقریباً 1200 برس بعد ، 2008 تا 2009 ء کے عرصہ میں اس کا اردو ترجمہ کیا گیا۔ اردو زبان میں اس عظیم خدمت کو مولانا محمد ظفر اقبال نے سر انجام دیا۔ مذکور ہ سوفٹ وئیر میں جو نسخہ شامل ہے اس کا ناشر و طابع مکتبہ رحمانیہ اردو بازار لاہور ہے۔"
}