{
    "book_name": "Nisai",
    "urdu_text": "نام و نسب اور کنیت: آپ کا نام احمد اور کنیت ابوعبدالرحمن ہے، سلسلہ نسب یہ ہے: احمد بن شعیب بن علی بن سنان بن بحر بن دینار بن نسائی الخراسانی۔ [التذكره: 2/ 241، طبقات الشافعيه2/83] ولادت: آپ کے سن پیدائش میں اختلاف ہے، بعض نے (214ھ) اور بعض نے (215ھ) بیان کیا ہے۔ [التذكره، التهذيب، طبقات الشافعيه] خود امام نسائی سے منقول ہے کہ میری پیدائش اندازاً (215ھ) کی ہے، اس لیے کہ (230ھ) میں، میں نے پہلا سفر قتیبہ بن سعید کے لیے کیا اور ان کے پاس ایک سال دو مہینے اقامت کی۔ [تهذيب الكمال 1/338، سير أعلام النبلاء 14/125] ابن یونس مصری: ابن یونس مصری کہتے ہیں: امام نسائی بہت پہلے مصر آئے، وہاں پر علماء سے احادیث لکھیں، اور طلبہ نے آپ سے احادیث لکھیں، آپ امام حدیث، ثقہ، ثبت اور حافظ حدیث تھے، مصر سے ماہ ذی القعدۃ (302ھ) میں نکلے اور دوشنبہ کے دن 13 صفر 303ھ فلسطین میں آپ کی وفات ہوئی۔ [تهذيب الكمال، تذكرة الحفاظ 2/701، السير14/133، الحطة فى ذكر الصحاح الستة 458] امام ذہبی: امام ذہبی دول الاسلام میں کہتے ہیں: امام نسائی کی عمر (88) سال تھی، (215ھ) کی تاریخ پیدائش کی بنا پر یہ ایک اندازہ ہے، اکثر علماء نے امام نسائی کی عمر (88) سال بتائی ہے۔ [البداية والنهاية 11/124، توضيح المشتبه لابن ناصر الدين الدمشقي 5/18، تهذيب التهذيب 1/36، 37، شذرات الذهب] اس تفصیل سے معلوم ہوا کہ بعض لوگوں نے امام نسائی کی پیدائش (225ھ) لکھی ہے، جو صحیح نہیں ہے، چنانچہ ابن العماد نے امام نسائی کی وفات (303ھ) ذکر کرتے ہوئے کہا: «وله ثمان وثمانون سنة» ‏‏‏‏ اس لحاظ سے بعض مورخین کا یہ کہنا کہ نسائی کی پیدائش (225ھ) میں ہوئی صحیح نہیں ہے۔ [شذرا ت الذهب] وطن: آپ کی پیدائش خراسان کے مشہور شہر نساء میں ہوئی جو صرف نون اور سین کی فتح کے ساتھ اور ہمزہ کے کسر اور مد کے ساتھ پڑھا جاتا ہے، کبھی عرب اس ہمزہ کو واو بدل کر نسبت کرتے وقت «نسوي» بھی کہا کرتے ہیں اور قیاس بھی یہی چاہتا ہے لیکن مشہور نسائی ہے۔ لیکن واضح رہے کہ امام نسائی نے مصر میں سکونت اختیار کر لی تھی۔ طلب حدیث کے لیے بلاد اسلامیہ کا سفر: امام نسائی نے پہلے اپنے شہر کے اساتذہ سے علم حاصل کیا، پھر علمی مراکز کا سفر کیا، سب سے پہلے آپ نے خراسان میں بلخ کے ایک شہر بغلان (230ھ) کا رخ کیا، وہاں قتیبہ بن سعید کے پاس ایک سال دو ماہ طلب علم میں گزارا، اور ان سے بکثرت احادیث روایت کیں، نیز طالبان حدیث کے نقش قدم پر چلتے ہوئے، طلب حدیث کے لیے دور دراز علاقوں کا قصد کیا، حجاز (مکہ و مدینہ) عراق (کوفہ و بصرہ) شام، جزیرہ، خراسان اور سرحدی علاقوں کے مراکز حدیث جن کو «ثغور» (سرحدی علاقے) کہا جاتا ہے وغیرہ شہروں کا سفر کیا، اور مصر میں سکونت اختیار کی۔ [طبقات الشافعيه 84، تذكرة الحفاظ 2/698، مقدمه تحفة: 66] مورخین نے آپ کے علمی اسفار کا ذکر کیا ہے، حافظ ابن کثیر آپ کے علمی اسفار کے بارے میں لکھتے ہیں: «رحل إلى الآفاق واشتغل بسماع الحديث والاجتماع بالأئمة الحذاق» [البدايه: 123] یعنی ”امام نسائی نے دور دراز کا سفر کیا، سماع حدیث میں وقت گزارا اور ماہر ائمہ سے ملاقاتیں کیں۔“ اساتذہ: امام نسائی نے علماء کی ایک بڑی جماعت سے علم حدیث حاصل کیا، حافظ ابن حجر فرماتے ہیں کہ امام نسائی نے بے شمار لوگوں سے احادیث سنیں۔ [تهذيب التهذيب] چند اہم ائمہ اور رواۃ حدیث کا ذکر ذیل میں کیا جاتا ہے: ➊ ابراہیم بن یعقوب الجوزجانی ➋ ابوداود سلیمان بن اشعث السجستانی ➌ احمد بن بکار ➍ احمد بن حنبل ➎ اسحاق بن راہویہ ➏ الحارث بن مسکین ➐ زیاد بن یحیی الحسّائی النکری البصری ➑ عباس بن عبدالعظیم العنبری ➒ عبداللہ بن احمد بن حنبل ➓ عبداللہ بن سعید الکندی ⓫ علی بن حجر ⓬ علی بن خشرم ⓭ عمرو بن بن علی الفلاس ⓮ عمرو بن زرارہ ⓯ قتیبہ بن سعید ⓰ محمد بن اسماعیل بخاری 1؎۔ وضاحت 1؎: حافظ مزی کی تحقیق میں امام نسائی کا سماع امام بخاری سے نہیں ہے، وہ بعض شیوخ کے واسطے سے بخاری سے روایت کرتے ہیں [تهذيب الكمال 24/437] لیکن صحیح اور تحقیقی بات یہی ہے کہ امام نسائی امام بخاری کے شاگرد ہیں، حافظ ابن حجر نے مقدمۃ الفتح میں لکھا ہے کہ بخاری سے احادیث روایت کرنے والے بڑے حفاظ حدیث مسلم، نسائی، ترمذی، ابوالفضل احمد بن سلمہ اور ابن خزیمہ ہیں [492] نیز تہذیب التہذیب میں امام بخاری کے ترجمے کے آخر میں [9/55] اور ایسے ہی محمد بن اسماعیل عن حفص بن عمر بن الحارث کے ترجمے میں [9/63] یہ مسئلہ صاف کر دیا ہے کہ بلا شک و شبہ امام بخاری، نسائی کے استاذ ہیں، اور حافظ مزی کی بات صحیح نہیں ہے۔ [ملاحظه هو: سيرة البخاري 2/748] ⓱ محمد بن المثنی ⓲ محمد بن بشار ⓳ محمد عبدالاعلی ⓴ یعقوب بن ابراہیم الدورقی [21] ہشام بن عمار [22] ہناد بن السری، خاص طور پر قابل ذکر ہیں۔ تلامذہ: امام نسائی سے علماء اور رواۃ کی ایک بڑی تعداد نے علم حاصل کیا، اور آپ سے احادیث روایت کیں، جن کے بارے میں حافظ ابن حجر کہتے ہیں کہ یہ بے شمار لوگ ہیں۔ [تهذيب التهذيب] امام نسائی علم و دین کی امامت کی شہرت کے ساتھ معمر شیخ الحدیث تھے، اس لیے آپ کے علوم وفنون سے استفادہ کے ساتھ ساتھ طلبہ آپ کے پاس اس واسطے بھی بکثرت آتے تھے تاکہ ان کی سند عالی ہو جائے، اس لیے کہ قتیبہ بن سعید اور ان کے طبقہ سے امام نسائی نے احادیث روایت کی تھیں اور تیسری صدی کے خاتمے اور چوتھی صدی کی ابتداء میں اس سند عالی کا کوئی راوی آپ کے علاوہ نہ پایا جاتا تھا، اس لیے رواۃ نے آپ سے بڑھ چڑھ کر احادیث روایت کیں، مشاہیر رواۃ تلامذہ کا تذکرہ درج ذیل ہے۔ سنن نسائی کے رواۃ: امام نسائی کے تلامذہ میں سے جن لوگوں نے آپ سے سنن کی روایت کی ہے، حافظ ابن حجر نے ان میں سے دس رواۃ کا تذکرہ کیا ہے، جو حسب ذیل ہیں: ➊ عبدالکریم بن احمد بن شعیب النسائی (ت: 344ھ): عبداللہ بن محمد بن اسد جہنی، ایوب بن حسین قاضی ثغر اور خصیب بن عبداللہ نے عبدالکریم سے سنن روایت کی۔ ابن خیر کہتے ہیں: ”ابومحمد بن اسد کے پاس کتاب الطب (دو جزء میں) تھی جس کی روایت میں وہ ابوموسیٰ عبدالکریم بن احمد بن شعیب نسائی سے منفرد تھے۔“ [فهرست ابن خير 113، تهذيب التهذيب 1/37] ابن خیر فہرست میں لکھتے ہیں کہ ابوعلی غسانی کہتے ہیں: ”کتاب المجتبیٰ کی روایت نسائی سے سے ان کے لڑکے عبدالکریم اور ولید بن القاسم الصوفی نے کی ہے۔“ [فهرست ابن خير 116، 117] ➋ ابوبکر احمد بن محمد بن اسحاق ابن السنی الدینوری (ت: 364ھ): حافظ ابن حجر نے ان کو سنن صغری کے رواۃ میں لکھا ہے، لیکن ابن خیر نے اپنی فہرست میں ان کا تذکرہ سنن کے رواۃ میں نہیں کیا ہے، المجتبی یعنی نسائی کی سنن صغریٰ کے یہ راوی ہیں، [سير أعلام النبلاء 16/255] موجودہ سنن صغریٰ کے متد اول نسخے ابن السنی ہی کی سند سے ہیں، واضح رہے کہ تحقیق سے یہ ثابت ہے کہ سنن صغریٰ (المجتبیٰ) کے مؤلف امام نسائی ہی ہیں، ابن السنی صرف اس کے راوی ہیں، بعض لوگوں نے سنن صغریٰ میں ابن السنی کی بعض زیادات اور افادات سے یہ استدلال کیا ہے کہ یہ ابن السنی کی تالیف ہے، جب کہ اہل علم کے یہاں یہ بات معروف و مشہور ہے کہ رواۃ اپنے شیوخ کی کتابوں میں اضافے کرتے رہے ہیں، مثال کے طور پر مسند احمد، اور فضائل صحابہ میں عبداللہ بن احمد اور قطیعی کی زیادات ہیں، اور سنن ابن ماجہ میں راوی کتاب ابوالحسن القطان کی زیادات ہیں۔ ایک قوی دلیل سنن صغریٰ کی نسائی کی تالیف ہونے کی یہ ہے کہ نسائی نے سنن کبریٰ سے انتخاب کے ساتھ ساتھ سنن صغریٰ میں بہت ساری ایسی احادیث ذکر کی ہیں، جو کبریٰ میں نہیں پائی جاتیں۔ ➌ ابوعلی الحسن بن الخضر الاسیوطی (ت: 361ھ): ابوالحسن علی بن محمد بن خلف القابسی اور ابوالقاسم عبدالرحمن بن محمد بن علی ادفوی نے ان سے سنن کی روایت کی۔ [فہرست ابن خیر 112] ➍ حسن بن رشیق ابومحمد العسکری (ت: 370ھ): احمد بن عبدالواحدبن الفضل ابوالبرکات الفراء اور ابوالقاسم حسن بن محمد انباری نے ان سے سنن کی روایت کی۔ ➎ ابوالقاسم حمزہ بن محمد بن علی کنانی مصری الحافظ صاحب مجلس البطاقہ (ت: 357ھ): ان سے سات رواۃ نے سنن کی روایت کی: ابن خیر کہتے ہیں: ابومحمد عبداللہ بن محمد بن اسد جہنی کی حمزہ سے روایت والے نسخے میں چند اسمائے کتب ایسے ہیں جو ابومحمد اصیلی کی روایت میں نہیں ہیں، ان میں سے مناقب الصحابۃ (4/جزء)، کتاب النعوت (1/جزء) کتاب البیعۃ (1/جزء) کتاب ثواب القرآن (1/جزء) کتاب التعبیر (1/جزء) کتاب التفسیر (5/جزء) ہیں، اور ان کتابوں کی قاضی حمزہ سے روایت ابوعبداللہ محمد بن احمد بن یحیی بن مفرج اور ابوالقاسم احمد بن محمد بن یوسف المعافری نے کی ہے، اور یہ دونوں رواۃ محمد بن اسد کے ساتھی ہیں، محمد بن قاسم نے بھی ان کتابوں کی روایت نہیں کی ہے، اور نہ ہی ابوبکر بن الاحمر نے، ہاں ابن قاسم کے پاس کتاب الاستعاذۃ اور فضائل علی بن ابی طالب ان سے مستثنیٰ ہیں۔ ابن خیر مزید کہتے ہیں: اس تصنیف کے علاوہ مجھے ابومحمد بن یربوع کے خط سے کتاب الایمان وکتاب الصلح ملی ہے، کتاب الإیمان بروایت «ابوعلي حسين بن محمد الغساني عن ابي عمر ابن عبدالبر عن أبي القاسم أحمد بن فتح التاجر عن حمزة بن محمد كناني» ہے، اور ابوعلی الغسانی بھی اسے اس سند سے روایت کرتے ہیں: «ابومروان عبدالملك بن زيادة الله التميمي عن أبي إسحاق إبراهيم بن سعيد بن عبدالله الحبال عن أبي الفرج محمد بن عمر الصدفي عن حمزة الكناني فى رجب 354ه قال: حدثنا أبوعبدالرحمن النسائي قرائة بلفظه» [فهرست ابن خير 115] حافظ مزی تحفۃ الأشراف میں ایک سے زیادہ بار کہتے ہیں کہ کتاب المواعظ کی روایت صرف ابوالقاسم حمزہ کنانی نے کی ہے۔ ➏ ابن حیویہ: ابوالحسن محمد بن عبدالکریم بن زکریابن حیویہ نیساپوری مصری(ت: 366ھ): ابوالحسن قابسی فقیہ، ابوالحسن علی بن منیر الخلال اور ابوالحسن علی بن ربیعہ البزار نے ان سے سنن کی روایت کی [فہرست ابن خیر 115] حافظ مزی نے تحفۃ الأشراف میں ابن حیویہ کی روایت پر اعتماد کیا ہے۔ ➐ محمد بن معاویہ بن الاحمر الاندلسی القرطبی (ت: 358ھ): (سنن کبری) کے سماع کے بعد اسے لے کر آپ اندلس گئے، اور لوگوں نے یہ کتاب آپ سے سنی، اس وقت سنن کبریٰ کا مطبوعہ نسخہ ابن الاحمر اور ابن سیار کی روایت سے ہے۔ ابن الاحمرسے سنن کی روایت درج ذیل رواۃ نے کی ہے: ① ابوالولید یونس بن عبداللہ بن مغیث القاضی ② سعید بن محمد ابوعثمان القلاس ③ محمد بن مروان بن زہر ابوبکر الإیادی ④ عبداللہ بن ربیع بن بنوس ابو محمد [فہرست ابن خیر110] ➑ محمد بن قاسم بن محمد بن سیار القرطبی الاندلسی، ابوعبداللہ (ت: 327ھ): ابومحمد عبداللہ بن محمد بن علی الباجی، اور ابوبکرعباس بن اصبغ الحجازی نے ان سے سنن کی روایت کی، ابن خیر کہتے ہیں: محمد بن قاسم اور ابوبکر بن الاحمر کا سماع ایک ہی تھا، محمد بن قاسم کے نسخے میں «فضائل على وخصائصه» اور «كتاب الاستعاذة» تھیں، یہ دونوں کتابیں ابن الأحمر کے نسخے میں نہیں تھیں۔ [فهرست ابن خير111، 112، تهذيب الكمال 1/37] ➒ علی بن ابی جعفر احمد بن محمد بن سلامہ ابوالحسن الطحاوی (ت: 351ھ) [تهذيب التهذيب 1/37] ➓ ابوبکر احمد بن محمد بن المہندس(ت: 385ھ): یہ سب نسائی سے سنن کی روایت کرنے والے حضرات ہیں [تهذيب التهذيب 1/37] ابن المہندس سے ابوعبداللہ محمد بن عبداللہ بن عابد المعافری نے سنن کی روایت کی۔ [فہرست ابن خیر115] سنن نسائی کے ان دس رواۃ کا تذکرہ حافظ ابن حجر نے تہذیب التہذیب میں کیا ہے، لیکن ابوبکر احمد بن محمد بن المہندس کے بارے میں حافظ ذہبی کہتے ہیں: ان کے بارے میں جس نے یہ کہا ہے کہ انہوں نے نسائی سے سنا ہے، اس سے غلطی ہوئی ہے۔ [سیر أعلام النبلاء 462] ⓫ ابوالقاسم مسعود بن علی بن مروان بن الفضل البجّانی: سفر حج کے دوران مصر میں نسائی سے اخذ کیا، اور سنن کی روایت کی۔ [تاريخ ابن الفرضي، رقم الترجمه 2146، اللباب فى الانساب لابن الاثير، ماده: البجاني، والمشتبه للذهبي ص: 51، وتوضيح المشبه لابن ناصرالدين الدمشقي 1/370، 371، و حاشيه تهذيب الكمال 1/333] ⓬ ابوہریرۃ بن ابی العصام: احمد بن عبداللہ بن الحسن بن علی العدوی: عبداللہ بن محمد بن اسد جہنی نے ان سے سنن کی روایت کی۔ [فهرست ابن خير 114] ⓭ ابن ابی التمام: احمد بن محمد بن عثمان بن عبدالوہاب بن عرفہ بن ابی التمام، امام جامع مسجد مصر: ابومحمد أصیلی اور حافظ ابوالقاسم خلف بن القاسم نے ان سے سنن کی روایت کی۔ ابن خیر کہتے ہیں: سنن نسائی کی «کتاب الصلح» کی روایت ابوعلی الغسانی ابو شاکر عبدالواحد بن محمد بن موہب الأصیلی سے کرتے ہیں، اور ابوعلی اسے بسند «ابن عبدالبر عن ابی القاسم خلف بن القاسم» روایت کرتے ہیں، پھر أصیلی اور ابوالقاسم دونوں ابوالحسن ابن عرفۃ عن النسائی اسے روایت کرتے ہیں۔ [فہرست ابن خیر 113] واضح رہے کہ سنن صغریٰ اور کبریٰ دونوں میں «كتاب الصلح» موجود نہیں ہے، حافظ مزی اور حافظ ابن حجر نے بھی اس کی طرف کہیں اشارہ نہیں کیا ہے۔ ⓮ ابوعلی حسن بن بدر بن ابی ہلال: ابوالحسن علی بن محمد بن خلف قابسی نے ان سے سنن روایت کی ہے۔ [فہرست ابن خیر 112] ⓯ ابواحمد حسین بن جعفر بن محمد الزیات: خلف بن قاسم بن سہل الدباغ الحافظ نے ان سے سنن کی روایت کی۔ [فهرست ابن خير 114] ⓰ ابومحمد عبداللہ بن حسن المصری [تحفة الأشراف 11131] ⓱ ابوالطیب محمد بن فضل بن عباس [تحفة الأشراف 5318] ⓲ ابوالحسن علی بن الحسن الجرجانی [تاريخ جرجان 317] ⓳ ولید بن القاسم الصوفی: ابن خیر فہرست میں لکھتے ہیں کہ ابوعلی غسانی کہتے ہیں: کتاب المجتبیٰ کی روایت نسائی سے سے ان کے لڑکے عبدالکریم اور ولید بن القاسم الصوفی نے کی ہے۔ [فہرست ابن خیر 116، 117] مزید بعض مشاہیر تلامذہ درج ذیل ہیں: ➊ ابوالقاسم سلیمان بن احمدطبرانی ➋ ابوعوانہ یعقوب بن اسحاق الاسفرایینی ➌ ابوبشر الدولابی ➍ ابوجعفر محمد بن عمرو العقیلی ➎ احمد بن محمد بن سلامہ ابوجعفر الطحاوی ➏ ابراہیم بن محمد بن صالح ➐ ابوعلی حسین بن محمد نیساپوری ➑ ابواحمد عبداللہ بن عدی الجرجانی ➒ ابوسعید عبدالرحمن بن احمد بن یونس بن عبدالاعلی الصدفی صاحب تاریخ مصر ➓ محمد بن سعد السعدی الباوردی ⓫ ابوعبداللہ محمد بن یعقوب بن یوسف الشیبانی الحافظ المعروف بالاخرم ⓬ منصور بن اسماعیل المصری الفقیہ۔ ⓬ ابوبکر محمد بن احمد بن الحداد الفقیہ۔ مؤخر الذکر ابوبکر بن الحداد ایسے شخص ہیں جنہوں نے امام نسائی کے علاوہ کسی اور سے روایت نہیں کی۔ امام دارقطنی فرماتے ہیں: «كان ابن الحداد كثير الحديث ولم يحدث عن غير النسائي وقال: جعلته حجة بيني وبين الله تعالى» ”ابن الحداد کثیر الحدیث تھے، نسائی کے علاوہ کسی اور سے روایت نہیں کی، کہتے ہیں کہ میں نے نسائی کو اپنے اور اللہ کے درمیان حجت بنایا ہے“۔ [طبقات الشافعيه 2/113، تذكرة الحفاظ2/700، البداية 11/123] حفظ و اتقان: اللہ تعالیٰ نے امام نسائی کو غیر معمولی قوت حفظ سے نوازا تھا، یہاں تک کہ ذہبی نے انہیں امام مسلم سے بڑا حافظ حدیث کہا:۔ ابن یونس مصری: ابن یونس مصری کہتے ہیں: «كان النسائي إماما فى الحديث ثقة ثبتا حافظا» [البدايه 123] ”نسائی امام حدیث، ثقہ، عادل اور حافظ تھے“۔ سبکی: سبکی کہتے ہیں: «سألت شيخنا أبا عبدالله الذهبي الحافظ وسألته أيهما أحفظ مسلم بن الحجاج صاحب الصحيح أو النسائي فقال: النسائي» [طبقات الشافعيه 2/84] ”میں نے اپنے استاذ حافظ ذہبی سے پوچھا کہ صاحب صحیح مسلم بن الحجاج اور نسائی میں سے کون زیادہ حدیث کا حافظ ہے، تو انہوں نے جواب میں کہا: نسائی۔“ حافظ سیوطی: حافظ سیوطی کہتے ہیں: «الحافظ أحد الحفاظ المتقنين» [حسن المحاضرة 1/147] ”نسائی ایک پختہ حافظ حدیث ہیں“۔ ورع و تقویٰ: امام نسائی کی عملی زندگی کا اندازہ محمد بن المظفر کے اس قول سے بخوبی لگایا جا سکتا ہے جسے علامہ ذہبی نے ان الفاظ میں بیان کیا ہے: «سمعت مشايخنا بمصر يصفون اجتهاد النسائي فى العبادة بالليل والنهار وأنه خرج إلى الغزو ومع أمير مصر فوصف فى شهامته وإقامته السنن الماثورة فى فدآء المسلمين واحترازه عن مجالس السلطان الذى خرج معه» [تذكرة الحفاظ، تهذيب الكمال 1/334] ”میں نے مصر میں اپنے شیوخ سے سنا ہے کہ وہ نسائی کے بارے میں کہتے تھے کہ آپ رات دن عبادت میں مشغول رہتے تھے، وہ جنگ میں امیر مصر کے ساتھ نکلے، اور اپنے وقار اور تیزی طبع اور مسلمانوں میں ماثور اور ثابت سنن پر عمل کرنے کرانے میں شہرت حاصل کی، اور نکلے تو سلطان کے ساتھ تھے، لیکن ان کی مجالس سے دور رہتے تھے۔“ ابن الاثیر جامع الاصول میں فرماتے ہیں: امام نسائی کے ورع و تقوی پر اس سے بڑھ کر اور کیا دلیل ہو سکتی ہے کہ اپنے استاذ حارث بن مسکین سے انہوں نے جس حالت میں سماع کیا اس کو اسی انداز «قرأة عليه وأنا أسمع» سے بیان کیا، دیگر مشائخ سے اخذ کردہ روایات کی طرح «حدثنا وأخبرنا» کے الفاظ استعمال نہیں کئے، حارث بن مسکین مصر کے منصب قضاء پر فائز تھے، اور نسائی اور ان کے درمیان دوری تھی جس کی وجہ سے ان کی مجلس درس میں حاضر نہ ہو سکے، تو ایسی جگہ چھپ کر حدیث سنتے کہ حارث ان کو دیکھ نہ سکیں، اسی لیے ورع اور تحری کا راستہ اختیار کر کے ان سے روایت میں «حدثنا» اور «أخبرنا» کے صیغے استعمال نہ کیے۔ یہ بھی کہا گیا ہے کہ حارث بن مسکین بعض سرکاری ذمہ داریوں میں مشغول تھے کہ نسائی ان کے پاس ایک نامانوس لباس میں آئے، لوگ کہتے ہیں کہ آپ لمبا جبہ اور لمبی ٹوپی پہنے ہوئے تھے، جس کو حارث نے ناپسند کیا، ان کو شبہ ہوا کہ شاید یہ آدمی بادشاہ کا جاسوس ہے، کیونکہ ان کے سر پر بڑی ٹوپی اور بدن پر لمبا جبہ تھا، جس کی وجہ سے انہوں نے آپ کو اپنی مجلس میں نہ حاضر ہونے دیا، اس لیے نسائی دروازے پر آ کر بیٹھتے اور حارث پر جو لوگ پڑھا کرتے اسے باہر ہی سے سنتے اسی لیے ان سے روایت کے وقت «حدثنا» اور «أخبرنا» کا صیغہ استعمال نہیں کیا۔ [جامع الاصول 1/128] واضح رہے کہ امام ابوداود نے بھی «قرئ على الحارث بن مسكين» کے صیغے کا استعمال کیا ہے۔ ملاحظہ ہو: کتاب الطب کے آخری ابواب اور کتاب السنہ: «باب ذراري المشركين» ۔ امام المسلمین اورامام الحدیث اہل علم کی طرف سے اعتراف عظمت: اہل علم نے امام نسائی کی ممتاز دینی خدمات، علمی تبحر، تصنیف و تالیف میں شہرت اور مہارت کا اعتراف اس طور پر کیا کہ آپ کو مسلمانوں کے امام اور فن حدیث کے امام کے لقب سے ملقب کیا، اور آ پ کو مسلمانوں کا مقتدیٰ و امام تسلیم کیا، گویا آپ دینی قیادت اور علمی سیادت دونوں وصف کے جامع تھے۔ محمد بن سعد الباوردی: محمد بن سعد الباور دی کہتے ہیں: ”میں نے قاسم مطرز سے ابوعبدالرحمن النسائی کا ذکر کیا، تو انہوں نے کہا: نسائی امام ہیں، یا امامت کے درجے کے مستحق ہیں، یااس طرح کا کوئی جملہ کہا:۔“ [تهذيب الكمال 1/333] امام حاکم: امام حاکم کہتے ہیں کہ میں نے حافظ دارقطنی کو کئی مرتبہ یہ کہتے سنا: «أبو عبدالرحمن مقدم على كل من يذكر بهذا العلم من أهل عصره» ”اپنے قابل شمار معاصر علمائے حديث ميں آپ سب پر مقدم هيں“۔ [معرفة علوم الحديث 83، التقييد 140، تهذيب الكمال 1/334، التذكره، البدايه والنهاية 14/793، والسير 14/131، طبقات الشافعيه] ◈ امام حاکم کہتے ہیں: میں نے ابوعلی حسین بن علی کو کئی بار چار ائمہ اسلام کا نام لیتے سنا، جن میں سب سے پہلے ابوعبدالرحمن نسائی کا نام لیتے۔ [معرفة علوم الحديث82، تهذيب الكمال 1/333] ◈ امام حاکم کی روایت ہے کہ حافظ ابوعلی حسین بن علی فرماتے ہیں: میں نے ابوعبدالرحمن نسائی سے سوال کیا، آپ ائمہ اسلام میں سے ایک امام تھے۔ نیز کہتے ہیں: «هو الإمام فى الحديث بلا مدافعة» ‏‏‏‏ یعنی ”ابوعبدالرحمن نسائی بلا نزاع متفقہ طور پر امام حدیث ہیں۔“ [تهذيب الكمال 1/333، سير أعلام النبلاء 14/131، تاريخ الاسلام، تذكرة الحفاظ 2/699] ◈ امام حاکم ایک دوسری جگہ کہتے ہیں: میں نے ابوعلی حسین بن علی حافظ کو یہ کہتے سنا: ”میں نے اپنے وطن اور اپنے سفر میں چار ائمہ حدیث کو دیکھا، دو نیساپور کے، یعنی محمد بن اسحاق ابن خزیمہ، اور ابراہیم بن ابی طالب، تیسرے ابوعبدالرحمن نسائی مصر میں اور چوتھے عبدان اہواز میں۔“ [تهذيب الكمال 1/333] ◈ حاکم مزید کہتے ہیں: میں نے جعفر بن محمد بن الحارث کو کہتے سنا کہ میں نے حافظ مامون ابوالقاسم (حسین بن محمد بن داود مصری) کو یہ کہتے سنا: ہم فداء (جنگ) والے سال ابوعبدالرحمن نسائی کے ساتھ طرطوس گئے تو وہاں مشائخ اسلام کی ایک جماعت کا اجتماع ہوا، حفاظ حدیث میں سے عبداللہ بن احمد بن حنبل، محمد بن ابراہیم مربی، ابوالاذان (عمر بن ابراہیم) اور (محمد بن صالح بن عبدالرحمن کیلجہ) وغیرہ حاضر ہوئے، سبھوں نے مشورہ کیا کہ شیوخ حدیث کی روایات کا انتخاب ان کے لیے کون کرے تو سب کا ابوعبدالرحمن نسائی پر اتفاق ہوا اور سبھوں نے آپ کی منتخب کردہ احادیث لکھیں۔ [معرفة علوم الحديث 82، تهذيب الكمال 1/333، السير 14/130، الحطة 458] ◈ آگے امام حاکم کہتے ہیں: میں نے حافظ ابوالحسین محمد بن المظفر کو کہتے سنا: ”میں نے مصر میں اپنے شیوخ کو ابوعبدالرحمن نسائی کی امامت اور پیشوائی کا اعتراف کرتے سنا اور یہ کہ رات دن آپ عبادت میں مشغول رہتے تھے، اور برابر حج کرتے تھے، آپ والی مصر کے ساتھ فداء [ جنگ ] کے لیے گئے، تو مسلمانوں میں احیاء سنت اور تیز فہمی کی صفت سے متصف ہوئے گرچہ بادشاہ کے ساتھ نکلے تھے لیکن ان کی مجالس سے دور رہتے تھے، اپنے سفر میں فراوانی کے ساتھ کھاتے پیتے تھے، آپ اسی حال پر تھے کہ دمشق میں خوارج [ نواصب ] کے ہاتھوں جام شہادت نوش کیا۔“ [تهذيب الكمال 1/334، تذكرة الحفاظ 2/700] ◈ حاکم کہتے ہیں: ”میں نے حافظ علی بن عمر دارقطنی کو ایک سے زیادہ بار یہ کہتے سنا: سارے معاصر علمائے حدیث میں ابوعبدالرحمن نسائی سب پر مقدم ہیں۔“ [تهذيب الكمال 1/333] ابوعبدالرحمن محمد بن حسین سلمی: ابوعبدالرحمن محمد بن حسین سلمی صوفی کہتے ہیں: ”میں نے حافظ دارقطنی سے پوچھا: کہ ابن خزیمہ اور نسائی جب کوئی حدیث روایت کریں تو آپ کس کو مقدم رکھیں گے؟ کہا: نسائی کو اس لیے کہ وہ بڑے مسند ہیں، لیکن یہ بات بھی ہے کہ میں نسائی پر کسی کو بھی فوقیت نہیں دیتا گرچہ ابن خزیمہ بے مثال امام اور پختہ عالم ہیں۔“ [تهذيب الكمال 1/333، 334] حمزہ بن یوسف سہمی: حمزہ بن یوسف سہمی کہتے ہیں: ”دارقطنی سے سوال ہوا کہ جب نسائی اور ابن خزیمہ روایت کریں تو کس کی حدیث کو مقدم رکھیں گے؟ جواب دیا کہ نسائی کی احادیث کو اس لیے کہ ان کی کوئی مثال موجود نہیں ہے، میں ان پر کسی کو ترجیح نہیں دوں گا، آپ ورع و تقویٰ میں بے مثال تھے چنانچہ آپ نے ابن لہیعہ سے احادیث روایت نہیں کی جب کہ سند عالی سے قتیبہ کے واسطے سے یہ احادیث ان کے پاس تھیں۔“ [تهذيب الكمال 1/335] ابوطالب احمد بن نصر: ابوطالب احمد بن نصر کہتے ہیں: ”ابوعبدالرحمن نسائی سے زیادہ صبر و تحمل کا مظاہرہ کون کر سکتا ہے، آپ کے پاس ابن لہیعہ سے مروی ہر باب میں احادیث تھیں یعنی «عن قتيبه عن ابن لهيعه» لیکن آپ نے ان احادیث کی روایت نہیں کی، کیوں کہ آپ ابن لہیعہ کی احادیث کی روایت کو جائز نہیں سمجھتے تھے۔“ [تهذيب الكمال 1/335، تذكرة الحفاظ 2/699] ⟐ ابوبکر بن الحداد صاحب علم و فضل و اجتہاد تھے، دارقطنی کہتے ہیں کہ ابن الحداد کثیر الحدیث تھے، لیکن نسائی کے علاوہ کسی اور سے روایت نہیں کی، اور کہا: کہ میں نسائی کی روایت پر راضی ہوں، یہ میرے اور اللہ کے درمیان حجت ہے۔ ابن عدی: ابن عدی کہتے ہیں: میں نے منصور الفقیہ اور احمد بن محمد بن سلامہ طحاوی سے سنا: ابوعبدالرحمن نسائی ائمہ اسلام میں سے ایک امام ہیں۔ [تهذيب الكمال 1/333] الغرض امام موصوف کے فضل و کمال اور دینی قیادت اور علمی سیادت کا اعتراف سارے محدثین اور اصحاب طبقات و تراجم کے یہاں مسلم ہے۔ حافظ ابن کثیر: حافظ ابن کثیر فرماتے ہیں: «وكذلك أثنى عليه غير واحد من الأئمة وشهدوا له بالفضل والتقدم فى هذا الشأن» ‏‏‏‏ ”بہت سارے ائمہ نے نسائی کی تعریف کی ہے، اور علم حدیث میں آپ کی فضلیت وپیشوائی کی شہادت دی ہے۔“ عقیدہ امام نسائی کا عقیدہ: اللہ تعالیٰ نے اپنے دین کی حفاظت کا وعدہ فرمایا ہے، اور مادی اسباب کی دنیا میں گروہ محدثین کو اس بات کی توفیق دی کہ وہ کتاب و سنت کی محبت سے سرشار ہو کر اس کی ممکن خدمت کریں، چنانچہ طلب علم سے لے کر تدوین حدیث کے مختلف مراحل تک کتاب و سنت کو صحیح سندوں کے ساتھ روایت کرنے اور ان کے صحیح معانی و مفاہیم کو محفوظ رکھنے کی جدوجہد میں اس گروہ کو نمایاں مقام حاصل ہے۔ آیت کریمہ: «إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ» کی عملی تفسیر ائمہ اسلام کی حفاظت حدیث کی یہی جدوجہد ہے، جس کے نتیجے میں دینی نصوص صحیح سندوں اور سلف صالحین کی تعبیرات کے ساتھ محفوظ طریقے سے ہم تک پہنچے۔ امام نسائی سلسلہ محدثین کی اہم کڑی ہیں، آپ نے حدیث کی حفاظت و تدوین کے ساتھ ساتھ جرح و تعدیل رواۃ پر بھی بڑا سرمایہ چھوڑا اور فہم حدیث کے سلسلہ میں بھی آپ کی کوششوں سے مسلک سلف ہم تک پہنچا، صحیح اسلامی عقائد کو بھی آپ نے امت تک پہنچایا، اسی وجہ سے سنن نسائی کی افادیت مسلم ہے، اور عقیدہ سلف کی اشاعت اور رد بدعت کی شہرت کی وجہ سے آپ کو امام دین اور امام المسلمین کے لقب سے ملقب کیا گیا، جیسا کہ اوپر کے اقوال میں گزرا، جن محدثین کے ساتھ آپ کی امامت کا ذکر آیا ہے، وہ صرف محدث اور فقیہ ہی نہ تھے، بلکہ وہ عقائد و منہج کے باب میں بھی امام ہدایت، حامی سنت اور ماحی بدعت تھے، اور اصطلاحِ علماء میں آپ «صاحب سنت» کے لقب یافتہ عالم تھے، جس کو علماء نے دین کی امامت سے بھی تعبیر کیا ہے، خلاصہ یہ کہ امام نسائی عقائد کے باب میں بھی امام ہدیٰ تھے، چنانچہ آپ نے اپنے شیوخ کے نقش قدم پر صحیح اور سنی عقائد کا برملا اظہار کیا، اور اپنی کتابوں میں ان مسائل کو جگہ دی۔ مسئلہ خلق قرآن: قرآن اللہ کا کلام ہے، جو حکم اللہ تعالیٰ کی ذات کا ہے وہی اس کی صفات کا ہے، سلف صالحین کے نزدیک اس بارے میں اجماع ہے، عقیدہ سلف کے مخالفین جو قرآن کو مخلوق کہتے ہیں کی اجماعی طور پر سلف نے مذمت کی، بلکہ ان کا یہ فتویٰ مشہور ہے کہ جس نے اللہ کے کلام کو مخلوق کہا وہ کافر ہے۔ اس اہم مسئلہ پر امام نسائی کا فتویٰ بھی موجود ہے، آپ کے ایک شاگر قاضی مصر ابوالقاسم ابوعبداللہ بن ابی العوام السعدی کہتے ہیں: ”ہم سے نسائی نے اور نسائی سے اسحاق بن راہویہ نے بیان کیا کہ محمد بن اعین کا بیان ہے کہ میں نے ابن مبارک سے کہا کہ فلاں آدمی یہ کہتا ہے کہ جس شخص نے اللہ کے قول «إنني أنا الله لا إله إلا أنا فاعبدني» کے بارے میں مخلوق ہونے کا اعتقاد رکھا وہ کافر ہے، تو ابن مبارک نے کہا: اس نے سچ کہا، نسائی کہتے ہیں: میرا بھی یہی مذہب ہے۔“ [تذكرة الحفاظ 2/700] فضائل صحابہ اور مشاجرات صحابہ میں زبان بندی: اسی طرح سے فضائل صحابہ کا اعتراف اور مشاجرات صحابہ کے بارے میں «كف لسان» سلف کا عقیدہ ہے اسی لیے عقائد کی کتابوں کے علاوہ حدیث کی کتابوں میں صحابہ کرام کے مناقب و فضائل کو کثرت سے بیان کیا گیا ہے۔ امام نسائی نے بھی اس باب کو اپنی کتابوں میں جگہ دی، یہی نہیں بلکہ بعض صحابہ کے خلاف موقف رکھنے والے لوگوں کی اصلاح کی طرف عملی اقدام بھی کیا، چنانچہ دمشق پہنچنے پر علی رضی اللہ عنہ سے منحرف لوگوں کو صحیح عقیدہ سمجھانے کے لیے آپ نے «خصائص علي» نامی کتاب لکھی، جس سے وہاں کے منحرفین کے عتاب کا شکار ہوئے، بلکہ زد و کوب اور ایذا رسانی کی شدت نہ برداشت کر سکے، اور اس راہ میں اپنی جان کا نذرانہ پیش کر دیا، اللہ رب العزت آپ کو شہادت کا درجہ عطا فرمائے، آمین۔ شروع ہی سے عقائد کے باب میں انحراف کی روش رکھنے والوں کی کج فکری اور اعتقادی گمراہیوں پر نقد و نظر ائمہ دین کے یہاں بہت معروف و مشہور بات ہے، بلکہ راہ اعتدال سے ہٹ جانے والے حضرات پر تنقید سلف صالحین کا شعار اور منہج رہا ہے، بلکہ ان کے نزدیک عقیدہ اور منہج کے مخالفین کا رد و ابطال ایک اہم اصول رہا ہے، بالخصوص محدثین عظام نے یہ کام بڑی ذمہ داری سے انجام دیا، گمراہ فرقوں اور ان کے ائمہ اور ان کے مقالات و اعتقادات پر کھل کر تنقید کی، سلفی عقائد و اصول اور اتباع سنت کے مضامین کو خوب اچھی طرح سے بیان کیا، خوارج، روافض، نواصب، معتزلہ، جہمیہ، قدریہ، جبریہ وغیرہ، گمراہ فرقوں کے خلاف ائمہ حدیث کے مقدس گروہ نے شروع ہی سے جنگ چھیڑی، معتزلہ اور جہمیہ کے رد کے نام سے مستقل کتابیں لکھیں اور عقائدکی کتابوں میں ان گمراہ عقائد پر کھل کر تنقید کی، امام احمد بن حنبل تو مسئلہ خلق قرآن کے خلاف فتوے پر ڈٹے رہنے کی بنا پر «امام اهل سنت و الجماعت» کے لقب سے مشہور ہوئے، ان کے شاگرد رشید امام بخاری نے «خلق أفعال العباد» نامی مستقل رسالہ لکھا، اور صحیح بخاری میں کتاب العلم، کتاب الإیمان، کتاب التوحید والرد علی الجہمیہ، کتاب الاعتصام بالکتاب والسنہ وغیرہ وغیرہ کتب میں اتباع سنت اور عقیدہ سلف کی خوب خوب وضاحت کی، اور غیر سلفی عقائد اور ان کے حاملین کا رد و ابطال کیا، اور امام احمد کے تلامذہ میں امام ابوداود نے اپنی سنن میں کتاب السنہ کے نام سے یہ خدمت انجام دی۔ اور یہ کام امام ابن ماجہ نے سنن کے مقدمہ میں کیا۔ مسائل ایمان اور ایمان کے گھٹنے اور بڑھنے کا اعتقاد: ائمہ اسلام بالخصوص امام بخاری نے مسائل ایمان بالخصوص اطاعت سے ایمان بڑھنے اور معصیت سے ایمان گھٹنے کے سلفی عقیدہ کو کتاب و سنت اور اجماع کے دلائل سے ثابت کیا، اور اس باب کے سارے منحرفین کا رد و ابطال کیا، امام بخاری کے طرز پر ان کے تلمیذ رشید امام نسائی نے بھی سنن میں باقاعدہ کتاب الإیمان وشرائعہ میں (33) باب کے تحت (498 (5) 5039) (54) احادیث کی تخریج فرمائی، جو سب کی سب صحیح ہیں، اور اس طرح ایمان میں زیادتی اور کمی اور ایمان سے متعلق دوسرے عقائد سلف کی وضاحت فرمائی، ایک نظر ابواب پر ہو جائے جس سے آپ کی مسائل ایمان پر ترجیحات کا اندازہ ہو جائے گا: (1) «ذكر أفضل الأعمال» (2) «طعم الإيمان» (3) «حلاوة الإيمان» (4) «حلاوة الإسلام» (5) «نعت الإسلام» (6) «صفة الإيمان والإسلام» (7) «تأويل قوله عزوجل: * قَالَتِ الأَعْرَابُ آمَنَّا قُل لَّمْ تُؤْمِنُوا وَلَكِن قُولُوا أَسْلَمْنَا» [ الحجرات: 14] (8) «صفة المؤمن» (9) «صفة المسلم» (10) «حسن إسلام المرء» (11) «أي الإسلام أفضل» (12) «أي الإسلام خير» (13) «على كم بني الإسلام» (14) «البيعة على الإسلام» (15) «على ما يقاتل الناس؟» ‏‏‏‏ (16) «ذكر شعب الإيمان» (17) «تفاضل أهل الإيمان» (18) «علامة الإيمان» (19) «علامة المنافق» (20) «قيام رمضان» (21) «قيام ليلة القدر» (22) «الزكاة» (23) «الجهاد» (24) «أداء الخمس» (25) «شهود الجنائز» (26) «باب الحياء» (27) «الدين يسر» (28) «أحب الدين إلى الله» (29) «الفرار بالدين من الفتن» (30) «مثل المنافق» (31) «مثل الذى يقرأ القرآن من مؤمن ومنافق» (32) «علامة المؤمن» امام ترمذی نے سنن صغریٰ میں کتاب العلم، کتاب الإیمان، کتاب القدر اور کتاب صفۃ القیامۃ وغیرہ عناوین میں ان مسائل پر روشنی ڈالی، اگر ائمہ حدیث کی عقائد سلف کی شرح و تفصیل اور منحرفین کے رد و ابطال سے متعلق کتب و رسائل کی محض فہرست ذکر کی جائے تو یہ مقدمہ طویل ہو جائے گا، میں نے امام وکیع بن الجراح کی کتاب الزہد کی تحقیق میں ائمہ دین کی ان کتابوں کا تذکرہ کیا ہے، اس موضوع پر مولانا عبدالسلام محدث مبارکپوری کی سیرۃ البخاری کے ساتویں باب: ”عقائد اور علم کلام“ کا مطالعہ مفید ہو گا۔ سلف صالحین کتاب وسنت کے صحیح دلائل کی روشنی میں عقیدہ کے ہر چھوٹے بڑے مسئلہ کو سمجھتے، اس پر ایمان رکھتے، اس کی دعوت دیتے تھے، اس کے خلاف ہر رائے اور عقیدے کا رد و ابطال کرتے تھے، اور فلاسفہ اور متکلمین کی موشگافیوں کو سخت ناپسند کرتے تھے، اس سلسلے میں امام مالک کے اقوال کافی مشہور ہیں، جن میں سے آپ کا یہ قول عقیدہ سلف کی نمائندگی واضح طور پر کرتا ہے: «الاستواء معلوم والكيف مجهول والإيمان به واجب والسؤال عنه بدعة.» یعنی ”اللہ رب العزت نے قرآن میں جو اپنے بارے میں فرمایا ہے کہ وہ عرش پر مستوی ہے، تو استواء کا معنی و مفہوم معلوم و مشہور بات ہے، لیکن یہ استواء کیسے ہو گا، اس کی کیفیت کا علم نہیں ہے، اس پر ایمان لانا واجب اور فرض ہے، اور اس سلسلے میں سوال و جواب کرنا بدعت ہے“۔ امام مالک نے یہ بات اس وقت کہی جب ایک آدمی نے آپ سے اللہ کے عرش پر مستوی ہونے کی کیفیت کے بارے میں سوال کیا۔ اسی طرح سے امام بخاری کو خلق قرآن کے مسئلہ پر نیساپور میں جب کچھ کہنے کے لیے مجبور کیا گیا تو آپ نے یہ تاریخی جملہ ارشاد فرمایا: «القرآن كلام الله غير مخلوق وأفعال العباد مخلوقة والامتحان بدعة.» یعنی ”قرآن کریم اللہ تعالیٰ کا کلام ہے، مخلوق نہیں ہے، اور بندوں کے افعال مخلوق ہیں، یعنی ان کو اللہ تعالیٰ نے پیدا کیا ہے، اور اس مسئلے پر کسی کو امتحان میں ڈالنا اور اس سے پوچھ گچھ کرنا بدعت ہے“۔ [مقدمۃ فتح الباری: 490] سلف کا منہج عقائد کے بارے میں یہ تھا کہ وہ علم کلام کے مسائل میں زیادہ غور و خوض اور کرید کو سخت ناپسند کرتے تھے، اور ان مسائل میں سوال و جواب کو بدعت کہتے تھے، امام احمد بن حنبل اس باب میں بہت سخت موقف رکھتے تھے، چنانچہ خلق قرآن کے مسئلے میں کتاب و سنت کے علاوہ اور کسی بات کے سننے کے قائل نہ تھے، احادیث رسول سے اس مسلک کی تقویت ہوتی ہے، چنانچہ امام ترمذی نے «كِتَاب الْقَدَرِ، بَاب مَا جَائَ فِي التَّشْدِيدِ فِي الْخَوْضِ فِي الْقَدَرِ» میں نیز امام ابن ماجہ نے اپنی سنن میں یہ حدیث نقل کی ہے: «عَنْ أَبِي هُرَيْرَةَ قَالَ: خَرَجَ عَلَيْنَا رَسُولُ اللهِ وَنَحْنُ نَتَنَازَعُ فِي الْقَدَرِ، فَغَضِبَ حَتَّى احْمَرَّ وَجْهُهُ، حَتَّى كَأَنَّمَا فُقِئَ فِي وَجْنَتَيْهِ الرُّمَّانُ، فَقَالَ: أَبِهَذَا أُمِرْتُمْ أَمْ بِهَذَا أُرْسِلْتُ إِلَيْكُمْ؟ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ حِينَ تَنَازَعُوا فِي هَذَا الأَمْرِ، عَزَمْتُ عَلَيْكُمْ أَلاَّ تَتَنَازَعُوا فِيهِ» ابوہریرہ رضی اللہ عنہ کہتے ہیں: (ایک دن) رسول اللہ صلی اللہ علیہ وسلم ہماری طرف نکلے، اس وقت ہم سب تقدیر کے مسئلہ میں بحث و مباحثہ کر رہے تھے، آپ غصہ ہو گئے یہاں تک کہ آپ کا چہرہ مبارک سرخ ہو گیا اور ایسا نظر آنے لگا گویا آپ کے گالوں پر انار کے دانے نچوڑ دئیے گئے ہوں۔ آپ نے فرمایا: ”کیا تمہیں اسی کا حکم دیا گیا ہے، یا میں اسی واسطے تمہاری طرف نبی بنا کر بھیجا گیا ہوں؟ بے شک تم سے پہلی امتیں ہلاک ہو گئیں جب انہوں نے اس مسئلہ میں بحث و مباحثہ کیا، میں تمہیں قسم دلاتا ہوں کہ اس مسئلہ میں بحث و مباحثہ نہ کرو“۔ تقدیر پر ایمان لانا فرض ہے، یعنی یہ اعتقاد رکھنا کہ بندوں کے اچھے اور برے اعمال کا خالق اللہ تعالیٰ ہے اور ان کا ظہور اللہ کے قضاء و قدر اور اس کے ارادے و مشیئت پر ہے، اور اس کا علم اللہ کو پوری طرح ہے، لیکن ان امور کا صدور خود بندے کے اپنے اختیار سے ہوتا ہے، اللہ تعالیٰ اچھے اعمال کو پسند کرتا ہے، اور برے اعمال کو ناپسند کرتا ہے، اسی اختیار کی بنیاد پر پر انسانوں کو جزا اور سزا دیتا ہے، تقدیر کے مسئلہ میں کتاب و سنت کے دلائل سے اعراض کر کے اور محض اپنی عقل پر اعتماد کرکے بحث و مباحثہ جائز نہیں، کیوں کہ اس کا کوئی فائدہ نہیں بلکہ الٹا گمراہی کا خطرہ ہے۔ اوپر کی گزارشات سے یہ واضح ہو گیا کہ سلف صالحین کے نزدیک باطل عقائد کا رد و ابطال کتاب و سنت کے دلائل اور سلف کے اقوال سے ہوتا ہے، اور یہی صحیح علم کلام ہے، صحابہ کرام کے زمانے میں خوارج، قدریہ اور روافض جیسے فرقوں کا فتنہ موجود تھا، خود صحابہ کرام نے تمام مسائل پر کتاب و سنت کی روشنی میں کلام کیا، محدثین کرام نے اسی اسلوب کو آگے بڑھا کر ہر طرح کے منحرف فرقوں اور ان کے آراء و اقوال کا رد و ابطال کیا، ساتھ ہی غیر سلفی منہج و فکر پر مبنی علم کلام اور اس سے تعلق رکھنے والوں سے خود دور رہے، دوسروں کو ان سے دور رہنے کی تلقین اور وصیت فرمائی تاکہ نہ خود ان کے میل جول سے متاثر ہو کر ان کے باطل افکار و خیالات کا شکار ہوں اور نہ ہی اہل بدعت اہل سنت سے تعلقات استوار کر کے دوسروں کی نظر میں اپنی شبیہ کو اچھی بنائیں، اور اس کے ذریعے افراد امت کو گمراہ کر سکیں۔ سکر اور نبیذ کا مسئلہ: اہل حجاز اور اہل کوفہ کے درمیان نبیذ کے پینے کے بارے میں اور ایسے ہی نشہ آور چیزوں کے قلیل استعمال میں کافی اختلاف رہا ہے، اہل حجاز اور عام محدثین دلائل کی روشنی میں نبیذ پینے کو حرام کہتے ہیں اور اہل کوفہ اسے دیانۃ حلال کہتے ہیں، چونکہ یہ رائے تاویل پر مبنی ہے اس لیے فروعی اختلاف کے باب میں اس کا شمار ہے، ایسے ہی محدثین کے یہاں دلائل کی روشنی میں ہر نشہ آور چیز کی قلیل مقدار حرام ہے، جس کی کثیر مقدار پینے سے آدمی کو نشہ آجاتا ہے، اس مسئلہ پر امام نسائی کی درج ذیل رائے سے خود ان کے اور محدثین کے منہج اور طریقے پر روشنی پڑتی ہے۔ امام نسائی «كتاب الأشربة ميں ماأسكر كثيره فقليله حرام» کی حدیث کی تخریج کے بعد کہتے ہیں: اس میں دلیل ہے کہ نشہ لانے والی چیز حرام ہے، خواہ وہ زیادہ ہو یا کم، اور معاملہ ایسا نہیں ہے جیسا کہ حیلہ کرنے والے اپنے لیے کہتے ہیں کہ ایسے مشروب کا آخری گھونٹ حرام ہوتا ہے اور وہ گھونٹ حلال ہوتے ہیں جو پہلے پیے جا چکے ہیں اور اس سے پہلے رگوں میں سرایت کر چکے ہیں، اس بات میں علماء کے درمیان اختلاف نہیں پایا جاتا کہ پورا نشہ ابتدائی گھونٹوں کے علاوہ صرف آخری گھونٹ سے پیدا نہیں ہوتا۔ (5613)"
}