{
    "book_name": "Sahih Ibn Khuzaymah",
    "urdu_text": "سوانح حیات امام ابن خزیمہ رحمہ اللہ سوانح حیات:​ نام و نسب: محمد نام ابو بکر کنیت، شیخ الاسلام لقب اور نسب نامہ یہ ہے: محمد اسحاق بن خزیمہ بن مغیرہ بن صالح ولادت خاندان وطن: ماہ صفر 223ھ میں نیشاپور میں پیدا ہوئے، محشر بن مزاحم سے ولاء کا تعلق تھا۔ (المنتظم ابن جوزی ج 1 ص 184) اساتذه: شیوخ و اسا تذہ کے نام یہ ہیں: ابوقدامہ سرخسی، ابوکریب، أحمد بن منبع، اسحاق بن موسیٰ سمی، بشر بن معاذ عقدی، عبدالجبار بن علاء، عتبہ بن عبدالله محمدی، علی بن حجر علی بن خشر، محمد بن ابان مستملی، محمد بن اسلم زاہد، محمد بن حرب، محمود بن مہران، محمود بن فیلان، نصر بن علی جہنمی، یونس بن عبد الاعلیٰ۔ اسحاق بن راہویہ اور محمد بن حمید رازی سے بھی ان کو ملاقات اور سماع کا شرف حاصل ہوا، مگر اس وقت کم سن تھے، اس لیے احتیاط کی بنا پر ان بزرگوں سے حدیثیں نہیں بیان کرتے تھے۔ تلامذه: جن لوگوں سے ان کی روایات کا زیادہ حصہ منقول ہے، ان کے نام یہ ہیں: ابوبکر أحمد بن مہران مقری، ابوحامد أحمد بن محمد بن مالویہ، ابوعلی نیشا پوری، ابوعمرو بن حمدان، اسحاق بن سعید نسوی, حمد بن بصیر اور پوتے محمد بن فضل۔ ان کے تلاندہ میں ابراہیم بن ابی طالب اور ابوعمر و أحمد بن مبارک مستملی بھی تھے، جو عمر میں ان سے بڑے تھے۔ رحلت وسفر: علم وفن کی تحصیل اور حدیث وقفہ کی تکمیل کے لیے انہوں نے مختلف مقامات کے سفر کیے، بچپن میں اپنے وطن کے علماء ومشائخ سے استفادہ کیا، اس کے بعد رے، بغداد، بصرہ، کوفہ، شام، حجاز، عراق، مصر اور واسطہ وغیرہ تشریف لے گئے۔ حفظ و ثقاهت: علامه ابن حبان رحمہ اللہ فرماتے ہیں کہ حدیثوں کے اسناد و متون کا ان سے بہتر کوئی حافظ میں نے نہیں دیکھا، ابوأحمد داری نے خود ابن خزیمہ سے ان کے حافظہ کے متعلق سوال کیا تو انہوں نے جواب دیا کہ ”میں جس چیز کو تحریر کرتا ہوں وہ مجھے زبانی یاد ہو جاتی ہے۔“ ابوعلی نیشاپوری رحمہ اللہ فرماتے ہیں کہ جس طرح قرأ کو قرآن کی سورتیں زبانی یاد ہوتی ہیں اسی طرح ابن خزیمہ کو فقہیات حدیث زبانی یاد ہیں، امام دار قطنی رحمہ اللہ وغیرہ نے ان کو ثقہ و ثابت بھی قرار دیا ہے، ابن حبان رحمہ اللہ فرماتے ہیں کہ روئے زمین پر احادیث وسنن کے صحیح الفاظ اور زیادات کی یاد داشت رکھنے والاان کے مانند کوئی اور شخص نہیں، ایسا معلوم ہوتا ہے کہ سنن واحادیث کا تمام ذخیرہ ان کی نگاہوں کے سامنے ہوتا ہے۔ حدیث میں درجه ومرتبه: ابن خزیمہ کا شمار اکابر محدثین اور نامور ائمہ فن میں ہوتا ہے، احادیث پر ان کی نظر نہایت وسیع اور گہری تھی، وہ کم سنی ہی میں امام اور حافظ حدیث کی حیثیت سے مشہور ہو گئے تھے، ایک دفعہ امام شافعی رحمہ اللہ کے نامور شاگرد اور فقہ شافعی کے جامع و مدون امام مزنی سے ایک عراقی شخص نے دریافت کیا کہ جب قرآن مجید نے قتل کی صرف دو ہی صورتیں بیان کی ہیں، عمد و خطا، تو آپ لوگ تیسری شبہ عمد کو کس طرح مانتے ہیں، انہوں نے جوب میں ایک حدیث پیش کی، اس نے کہا: کہ آپ علی بن زید بن جدحان کی روایت سے استدلال کرتے ہیں، یہ سن کر مزنی خاموش ہو گئے اور ابن خزیمہ نے جواب کہ شبہ عمد کی روایتیں دوسرے طرق سے بھی مروی ہیں، عراقی نے کہا: اور کس کے واسطہ سے مروی ہیں، امام ابن خزیمہ نے فرمایا ایوب سختیانی اور خالد جزا سے، اس نے ایک راوی عقبہ بن اولیس کے متعلق شک و تردد کا اظہار کیا تو آپ نے فرمایا کہ وہ ایک بصری شیخ ہیں اور ابن سیرین جیسے جلیل القدر بزرگ نے بھی ان سے روایت کی ہے، معترض نے امام مزنی سے عرض کیا کہ آپ مناظرہ کر رہے ہیں یا یہ؟ انہوں نے فرمایا کہ یہ احادیث کے بارے میں مجھ سے زیادہ واقف کار ہیں، اس لیے جب حدیثوں پر گفتگو ہوتی ہے تو میں خاموش رہتا ہوں اور یہ بحث و مناظرہ میں حصہ لیتے ہیں۔ امام ابن خزیمہ مسائل وفتاوے کا جواب بھی احادیث کی روشنی میں دیتے تھے، امیر اسماعیل بن أحمد نے ایک مرتبہ فے وغنیمت کا فرق دریافت کیا تو انہوں نے سورہ انفال کی آیت: «وَاعْلَمُوا أَنَّمَا مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ» الخَ پڑھنے کے بعد چند حدیثیں بیان کیں، پھر سورہ حشر کی آیت «ما أفاء اللهُ عَلَى رَسُولِه» کے الخ پڑھ کر احادیث سے مسئلہ کی وضاحت کی، ابوزکریا یحیی بن محمد کا بیان ہے کہ اس موقع پر انہوں نے تقریباً 170 حدیثیں بیان کی ہوں گی۔ احادیث سے استنباط مسائل میں ان کو بڑا ملکہ حاصل تھا، ابن سریج کا بیان ہے کہ وہ بڑی چھان بین اور محنت سے احادیث کے نکات و مطالب کا استخراج کرتے تھے۔ حدیث کی نقل و روایت میں ان کے فضل و امتیاز کا اعتراف کرتے ہوئے علامہ ابن جوزی نے لکھا ہے کہ: ”وكان مبرز في علم الحدیث“ یعنی وہ علم حدیث میں بہت ممتاز اور نہایت فاضل تھے۔ (ج ٢ ص ١٨٤) انہوں نے سنن کی اشاعت واحیاء کا مقدس فرض بھی انجام دیا، ایک مرتبہ ان کے ایک پڑوسی نے خواب دیکھا کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے شبیہ مبارک کو صیقل کر رہے ہیں، معبرین نے بتایا کہ ابن خزیمہ احیاء سنت اور اشاعت حدیث کا کام انجام دیں گے۔ فقه واجتهاد: فقہ میں بھی ان کا درجہ نہایت بلند تھا، أبو یعلی اور مزنی جیسے اساتذہ وقت سے اس کی تحصیل کی تھی لیکن فقہ کے عام مذاہب میں سے وہ کسی خاص مذہب سے وابستہ نہیں تھے بلکہ ان کا شمار مجتہدین مطلق میں ہوتا ہے، علامہ ابن سیکی نے ان کو المجمد المطلق اور علامہ ابن کثیر رحمہ اللہ نے {و هو من المجتهدين في دين الاسلام } لکھا ہے، ان کا خود بیان ہے کہ سولہ سال کی عمر کے بعد میں نے کسی کی تقلید نہیں کی۔ ابوزکریایحییٰ بن محمد عنبری فرماتے ہیں کہ میں نے ابن خزیمہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم کے صحیح فرمان کی موجودگی میں کسی شخص کی بات کا اعتبار نہیں کیا جائے گا، و بعض علما کا خیال ہے کہ وہ خود صاحب مذہب اور مستقل امام فقہ کی حیثیت رکھتے تھے اور ان کے فتاوے بھی ایک زمانے میں بعض اسلامی ملکوں میں رائج تھے، ان کے بعض فقہی مسائل کتابوں میں ملتے ہیں مثلاً: وہ رفع یدین کو نماز کا اہم اور ضروری رکن سمجھتے تھے، صف کے پیچھے تنہا نماز پڑھنے والے کے لیے اعادہ لازمی سمجھتے تھے۔ حافظ ابن قیم رحمہ اللہ لکھتے ہیں: ”محمد بن اسحاق امام الائمہ کے لقب سے موسوم کیے جاتے تھے، ان کے متبعین ان کے مذہب کی پیروی کرتے تھے، وہ مقلد کے بجائے خود امام مستقل اور صاحب مذہب تھے، بیہقی نے یحییٰ بن محمد عنبری کے حوالہ سے لکھا ہے کہ اصحاب حدیث کے پانچ طبقے ہیں، (1) مالکہ، (2) شافعیہ، (3) حنبلیہ، (4) راہویہ، اور (5) خریمیه“ کلام وعقائد کے بعض مسائل: بدعات کو سخت نا پسند کرتے تھے اور عام محدثین کی طرح کلام و عقائد کے غیر ضروری مسائل میں بحث و تدقیق احتیاط و تقویٰ کے منافی خیال کرتے تھے، اپنے تلامذہ اور منتسبین کو سخت تاکید کر دی تھی کہ اس قسم کے مسائل میں پڑنے سے پر ہیز کریں، بعض تلامذہ کے متعلق جب ان کو معلوم ہوا کہ وہ ایسے مباحث ان کے حوالہ سے بیان کرتے ہیں تو سخت برہمی ظاہر کی اور اعلان کر دیا کہ یہ لوگ میرے حوالہ سے جو کچھ بیان کرتے ہیں وہ غلط ہے۔ عقائد و کلام سے متعلق انہوں نے جو کتا ہیں لکھی تھیں، ان میں اہل سنت والجماعت کے نقطہ نظر کی ترجمانی کی ہے، بعض مسائل میں عام اہل سنت سے بھی زیادہ متشدد تھے، چند مسائل کے متعلق ان کے آراد خیالات طبقات و تراجم کی کتابوں سے نقل کیے جاتے ہیں۔ قرآن مجید خدا کا کلام ہے، اس کی وحی و تنزیل اور وہ خود غیر مخلوق ہے، وہ خدا کی صفات میں ایک ذاتی صفت اور مستقل بالذات ہے، اس کو مخلوق، محدث اور فعلی صفت سمجھنے والے جہنمی، بدعتی اور گمراہ ہیں، بعض جاہل کہتے کہ اللہ تعالیٰ ٰ مکرر کلام نہیں کرتا، یہ لوگ کلام الہی سے نا آشنا اور اس کی حقیقت سے بے خبر ہیں، اللہ نے کئی مقامات پر تخلیق آدم کا ذکر کیا ہے جو سیدنا موسیٰ علیہ السلام کا قصہ مکرر بیان کیا ہے: «فَبِأَىِ الآءِ رَبِّكُمَا تُكَذِبَانِ»، بار بار کہا: گیا ہے، یہ کسی مسلمان کا عقیدہ نہیں ہوسکتا اور جو شخص یہ اعتقاد رکھے کہ ازل میں کلام کرنے کے بعد اللہ پھر کلام نہیں کرتا وہ جہنمی ہے، اللہ عرش پر بلا کیف مستوی و متممکن ہے۔ ان مسائل میں وہ اتنے متشدد تھے کہ جہمیہ وغیرہ کو کافر بھی کہہ دیتے تھے، فرماتے ہیں: اللہ ازل سے متکلم ہے، جو شخص یہ گمان کرے کہ اللہ ایک ہی بار کلام کرتا ہے وہ کافر ہے، اسی طرح جو اس کا اقرار نہ کرے کہ اللہ عرش پر ساتویں آسمان کے اوپر متمکن ہے وہ کافر ہے، اس کا خون مباح اور مال حلال ہے، قرآن کو کلام الہی کے بجائے مخلوق سمجھنے والا کا فر ہے، اس سے توبہ کرائی جائے گی اگر توبہ نہ کرے تو قتل کر دیا جائے گا، اور وہ مسلمان کے قبرستان میں دفن نہیں کیا جائے گا، جہمیہ اور کلامیہ ملعون اور اپنے عقائد و خیالات میں جھوٹے ہیں۔ فضل وکمال کا اعتراف: ان کے معاصرین علما اور ارباب کمال ان کے علم و کمال کے معترف تھے، امام دار قطنی نے ان کو عدیم النظیر اور علامہ ذہبی نے فرید العصر اور ابن کثیر رحمہ اللہ نے بحر امن بحور اعلم لکھا ہے، ابوعلی نیشا پوری فرماتے ہیں کہ ابن خزیمہ نے ہم سے جتنا استفادہ کیا، ہم نے اس سے زیادہ ان سے استفادہ کیا علامہ ابن سبکی ان کی جامعیت وفضیلت کا ذکر کرتے ہوئے لکھتے ہیں: ”وہ مختلف علم کے جامع اور مرتبہ کمال پر فائز تھے، نیشا پور میں جو علم وفن کا گہوارہ اور فضلا وارباب کمال کا مرکز تھا، یکتائے روزگار تھے، ان کی علمی شان سب سے بالا و برتر تھی، ان کے گرد طلبا و مستفیدین کا ہجوم رہتا تھا، ان کے مادے تمام روئے زمین میں نقل ہوتے تھے، عقل وفطانت میں بے مثال تھے، بحث مناظرہ میں انہیں زیر نہیں کیا جا سکتا تھا، در حقیقت علم وفضل کا ایسا بحرز خار تھے جس سے تشنگان علوم سیراب ہوتے تھے، ان کی اس علمی ضیا باری سے ایک عالم کو بصیرت حاصل ہوتی تھی، علما واساطین فن بھی ان کی جانب رجوع کرتے تھے، ان کے فیض کا یہ حال تھا۔“ «كالبحر يقذف للقريب جواهرا كرما ويبعث لـلـغـريب صحائبا» ”یعنی ابن خزیمہ سمندر کی طرح اپنے قریب کے لوگوں کو موتی اور جواہرات سے مالا مال کرتے ہیں اور دور والوں کے لیے باران رحمت کی طرح سامان فیض کرتے ہیں۔“ اتباع سنت: اتباع سنت میں بڑا اہتمام تھا، چھوٹی چھوٹی باتوں میں بھی وہ سنت کا لحاظ رکھتے تھے، ایک مرتبہ ان سے حمام میں بال منڈانے کے لیے کہا: گیا، تو فرمایا کہ میرے نزدیک رسول اللہ صلی اللہ علیہ وسلم کا حمام میں داخل ہو کر بال منڈانا ثابت نہیں ہے، ابوعمرو بن اسماعیل کا بیان ہے کہ میں ابن خزیمہ کے درس میں شریک ہوتا تھا اور وہ اکثر معمولی کاموں میں مدد لیا کرتے تھے، ایک دفعہ میرا داہنا ہاتھ روشنائی سے سیاہ ہو گیا تھا، اس لیے میں نے ان کو بائیں ہاتھ سے قلم دینا چاہا تو انہوں نے نہیں لیا، میرے رفقاء نے داہنے ہاتھ سے قلم دینے کے لیے کہا:، جب میں نے واپنے ہاتھ سے دیا تو انہوں نے لے لیا۔ بزرگی و کرامت: وہ صاحب کرامت بھی تھے، لوگ ان کی ذات کو نہایت با برکت خیال کرتے تھے، ابوعثمان زاہد کا بیان ہے کہ اللہ تعالٰی اہل نیشا پور کے مصائب و آلام ابن خزیمہ کی برکت سے دفع کر دے گا۔ محمد بن ہارون طبری روایت کرتے ہیں کہ وہ اور محمد بن نصر مروزی، محمد بن علویہ وزان اور محمد بن اسحاق بن خزیمہ چاروں آدمی تحصیل علم و سماع حدیث کے لیے ربیع بن سلمان کے پاس گئے، وہاں ہم لوگوں کا ساز و سامان ختم ہو گیا، جب تین دن اور تین رات تک فاقہ کرنا پڑا تو ہم نے آپس میں کہا: ایسی حالت میں تو ہمارے لیے سوال کرنا جائز ہے لیکن ہر شخص سوال کرنے میں عار محسوس کرتا تھا، اس لیے قرعہ اندازی کی گئی، اتفاق سے قرعہ ابن خزیمہ کے نام نکلا، انہوں نے کہا: پہلے مجھے دور رکعت استخارہ کی نماز پڑھ لینے دو، ابھی وہ نماز پڑھ ہی رہے تھے کہ کسی نے دروازہ کھٹکھایا، دروازہ کھولا گیا تو امیر مصر أحمد بن طولون کا خادم اجازت لے کر اندر داخل ہوا اور سلام کر کے بیٹھ گیا، پھر ایک پرزہ نکال کر پوچھا: کہ محمد بن نصر کون صاحب ہیں؟ ہم لوگوں نے ان کی طرف اشارہ کر دیا، اس نے پچاس ہزار کی ایک تھیلی دی اور کہا: امیر نے سلام عرض کیا ہے اور آپ کے اخراجات کے لیے یہ رقم پیش کی ہے، ختم ہونے کے بعد مزید رقم پیش کی جائے گی، اسی طرح ہم چاروں کو تھیلیاں دے کر یہی پیغام پہنچایا، ہم لوگوں نے اس سے کہا:، پہلے اس واقعہ کا سبب بتاؤ ورنہ ہم یہ تھیلیاں نہیں قبول کریں گے، اس نے کہا: آج دو پہر میں امیر قلولیہ کر رہے تھے کہ انہوں نے خواب میں دیکھا کہ ایک شخص کہہ رہا ہے کہ کل اللہ تعالٰی کے یہاں حاضر ہو کر کیا جواب دو گے جب وہ تم سے ان چاروں علماء کے متعلق سوال کرے گا جو تین روز سے بھوکے ہیں، اس خواب سے امیر گھبرا کر اٹھ بیٹھے اور آپ لوگوں کا نام لکھوا کر یہ تھیلیاں بھیجیں، میں اسی وقت سے آپ لوگوں کی تلاش میں تھا، اب جا کر آپ لوگ ملے ہیں۔“ قناعت: زندگی بڑی ساده و درویشانہ اور تکلیف و آرائش سے بالکل پاک تھی، ایک معمولی رقم میں گذر بسر کر لیتے تھے، پہننے کے لیے ہمیشہ ایک ہی قمیص ہوتی تھی، جب دوسری قمیص بنواتے تو پرانی کسی ضرورت مند کو دے دیتے تھے، لوگ درخواست کرتے کہ کچھ زیادہ کپڑے بنوا لیجئے، فرماتے کہ مجھے اپنے نفس کے آرام و راحت کا کوئی خیال نہیں۔ سخاوت: بڑے فیاض اور مہمان نواز تھے، ان کے پوتے محمد بن فضل کا بیان ہے کہ میرے دادا بخل سے نا آشنا اور مال پس انداز نہیں کرتے تھے، ان کا کل مال و دولت اہل علم اور ضرورت مندوں کے لیے وقف تھا، ایک مرتبہ بڑی پر تکلف دعوت کی، مختلف قسم کے لذیذ کھانوں اور حلوے، میوے اور فواکہ سے دستر خوان آراستہ تھا، امراء واعیان کے ساتھ اہل علم اور فقہا ومحد ثین بھی مدعو تھے، ہر شخص نے شکم سیر ہو کر کھایا، لوگوں کا بیان ہے کہ ایسی شاندار دعوت اور اس کا اہتمام صرف سلطان ہی کر سکتا تھا۔ صاف گوئی: ان کے اخلاقی اوصاف میں سب سے نمایاں وصف صاف گوئی ہے، امر او اعیان دولت کے سامنے بھی وہ اس میں بپاک نہ کرتے تھے، ایک دفعہ امیر اسماعیل بن أحمد نے اپنے والد کے واسطہ سے ایک حدیث بیان کی جس کی سند میں ان کو وہم ہو گیا تھا، ابن خزیمہ بھی وہاں موجود تھے، انہوں نے فورا اس کی تصحیح کی جب واپس ہوئے تو قاضی ابوذر نے بتایا کہ ہم لوگ بیس سال سے یہ غلط روایات سنتے تھے مگر تصحیح کی جرأت نہ ہوتی تھی، ابن خزیمہ نے کہا: میں رسول اللہ صلی اللہ علیہ وسلم کی احادیث میں خطا و تحریف جان کر خاموش رہنا گوارہ نہیں کر سکتا۔ امامت وشهرت: اللہ تعالیٰ ٰ نے ان کو بڑی مرجعیت اور شہرت عطا فرمائی تھی، امام الائمہ ان کے نام کا جز بن گیا تھا، اسنوی کا بیان ہے کہ وہ اپنے زمانہ میں خراسان کے امام تھے، امام دارقطنی رحمہ اللہ نے ان کو اور ابن حاتم نے امام و مقتدا کہا: ہے، مقبولیت کا یہ حال تھا کہ ان سے استفادہ کرنے کے لیے علما و طلبہ کا ہجوم لگا رہتا تھا، بڑے بڑے ارباب کمال دور دراز سے مشقتیں برداشت کر کے استفادہ کے لیے آپ کی خدمت میں حاضر ہوتے اور مستفیدین کے قافلے ہر وقت خیمہ زن رہتے تھے، امراء اور ار باب حشمت بھی ان کے اعزاز و اکرام کو ملحوظ رکھتے تھے، پہلی مرتبہ جب امیر اسماعیل بن أحمد سے آپ کی ملاقات ہوئی تو اس نے نا واقفیت کی وجہ سے شایان شان التفات نہیں کیا، بعد میں جب اس کو معلوم ہوا کہ یہ ابن خزیمہ ہیں تو اس نے بڑی معذرت اور شرمندگی کا اظہار کیا اور نہایت گرمجوشی کے ساتھ ملا۔ وفات: ذی قعدہ 311 ھ کو داعی اجل کو لبیک کہا:، اور اپنے گھر کے ایک کمرہ میں دفن کیے گئے، بعد میں پورا گھر مقبرہ میں تبدیل ہو گیا تھا، علامہ ابن جوزی نے 8 ذ وقعدہ اور ابواسحاق شیرازی نے 212 ھ سنہ وفات بتایا ہے، ایک شاعر کے مرثیہ کے دو شعر یہ ہیں: «يَابنَ إِسْحَاقَ قَدْ مَضَيْتَ حَدِيدًا قفى قَبْرَكَ السَّحَابُ الهَمُّون مَا تَوَلَّيْتَ لَا بَلِ الْعِلْمُ وَلى مَا دَفَنَاكَ بَلْ هُوَ المَدْعُون» ۔ ترجمہ: ”اے ابن الحق آپ کی زندگی نہایت ناقابل ستائش تھی، آپ کی قبر کو ہمیشہ برسنے والے بادل سیراب کرتے رہیں، آپ دنیا سے رخصت نہیں بلکہ علم رخصت ہو گیا، ہم نے آپ کے بجائے علم کو دفن کیا ہے۔“ تصنيفات: ابن خزیمہ نامور مصنف بھی تھے، ان کی تصنیفات کی تعداد حاکم نے 140 سے زیادہ بتائی ہے، انکے علاوہ ان کے مسائل کا مجموعہ بھی سو جزوں کے بقدر تھا، ابن کثیر کا بیان ہے: ”فكتب الكثير وصنف وجمع“ یعنی بے شمار کتابیں تصنیف کیں، ابن خزیمہ تصنیف شروع کرنے سے قبل استخارہ کی نماز پڑھتے تھے، اگر استخارہ نکل آتا تھا تب تصنیف کی ابتداء کرتے تھے، جن کتابوں کے نام معلوم ہو سکے ہیں وہ حسب ذیل ہیں۔ فقہ حدیث بریرہ: یہ تین جزوں پر مشتمل ہے، اس میں ایک حدیث کی فقاہت کے پہلوؤں پر روشنی ڈالی ہے۔ كتاب التوحيد والصفات: یہ بڑی اہم اور مشہور کتاب ہے اور کئی اجزا پر مشتمل ہے، اس کا موضوع کلام و عقا ئدہ ہے، امام رازی اس کو کتاب الاشراک کے نام سے موسوم کرتے تھے، یورپ کے بعض کتب خانوں میں اس کے نسخے پائے جاتے ہیں، ابونعیم نے المستخرج على التوحيد لکھی تھی۔ صحیح ابن خزیمه: یہ علامہ ابن خزیمہ کی سب سے اہم کتاب ہے، اس کا شمار حدیث کی اہم اور معتبر کتابوں میں ہوتا ہے، مستند مصنفین اور ثقہ علما اس کی حدیثوں سے اخذ و استناد کرتے ہیں، کتب صحاح کے علاوہ محدثین نے اپنی کتابوں میں صحت کا زیادہ التزام کیا ہے، ان کے مجموعے صحیح کہلاتے ہیں، شاہ عبدالحق صاحب فرماتے ہیں: جن دیگر علمانے صحاح کے مجموعے لکھے ان میں ابن خزیمہ کی صحیح بعض حیثیتوں سے زیادہ مشہور ہے اس کی اہمیت کا اندازہ ابن کثیر کے اس بیان سے بھی ہوتا ہے: ”من انفع الكتب واجلها۔‏‏‏‏“ یعنی صحیح ابن خزیمہ نہایت مفید اور اہم کتابوں میں ہے، علامہ سیوطی نے بخاری و مسلم کے بعد جن کتابوں کو زیادہ معتبر بتایا ہے، ان میں کتب صحاح کے ساتھ اس کا بھی ذکر کیا ہے، وہ یہ بھی لکھتے ہیں کہ صحیح ابن خزیمہ کا پایہ صحیح ابن حبان سے زیادہ ہے، کیونکہ ابن خزیمہ نے صحت کی جانب زیادہ توجہ کی ہے، وہ ادنی شبہہ پر بھی توقف سے کام لیتے ہیں، چنانچہ اکثر ”ان صح الخبر وان ثبت“ وغیرہ قسم کے الفاظ لکھتے ہیں، یہ صحت میں صحیح مسلم کے قریب قریب ہے، اس کے نسخے یورپ کے بعض کتب خانوں اور جرمنی میں موجود ہیں، حافظ ابن حجر رحمہ اللہ نے صحیح ابن خزیمہ پر مفید حواشی بھی لکھے تھے۔"
}