{
    "book_name": "Silsila Sahih",
    "urdu_text": "نام : ناصر الدین البانی نام: ناصرالدین البانی۔ نسب نامہ: محمدناصرالدین البانی بن نوح بن آدم بن نجاتی البانی ۔ ولادت: شیخ ناصرالدین البانی کی ولادت 1914ءنمطابق 1332ھ میں البانیہ کےدارالسلطنت’’اشقودرہ،،میں ہوئی۔ ان کےوالدنےالبانیہ میں اپنی عافیت کی بدحالی کےخوف سےشام کی طرف ہجرت کی اوردمشق کواپنامسکن بنایا۔کیونکہ البانیہ میں مغربیت کی ترویج ہونےلگی تھی۔ تعلیم وتربیت : شیخ ناصرالدین البانی نےاپنی ابتدائی تعلیم دمشق کےمدرسہ’’مدرسہ الاسعا ف الخبریہ الابتدایہ میں شروع کی۔دوران تعلیم مدرسہ میں آگ لگ جانےکی وجہ سے آپ سوق سروجہ کےایک دوسرے مدرسہ میں منتقل ہوگئے۔ چونکہ ان کےوالددینی اعتبارسےدینی تعلیم کےمروجہ نظام سےمطمئن نہ تھے لہذا انہوں نےشیخ کی مدرسہ کی تعلیم کی عدم تکمیل کافیصلہ کیااورخودان کےلیےایک تعلیمی پروگرام وضع کیاجوبنیادی طورپرتعلیم قرآن ،تجوید،صرف اورفقہ حنفی پرمرکوزتھا۔ شیخ نےبعض علماء دینیہ کی اورعربی کی تعلیم اپنےوالد کےبعض رفقاء (جن کاشماراس وقت کےشیوخ میں ہوتاتھا)سےبھی حاصل کی۔ان شیوخ میں سےشیخ سعیدبریانی سےآپ نے’’مراقی الفلاح ،،اورعلوم بلاغت کی کتابیں پڑھیں۔آپ نےاپنے زمانہ میں صلب کےمشہورمؤرخ علامہ شیخ راغب طباخ سےان کی جمع مرویات کی ’’اجازہ فی الحدیث،، حاصل کی تھی۔شیخ ناصرالدین البانی 20سال کی عمرمیں مجلۃ المنارمیں شائع ہونےوالی علمی بحوث سےمتاثرہوکرعلم حدیث کی طرف متوجہ ہوئے۔ اس کےبعدپھرعلم وعمل کی سیڑھیاں چڑھتےچلےگئےاوراس مقام پرپہنچےجس پربڑی محنت وکاوش کےبعد کوئی ایک پہچاہےآپ نےحدیث کی بہت خدمت کی۔ درس وتدریس: فراغت کےبعد جب مدینہ منورہ میں الجامعہ الاسلامیہ (مدینہ منورہ)کی تاسیس ہوئی توچانسلرمدینہ یونیورسٹی اورمفتی عام برائے سعودی عرب شیخ علامہ محمدابراہیم آل شیخ نےحدیث اورفقہ الحدیث کوجامعہ میں پڑھانے کےلیے علامہ البانی کومقررکیا۔یہاں آپ 3سال تک فریضہ تدریس سرانجام دیتےرہے۔شیخ جامعہ اسلامیہ مدینہ یونیورسٹی سےفارغ ہوکردمشق پہنچےاورپھرمکتبہ اظاہریہ میں خودکوقیمتی تالیفات اورنفع بخش  مؤلفات کےلیے وقف کردیاتھا۔ شیخ کاہفتہ واری علمی پروگرام بھی ہواکرتاتھا جس میں یونیورسٹیوں کےاجل اساتذہ تک حاضرہواکرتےتھےان پروگراموں میں شیخ نےدرج ذیل کتابوں کادرس دیا۔ 1۔الروضة القدية۔۔۔۔۔ صدیق حسن خان ۔ 2۔منهاج السلام فی الحکم ۔۔۔۔۔۔ محمداسد۔ 3۔اصول فقہ۔۔۔۔۔ عبدالوہاب کےخلاف۔ 4۔مصطلع التاریخ ۔۔۔۔۔۔ اسدرستم۔ 5۔فقہ السنہ ۔۔۔۔ سیدسابق.6۔ الحلال والحرام ۔۔۔ یوسف قرضاوی۔ ‎7۔الترغیب والترهیب ۔۔۔ حافظ منذری. 8۔فتح المجید شرح کتاب التوحید۔۔۔۔۔ عبدالرحمن بن حسن۔ 9۔الباحث الحشیب شرح اختصارعلوم الحدیث ۔۔۔۔ احمدشاکر۔ 10۔ریاض الصالحین۔۔۔۔۔۔ امام نووی۔ 11۔الامام فی احادیث الاحکام ۔۔۔۔۔ ابن دقیق العید۔ 12۔الادب المفرد۔۔۔۔۔ امام بخاری۔ 13۔اقتضاء الصراط المستقیم ۔۔۔۔ ابن تیمیہ۔ تصنیفات وتالیفات: شیخ  ایک برق رفتارمؤلف تھے آپ کی مطبوعہ مؤلفات کی تعداد ایک سوبیس(120)سےمتجاوزہے۔ شیخ  کی کتابوں کےمختلف زبانوں میں تراجم بھی ہوچکےہیں۔بےشمارکتابوں میں سےشیخ کی چندایک مشہورکتابوں کےنام درج ذیل ہیں۔ 1۔سلسله احادیث صحیحه 2۔سلسله احادیث ضعیفه والموضوعه۔ 3۔صحیح الترهیب والترهیب 4۔صحیح سنن ابی داؤد  5۔صحیح الادب المفرد 6۔صحیح ابن ماجہ  7۔احکام الجنائز 8۔تحذیر الساجدمن اتخازالقبورالمساجد 9۔حجاب المراة المسلمة فی الکتاب والسنة 10۔ضعیف سنن ابی داؤد  11۔ضعیف  ابن ماجہ  12۔ضعیف الترهیب  والترهیب  13۔معجم حدیث النبوی ﷺ۔ 14۔حجیت حدیث 15۔حلال وحرام وسیلہ  16۔بدعات کاانسائیکلوپیڈیا 17۔توحید سب سےپہلےاےداعیان اسلام۔ 18۔نماز نبوی احادیث صحیحہ کی روشنی میں ۔ اس کےعلاوہ بھی شیخ کی بےشمارکتابیں ہیں۔ تلامذہ: شیخ البانی  کےذات سےبےشمارلوگوں نےفیض حاصل کیا آپ کےتلامذہ کی شمار ممکن نہیں ہے لیکن چیدایک مشہورتلامذہ کےنام درج ذیل ہیں۔ 1۔شیخ حمدی عبدالمجید السلفی جومعروف محقق اورصاحب تحقیقات ومؤلفات وتخریجات علمیہ کثیرہ ہیں 37سےزائدکتب آپ کی مساعی جمیلہ کاثمرہ ہیں۔ 2۔شیخ عبدالرحمن بن عبدالخالق  جومعروف مؤلف ہیں۔مختلف موضوعات پر24سےزائدکتب تحریرفرکائی ہیں۔ 3۔ڈاکٹرعمرسلیمان الاشقر 18سےزائدکتابوں کےمؤلف ہیں۔ 4۔شیخ خیرالدین وائلی 9سےزائدوقیع کتابوں کےمؤلف ہیں۔ 5۔شیخ محمدعبیدعباسی شیخ کےخادم ونمایاں تلامذہ میں آپ کاشمارہوتا ہے۔ 6۔شیخ محمدابراہیم شقرہ 6 سے زائد نافع مؤلف آپ کی کاوشوں کاثمرہ ہیں۔ 7۔شیخ محمدبن جمیل زینو 10 سےزائدکتابیں لکھی ہیں۔ 8۔شیخ مقبل بن یادی الوداعی10 سےزائدمفیدکتابوں کےمؤلف ہیں۔ 9۔شیخ زہیرالشاویش 19 سےزائدکتب آپ کی مساعی کانتیجہ ہیں۔ ان کےعلاوہ بہت سےمشاہیر علماء کرام جودین کی خدمت میں پیہم مصروف کار ہیں شیخ  کی ذات سےکسب فیض حاصل کرنےوالوں میں شامل ہیں۔ شخصیت اور گراں قدر خدمات: شیخ محمد ناصر الدین البانی رحمہ اللہ کو ان کے علمی مشاغل نے کبھی اتنی مہلت نہ دی کہ وہ خود اپنی سوانح لکھ پاتے، البتہ ان کے بعض تلامذہ (مثلاً شیخ مجذوب، شیخ علی خشان اور شیخ محمد عید عباسی وغیرہ م) نے ”موجزة عن حیاة الشیخ ناصر الدین“ کے عنوان سے آپ کا ترجمہ لکھا ہے، ان کے علاوہ شیخ محمد بن ابراہیم شیبانی نے ”حیاة الألباني و آثارہ و ثناء العلماء علیه“ نامی ترجمہ لکھا جو 929 صفحات پر محیط ہے اور 1407ھ میں الدار السلفیہ (کویت) سے شائع ہو چکا ہے۔ یہاں یہ واضح کرنا بھی ضروری محسوس ہوتا ہے کہ محدث جلیل رحمہ الله کی پیش نظر سوانح حیات (جسے محدثین کی اصطلاح میں ترجمہ کہتے ہیں) کوئی بدعت نہیں ہے بلکہ شیوخ کبار کے تراجم، ان کے مناقب و آثار کو جمع کرنا سلف و صالحین اور محدثین کی عادت رہی ہے چنانچہ ہم دیکھتے ہیں کہ امام ابن جوزی رحمہ الله نے ”مشیخۃ“ میں، امام ذہبی رحمہ الله نے اپنے ”تاریخ“ میں (امام احمد رحمہ الله کا ترجمہ)، امام ابن کثیر رحمہ الله نے ”البدایة والنهایة“ میں، بزار رحمہ الله نے ”الأعلام العلیة في مناقب شیخ الإسلام ابن تیمیة“ میں، ابن ناصر دمشقی رحمہ الله نے ”الردّ الوافر في الانتصار لشیخ الإسلام“ اور ”الردّ علی العلاء البخاري في إفراء اته وأضالیله“ میں، ابن قیم رحمہ الله نے (شیخ الاسلام ابن تیمیہ رحمہ الله کا ترجمہ) اور سیوطی رحمہ الله و سخاوی و غیرہما نے امام نووی رحمہ الله وغیرہ کے تراجم مرتب کئے ہیں۔ اس سوانحی خاکہ میں راقم نے کوشش کی ہے کہ محدث رحمہ الله شام کے حالات زندگی کے تمام گوشے قدرے تفصیل سے بیان کئے جائیں تاکہ آپ کی زندگی، آپ کی جدوجہد، آپ کا انہماک، آپ کی جستجو، سنت نبوی سے آپ کی محبت اور اس راہ میں آنے والے مصائب پر آپ کا صبر موجود ہ اور آنے والی نسلوں کے لئے، اسوہ و مثال بلکہ انمول نمونہ اور مشعل راہ بن سکے۔ (مرتب) شیخ الالبانی رحمہ الله کی شخصیت کسی تعارف کی محتاج نہیں ہے، آپ کی زندگی ایک کھلی کتاب کی مانند ہے۔ آپ اپنی دینی خدمات، بےنظیر تالیفات، مقالات، تحقیقات، تخریجات اور دروس کی بنا پر عالم اسلام کے گوشہ گوشہ میں معروف ہیں۔ آپ کو حدیث نبوی، رجال اور اسانید پر مکمل عبور حاصل تھا۔ آپ نے جس انداز پر دین کی بے لوث خدمات انجام دی ہے وہ لائق تحسین ہے۔ ماضی قریب میں علم حدیث کے فنون میں آپ کا کوئی ہمسر اور ثانی نظر نہیں آتا۔ حق گوئی، راست بازی اور بےباکی آپ کا امتیازی وصف تھا۔ حکو مت اور اشخاص کی خوشامد اور چاپلوسی سے آپ کو شدید نفرت تھی یہی وجہ ہے کہ حسن اخلاق کے اس عظیم پیکر کو اپنے وطن مالوف اور دوسری جگہوں کو اِحقاقِ حق اور اِبطالِ باطل کے لئے خیر باد کہنا پڑا۔ محدث موصوف جہاں بھی جاتے وہاں کے بعض مخصوص ذہنیت اور عقیدے کے حامل افراد آپ سے خوفزدہ ہو جاتے اور سینکڑوں کتابوں کے اس مصنف و محقق کو اپنی راہ کا کانٹا تصور کرتے تھے۔ آپ کے محاضرات و بیانات، خطابات و ملاقات اور کیسٹوں پر سخت پہر ہ بٹھانے کے باوجود بھی آپ اپنے دعوتی مشن میں ہمہ وقت و ہمہ تن مصروف عمل رہے۔ «جزاه الله احسن الجزاء» مولد، مسکن اور ہجرت: شیخ محمد ناصر الدین رحمہ الله کی ولادت 1914ء میں الالبانیہ کے دارالسلطنت ”اشقودرہ“ میں ہوئی تھی۔ آپ کا گھرانہ غریب ہونے کے باوجود ایک متدین اور علمی گھرانہ تھا۔ آپ کے والد الحاج نوح نجاتی الالبانی ایک حنفی عالم تھے اور دولت عثمانیہ کے دارالسلطنت استانہ (موجودہ استنبول) کو چھوڑ کر اپنے وطن مالوف لوٹ گئے تھے تاکہ وہاں دین کی خدمت کر سکیں اور اپنے دروس و تقاریر سے وہاں کے لوگوں کو دین کی تعلیم دے سکیں۔ جلد ہی وہ وہاں مرجع خلائق بن گئے تھے۔ لیکن جب ملک احمد زوغو نے البانیہ کا اقتدار سنبھالا تو پورے وطن پر بےدین لوگ قابض ہو گئے تھے، رفتہ رفتہ مغربیت کی ترویج ہونے لگی، نتیجتاً البانیہ کی خواتین نے حجاب اتار پھینکا اور مردوں نے بھی یورپی لباس (پتلون وغیرہ) اختیار کر لی۔ جن لوگوں کو اپنا دین عزیز تھا اور وہ اپنی عاقبت کی بدحالی سے خوفزدہ تھے انہوں نے وہاں سے ہجرت کرنا شروع کر دی۔ شیخ رحمہ الله کے والد نے یہ محسوس کیا کہ وہاں کے حالات رفتہ رفتہ اور بھی بدتر ہو جائیں گے اس لئے انہوں نے اپنی اولاد کو اس فتنہ مغربیت و الحاد سے محفوظ رکھنے کی خاطر ملک شام کی طرف ہجرت کی اور دمشق کو اپنا مسکن بنایا۔ تعلیم و تربیت: شیخ محمد ناصر الدین رحمہ الله نے اپنی ابتدائی تعلیم دمشق کے مدرسة ”الأسعاف الخیریة الابتدائیة“ میں شروع کی۔ دوران تعلیم مدرسہ میں آگ لگ جانے کے باعث آپ سوقِ ساروجہ کے ایک دوسرے مدرسہ میں منتقل ہو گئے تھے۔ چونکہ آپ کے والد دینی اعتبار سے دینی تعلیم کے مروّجہ نظام سے مطمئن نہ تھے لہٰذا انہوں نے شیخ رحمہ الله کی مدرسہ میں تعلیم کی عدم تکمیل کا فیصلہ کیا اور خود ان کے لئے ایک تعلیمی پروگرام وضع کیا جو بنیادی طور پر تعلیم قرآن، تجوید، صرف اور فقہ حنفی پر مرکوز تھا۔ شیخ نے بعض علوم دینیہ اور عربی کی تعلیم اپنے والد کے بعض رفقا (جن کاشمار اس وقت کے شیوخ میں ہوتا تھا) سے بھی حاصل کی۔ ان شیوخ میں سے شیخ سعید برہانی سے آپ نے ”مراقی الفلاح“ اور علوم بلاغت کی بعض جدید کتب پڑھی تھیں۔ آپ نے اپنے زمانہ میں حلب کے مشہور مؤرخ علامہ شیخ راغب طباخ رحمہ الله سے ان کی جمیع مرویات کی ”اجازۃ فی الحدیث“ حاصل کی تھی۔ استاذ محمد المبارک شیخ کو علامہ راغب طباخ کے پاس لے کر گئے تھے اور ان سے شیخ رحمہ الله کے علوم حدیث میں ذوق و شوق اور مہارت کو بیان کیا تھا جس پر علامہ راغب رحمہ الله نے آپ کا امتحان لیا اور انہیں ویسا ہی پایا جیسا کہ استاذ محمد المبارک رحمہ الله نے بیان کیا تھا۔ چنانچہ علامہ راغب رحمہ الله نے تقدیراً و اعترافاً اپنی کتاب ”الأنوار الجلیة في مختصر الأثبات الحلبیة“ پر اپنی مہر کے ساتھ اپنے مشائخ کی اجازۃ ثبت کر کے اپنی جانب سے بھی انہیں اجازۃ سے سرفراز فرمایا۔ علم حدیث کی طرف آپ کی توجہ اور اس کا اہتمام: شیخ محمد ناصر الدین رحمہ الله بیس سال کی عمر میں ”مجلّۃ المنار“ میں شائع ہونے والی بحوث سے متاثر ہو کر علم حدیث کی طرف متوجہ ہوئے تھے۔ یہ مجلہ شیخ محمد رشید رضا کی زیر ادارت شائع ہوتا تھا۔ شیخ محمد مجذوب اپنی کتاب ”علماء و مفکّرون“ میں شیخ رحمہ الله سے نقل کرتے ہیں ”… شیخ رحمہ الله سید رشید رضا کو ان لوگوں میں سب سے زیادہ پراثر شخص سمجھتے ہیں جنہوں نے انہیں حدیث شریف کی تعلیم کی طرف متوجہ کیا تھا۔“ سید رشید رضا کے ساتھ شیخ رحمہ الله کے اس علمی تعلق کو بیان کرنے کے بعد شیخ مجذوب آپ سے روایت کرتے ہوئے مزید لکھتے ہیں: ”میں پہلے عربی قصص، مثلاً ”ظہر و عنترۃ“ اور ”الملک سیف“ وغیرہ کے مطالعہ کا شوقین تھا، پھر پولینڈ کے ترجمہ شدہ قصے مثلاً ”کارین لوبین“ وغیرہ میری توجہ کا مرکز بنے۔ پھر میں تاریخی واقعات کے مطالعہ کے طرف مائل ہوا۔ اسی دوران میں نے ایک دن اپنے سامنے ”مجلہ المنار“ کا ایک شمارہ دیکھا۔ اس میں میں نے سید رشید رضا کی قلم سے تحریر شدہ ایک بحث دیکھی جس میں انہوں نے امام غزالی کی کتاب الإحیاء کے اَوصاف، محاسن اور مآخذ کی طرف اشارہ کیا تھا۔ پہلی مرتبہ ایسی کوئی علمی تنقید میری نظر سے گزری تھی جس نے مجھ میں وہ پورا شمارہ پڑھنے کا جذبہ پیدا کیا۔ پھر میں نے چاہا کہ اس موضوع پر مزید چھان بین کی جائے، چنانچہ حافظ عراقی کی تخریج الاحیاء دیکھی مگر اس کو خریدنے کی استطاعت نہ رکھنے کے باعث اس کو کرایہ پر لے لیا۔ جب میں اس کتاب کو پڑھا تو اس دقیق تخریج نے مجھے اس بات پر ابھارا کہ اس کو نقل کر لوں۔ میں نے اس کے لئے کافی جدوجہد کی۔ اس طرح مجھے ان معلومات کو ٹھیک طریقہ پر جمع کرنے کا سلیقہ آ گیا۔ میں سمجھتا ہوں کہ اس کام میں جو جدوجہد میں نے کی، اس نے میری ہمت افزائی کی اور اس راہ میں آگے قدم بڑھانا میرے لئے پسندیدہ اور مرغوب امر بن گیا۔ نصوص کو سمجھنے اور ان کی تخریج کے لئے میں نے لغت، بلاغت اور غریب الحدیث کی بعض مؤلفات سے بھی مدد لی تھی۔“ شیخ رحمہ اللہ اپنے متعلق خود بیان کرتے ہیں کہ ” بے شک اللہ تعالیٰ نے مجھے بےشمار نعمتوں سے نوازا ہے مگر ان میں سے دو نعمتیں میرے نزدیک بہت اہم ہیں۔ پہلی، ملک شام کی طرف میرے والد کی ہجرت کیونکہ اگر ہم البانیہ ہی میں رہتے تو عربی نہ سیکھتے جبکہ کتاب اللہ و سنت رسول اللہ صلی اللہ علیہ وسلم کو سیکھنے و سمجھنے کے لئے عربی زبان کے سوا کوئی دوسرا ذریعہ نہیں ہے۔ اور دوسری نعمت: میرے والد کا مجھے گھڑیوں کی مرمت کرنے کا ہنر سکھانا ہے …… اوائل شباب میں میں نے یہ ہنر سیکھا تھا لیکن ساتھ ہی ہر دن میں علم حدیث کو بھی سیکھنے کے لئے وقت نکالتا تھا۔ منگل اور جمعہ کے سوا میں ہر دن تین گھنٹے گھڑیوں کی مرمت کرتا اور اس کے ذریعہ اپنے اور اہل و عیال کے لئے ضروریات زندگی کماتا تھا۔ باقی وقت میں سے ہر دن چھ سے آٹھ گھنٹے طلب علم، تالیف، کتب حدیث، بالخصوص المکتبۃ الظاھریۃ میں موجود مخطوطات کے مطالعہ میں گزارتا تھا۔ جب ظہر، مغرب اور عشاء وغیرہ کی نماز کا وقت ہوتا تو مکتبہ ہی میں موجود مسلمان کے ساتھ نماز پڑھ لیتا تھا۔“ محدث رحمہ اللہ مزید فرماتے ہیں کہ: ”حدیث پر میرا پہلا کام کتاب”المغني عن حمل الأسفار فى الأسفار فى تخريج مافى الإحياء من الأخبار ازحافظ عراقی“ کا نقل کرنا اور اس پر تعلیقات لکھنا تھا۔ اس کے لئے میں نے ایک پروگرام وضع کیا تھا، مثلاً الإحياء میں ایک حدیث یوں لکھی ہوئی تھی: «إن العبد لينشر له من الثناء مابين المشرق والمغرب وما يزن عند الله جناح بعوضة» حافظ عراقی رحمہ الله نے اس پر تعقباً لکھا ہے: «وقد نقلته منه ولكني لم أجده هٰكذا، وفي الصحيحين من حديث أبى هريرة: إنه ليأتي الرجل السمين العظيم يوم القيمة لا يزن عند الله جناح بعوضة» میں نے یہ کیا کہ ”صحیحین“ کی اس حدیث کو مکمل کیا اور اضافہ کو اصل کتاب سے نقل کیا۔ اس دن سے حدیث میرے مطالعہ کا عنوان بن گئی۔ جو چیزیں میرے لئے غور و فکر کا مرکز ہوتیں انہیں میں قوسین کے مابین لکھ لیا کرتا تھا۔ جب میں پہلی جلد کا نصف حصہ مکمل کر چکا تو ایک مرتبہ میں نے محسوس کیا کہ احادیث کے اپنے اس عمل کے دوران مجھے بہت سے ایسے الفاظ سے سابقہ پڑا ہے جن کے متعلق مجھے تفقہ حاصل نہ تھا۔ بعض اوقات تو پوری حدیث کا معنی و مراد ہی میرے لئے واضح نہ ہوتی تھی۔ میں نے سوچا کہ کیوں نہ میں ان تمام الفاظ کی شرح بھی حاشیہ پر درج کر لوں تاکہ وہ میرے لئے مذکرہ (یاد داشت) بن جائے اور فہم حدیث میں معاون ہو۔ چنانچہ از سر نو میں نے کتاب شروع کی اور جس مغلق کلمہ پر میرا گزر ہوتا، اس کو میں غریب الحدیث لابن اثیر اور قاموس کی مدد سے حل کرتا اور حاشیہ پر اس کا معنی لکھ لیتا تھا یہاں تک کہ میرے لئے یہ معاملہ آسان ہو گیا اور اس طرح متن سے زیادہ تعلیق کی ضخامت ہو گئی۔ اس طرح یہ کتاب مکمل ہوئی۔ یہ وہ چیز تھی جس نے مجھے سب سے زیادہ نفع پہنچایا۔“ علم حدیث میں شیخ رحمہ اللہ کی یہ جدوجہد ان کے لئے خیر کبیر کے راستے کھولنے کاسبب بنی اور اس فن میں ان کا اقبال بڑھا۔ سنت کے مطالعہ میں ان کے انہماک اور شدید شغف کو دیکھ کر ان کے والد خوفزدہ ہوتے اور ان سے کہا کرتے تھے: «علم الحديث صنعة المفاليس» ”علم حدیث تو مفلس لوگوں کا فن ہے۔“ مگر انہوں نے پرواہ نہ کی۔ چونکہ شیخ رحمہ اللہ اپنے والدین اور بھائی بہنوں کے ساتھ رہتے تھے جو ماشاء اللہ ایک بڑا خاندان تھا لہٰذا اکثر جن کتابوں کی انہیں ضرورت ہوتی تھی اور وہ ان کے والد کے ذاتی کتب خانہ میں موجود نہ ہوتی تھیں (جو کہ بیشتر مسلک حنفی کی کتب پر ہی مشتمل تھا) شیخ انہیں خریدنے کی استطاعت بھی نہیں رکھتے تھے، لہٰذا آپ انہیں مکتبہ ظاہریہ میں تلاش کرتے تھے۔ المکتبۃ الظاھریۃ آپ کے لئے ایک نعمت کبریٰ سے کسی طرح کم نہ تھاکیونکہ جن کتابوں کو آپ خرید نہ پاتے تھے ان میں سے اکثر مکتبہ میں مل جاتی تھیں اور آپ کی ضرورت پوری کرتی تھیں۔ کبھی کبھی بعض تجارتی کتب خانے بھی آپ کی اس طرح مدد کر دیتے تھے کہ آپ کو مطلوبہ کتب بطور استعارہ، غیر محدود مدت تک بلا اجرت دے دیتے تھے۔ جب ان کتب کا کوئی خریدار دوکان پر آتا تو وہ شیخ سے کتاب واپس منگوا لیتے۔ ان مالکان کتب خانہ میں دمشق کے سید سلیم القصیباتی او ران کے فرزند عزت نیز المکتبۃ العربیۃ الھاشمیۃ کے اصحاب احمد، حمدی اور توفیق کے اسمائے گرامی قابل ذکر ہیں، «فجز اهم الله» کچھ عرصہ کے بعد شیخ رحمہ اللہ المکتبۃ الظاھریۃ میں بارہ بارہ گھنٹے رہنے لگے۔ اس دوران سوائے اوقات نماز کے آپ کا تمام تر وقت کتب حدیث کے مطالعہ، تحقیق اور تعلیق میں گزرتا تھا۔ اکثر اوقات آپ تھوڑا بہت کھانا مکتبہ ہی میں تناول فرمایا کرتے تھے۔ آپ کا یہ انہماک دیکھ کر المکتبۃ الظاھریۃ کی انتظامیہ نے آپ کے لئے ایک کمرہ مخصوص کر دیا تھا۔ جس میں آپ کی اَبحاث کے لئے ضروری اُمہاتِ مصادر کو فراہم کر دیا گیا تھا۔ ملازمین مکتبہ سے قبل آپ صبح سویرے ہی اپنے اس مخصوص کمرہ میں آ جاتے تھے اور بیشتر اوقات عشاء کی نماز پڑھ کر ہی وہاں سے گھر جایا کرتے تھے۔ بہت سے ملاقاتی مطالعہ اور تالیف میں آپ کے انہماک کے پیش نظر مکتبہ ہی میں آپ سے ملنے جایا کرتے تھے۔ آپ طبیعتاً خوشامدی یا پرمجاملت کلمات سے پرہیز کرتے تھے اور اسے ضیاع وقت کا سبب سمجھتے تھے۔ جب کوئی شخص آپ سے کوئی سوال پوچھتا تو آپ کتاب پر سے نظر ہٹائے بغیر ہی اس کا مختصر سا جواب دے دیا کرتے تھے۔ استاذ محمدالصباغ کے بقول: ”آپ کی آنکھ بیک وقت کتاب اور سائل دونوں پر ہواکرتی تھی۔“ دعوۃ فی سبیل اللہ کی ابتدا: آپ نے اپنی دعوت الی اللہ کے ابتداء مسلک حنفی پر علمی تنقید سے شروع کی۔ آپ کے والد بہت سے مسلکی مسائل میں آپ کے مخالف ہوتے تو آپ ان پر یہی واضح کرتے کہ جب کسی مسلمان پر کسی بارے میں کوئی حدیث ثابت ہو جائے تو اس کے لئے ہرگز یہ جائز نہیں ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی حدیث پر عمل کو ترک کرے اور یہ کہ یہی منہج امام ابوحنیفہ وغیرہ ائمہ کرام رحمہم اللہ کا بھی تھا۔ [ملاحظه هو صفة صلاة النبى صلى الله عليه وسلم ] استاذ مجذوب، شیخ رحمہ اللہ سے روایت کرتے ہیں کہ: ”میں نے اپنی دعوت کی ابتدا متعارفین، دوستوں اور ان کے دوستوں کے ساتھ میل ملاقات سے کی۔ پہلے ہم لوگ ایک جگہ جمع ہوتے تھے، پھر ایک دوسرے معاون کے گھر اس اجتماع کو منتقل کر دیا گیا۔ پھر اس سے بھی بڑی ایک دوسری جگہ منتخب کی گئی۔ پھر اس مقصد کے لئے ایک منزل کرایہ پر لی گئی تاکہ بکثرت لوگ اس میں شریک ہو سکیں، پھر یہ جگہ بھی تنگ پڑنے لگی…“ اس طرح شیخ رحمہ اللہ نے مشائخ اور مساجد کے ائمہ کے ساتھ علمی مباحثہ کا سلسلہ شروع کیا۔ بعض اوقات متعصّب مسلکی علماء، مشائخ صوفیہ اور خرافاتی بدعتی لوگوں سے شدید معارضہ درپیش ہوتا تھا، لیکن ان کے پاس سوائے شور و غوغا کرنے اور شیخ رحمہ اللہ کو ”گمراہ وہابی“ کا طعنہ دینے کے کوئی ٹھوس دلیل نہ ہوتی تھی۔ دمشق کے نامور علماء میں سے علامہ بہجت البیطار، شیخ عبدالفتاح الامام، شیخ حامد التقی اور شیخ توفیق البرزہ وغیرہم رحمہم اللہ نے شیخ ناصر الدین رحمہ اللہ کی ہمت افزائی کی اور ثابت قدم رہنے کی تلقین بھی کی۔ شیخ رحمہ اللہ لوگوں کے بےجا الزامات اور مخالفین کی پرواہ نہ کرتے ہوئے منہج حق پر ڈٹے رہے اور اپنے نفس کو صبر و تحمل کے ساتھ سورہ لقمان کی آیت نمبر «﴿وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنْكَرِ وَاصْبِرْ عَلَى مَا أَصَابَكَ﴾» ۔۔۔ سورة لقمان میں مذکور وصیت سے مطمئن اور آمادہ برعمل کرتے رہے۔ دمشق کے بہت سے مشائخ کے ساتھ توحید، مسلکی تعصب اور بدعات کے موضوعات پر آپ کے بےشمار علمی مباحثی ہوئے۔ اسی سلسلہ میں آپ نے بعض شہروں مثلاً حلب، اللاذقیہ، ادلب، سلمیہ، حمص، حماۃ اور الرقہ وغیرہ کا دورہ بھی کیا اور وہاں بھی علمی مناقشات کئے۔ حاسدین کامعاملہ اس حد تک پہنچا کہ انہوں نے حکام کے پاس شیخ کے خلاف جھوٹی گواہیاں دیں جس کے باعث آپ رحمہ اللہ کو دوبار اسیر زنداں بنناپڑا۔ ایک بار آپ نے ایک ماہ جیل کی صعوبتیں برداشت کیں اور دوسری بار غالباً 1967ء میں تقریباً چھ ماہ سنت یوسفی ادا کرتے رہے مگر راہ حق سے اس جبل عزیمت کے قدم کبھی نہیں ڈگمگائے … نتیجتاً آپ کی دعوت الی الکتاب والسنہ ملک شام کی حدود سے نکل کر اُردن او ر لبنان بھی جا پہنچی۔ ان دعوتی اَسفار کے علاوہ شیخ رحمہ اللہ ہر ماہ حلب کا سفر بھی کیا کرتے تھے تاکہ وہاں کے مکتبۃ الأوقاف الاسلامیۃ کے مخطوطات سے مستفید ہو سکیں۔ اس مکتبہ میں آپ طویل گھڑیاں گزار اکرتے تھے۔ ”الزوائد للبوصیری“ آپ نے اسی مکتبہ کے مخطوطات سے نقل کی تھی۔ مجالس علمیہ کا اہتمام: شیخ رحمہ اللہ نے ایک ہفتہ وار مجلس علمی کا پروگرام وضع کیا تھا۔ ان مجالس میں طالبان علم اور مختلف جامعات کے اساتذہ شرکت کرتے تھے اور وہاں پڑھی جانے والی علمی کتب کے دروس سے مستفید ہوتے تھے۔ یہ کتب الروضۃ الندیۃ نواب صدیق حسن خاں، منہاج الاسلام فی الحکم محمد اسد، اصول الفقہ عبد الوہاب خلاف، مصطلح التاریخ اَسد رستم، فقہ السنۃ سید سابق، الحلال والحرام یوسف قرضاوی، الترغیب والترہیب حافظ منذری، فتح المجید شرح کتاب التوحید عبد الرحمن بن حسن آلِ شیخ، الباعث الحثیث شرح اختصار علوم الحدیث احمد شاکر، ریاض الصالحین نووی، الإلمام فی احادیث الأحکام ابن دقیق العید اور الأدب المفرد امام بخاری رحمہ اللہ وغیرہ تھیں۔ شیخ رحمہ اللہ خواتین کو بھی صحیح احادیث اور ان پر اپنی تعلیقات کے منتخب حصص کا درس دیا کرتے تھے۔ شیخ کے شاگرد استاذ محمد عید عباسی اپنی کتاب ”بدعۃ التعصّب المذھبی“ میں لکھتے ہیں کہ ”شیخ رحمہ اللہ ان دروس کے علاوہ دمشق میں اپنے تلامذہ کو مندرجہ ذیل فقہی کتب کا درس بھی دیاکرتے تھے۔“ کتاب اقتضاء الصراط المستقیم از شیخ الاسلام ابن تیمیہ، فقہ السنۃ ازسید سابق، منھاج السنۃ فی الحکم از محمد اسد اور الروضۃ الندیۃ فی شرح الدرر البہیۃ ازعلامہ محمد صدیق حسن خاں بھوپالی مزید فرماتے ہیں کہ ” ہمارے شیخ ہر علمی بحث کی محققانہ شرح بیان فرماتے اور کسی بھی مسئلہ کو خواہ چھوٹا ہو یا بڑا بلاوضاحت نہ چھوڑتے تھے … الخ“ مدینہ یونیورسٹی میں شیخ کی تقرری اور وہاں کے تعلیمی نظام پر آپ کے اثرات: استاذ عید عباسی اور علی خشان، شیخ رحمہ اللہ کے ترجمہ میں لکھتے ہیں: ”اللہ تعالیٰ کی توفیق اور اس جہد متواصل کے نتیجہ میں حدیث، فقہ اور عقائد وغیرہ کے موضوعات پر شیخ رحمہ اللہ کی بیشتر نفع بخش مؤلفات معرضِ وجود میں آئیں جو اہل علم و فضل کے نزدیک شیخ سے محبت کا باعث بنیں۔ ان مؤلفات میں فہم صحیح، حدیث، اس کے علوم، اس کے رجال وغیرہ کی درایت فائقہ اور صائب علمی منہج وغیرہ سب کچھ موجود تھا۔ ان کتب میں ہر چیز کے لئے صرف کتاب و سنت کو ہی حکم اور میزان و معیار بنایا گیا تھا۔ ان کے علاوہ سلف صالح کے فہم اور ان کے طریقہ ٔ تفقہ واستنباطِ احکام سے ہدایت و رہنمائی بھی حاصل کی گئی تھی… “ جب مدینہ منورہ میں الجامعۃ الاسلامیۃ (مدینہ یونیورسٹی) کی تاسیس ہوئی تو چانسلر مدینہ یونیورسٹی اور مفتی ٔ عام برائے سعودی عرب شیخ علامہ محمد بن ابراہیم آل الشیخ نے حدیث، علوم الحدیث اور فقہ الحدیث کو جامعہ میں پڑھانے کے لئے شیخ موصوف کو ہی منتخب کیا۔ یہاں آپ تین سال (یعنی 1381ھ سے 1383ھ کے اختتام تک) استاذِ حدیث رہے۔ اس دوران جامعہ میں آپ جہد و اخلاص کی مثال بنے رہے حتیٰ کہ دروس کے دوران ہونے والے وقفہ میں آپ طلباء کے ساتھ ریت پر بٹھ جایا کرتے اور وہاں بھی علمی مباحث کا سلسلہ شروع کر دیتے تھے۔ جبکہ اس وقفہ کے دوران دوسرے اساتذہ اپنے اپنے کمروں میں جا کر چائے اور ناشتہ وغیرہ میں مصروف ہو جاتے تھے۔ جب بعض اساتذہ اور طلباء ان کے پاس ریت پر سے گزرتے تو یہ پکار اٹھتے تھے: «”هذاهوا الدرس الحقيقي وليس الذى خرجت منه أوالذي سنعود إليه“» ”حقیقی درس تو یہ ہے، نہ کہ وہ جس سے ابھی ہم نکلے ہیں یا اس کی طرف لوٹیں گے۔“ آپ کے اس اخلاص اور آپ کے ساتھ طلباء کے غیر معمولی تعلق خاطر، محبت اور جامعہ کے اندر و باہر آپ کی شفقت کہ جس سے آپ کے معاصر اساتذہ محروم تھے، نے بعض لوگوں کے دلوں میں حسد کا بیج بو دیا… چنانچہ اساتذہ میں سے بعض حاسدین نے جامعہ کے مسئولین کو ان کے خلاف ابھارنا شروع کیا، پھر انہی حاسدین نے افتراءات، بہتان اور جھوٹی شہادتوں کا سہارا لیا، یہاں تک کہ جامعہ کی انتظامیہ نے ان کی خدمات کے اختتام کا فیصلہ کیا اور آپ ایک سچے مؤمن کی طرح اللہ تعالیٰ کے فیصلے پر راضی ہو گئے۔ البتہ جب شیخ رحمہ اللہ اپنے متعلق افتراءات اور تہمتوں کو سنتے تھے تو یہی کہتے تھے: «”حسبنا الله و نعم الوكيل“» آپ کے متعلق شیخ عبدالعزیز بن عبداللہ بن باز رحمہ اللہ کے یہ کلمات قابل ذکر ہیں: «”حينماكنت تقوم بواجب الدعوة لافرق عندك، و ذلك لمعرفته بقوة إيمانه بالله العظيم وعلمه الواسع و صبره على البلاء…الخ“» ”جب آپ فریضہ دعوت کی ادائیگی میں مشغول ہوتے تو کسی میں فرق روانہ رکھتے۔ یہ اللہ پر آپ کی ایمانی قوت، وسیع تر علم اور مشقتوں پر خصوصی صبر کا کرشمہ تھا۔“ شیخ رحمہ اللہ نے الجامعۃ الاسلامیۃ (مدینہ منورہ یونیورسٹی) میں علم حدیث کی تعلیم کا ایک منہج طرز تعلیم وضع کیا تھا جس میں علم الاسناد کو خاص اہمیت دی گئی تھی۔ شیخ تیسرے سال کے طلباء کے لئے صحیح مسلم سے ایک حدیث منتخب فرماتے اور دوسرے سال کے آخر میں طلباء کے لئے سنن ابی داود سے ایک حدیث مع سند بورڈ پر لکھ دیتے تھے اور پھر کتب رجال، مثلاً الخلاصۃ اور التقریب وغیرہ لا کر ان احادیث کی تخریج اور نقد رجال کے طریقہ وغیرہ کی عملی پریکٹس کرواتے تھے۔ پس یہ کہا جا سکتا ہے کہ فقط الجامعۃ الاسلامیۃ ہی میں نہیں بلکہ عالم عرب کی تمام اسلامی یونیورسٹیوں میں علم الاسناد کی تعلیم کی روایت پہلی بار شیخ ہی نے شروع کی تھی۔ جامعہ سے آپ کے رخصت ہو جانے کے بعد ڈاکٹر محمد امین مصری رحمہ الله (چیئرمین شعبہ حدیث) نے اس علمی روایت کو جامعہ میں جاری رکھا۔ اس کے بعد رفتہ رفتہ آپ کی جاری کردہ یہ سنت عالم اسلامی کی تمام جامعات میں رائج ہو گئی۔ الجامعۃ السلفیۃ (بنارس) میں آمد کی پیشکش سے شیخ کی معذرت الجامعۃ الاسلامیۃ سے سبکدوشی کے بعد جامعہ سلفیہ بنارس کے سر پرست مولانا عبیداللہ رحمانی مبارکپوری رحمہ اللہ (صاحب مرعاۃ المفاتیح شرح مشکوٰۃ المصابیح) نے شیخ رحمہ اللہ کو بنارس میں بحیثیت استاذِ حدیث تشریف لانے کی دعوت دی جسے شیخ رحمہ اللہ نے بوجوہ قبول نہ کیا اور معذرت کر لی۔ جب شیخ رحمہ اللہ الجامعۃ الاسلامیۃ سے فارغ ہو کر دمشق واپس پہنچے تو آپ نے گھڑیوں کی مرمت کرنے والی اپنی دوکان اپنے بھائی منیر رحمہ الله اور ان کی وفات کے بعد ان کے فرزند عبداللطیف کو دیدی تھی اور اپنے آپ کو مکمل طور پر فارغ کر کے المکتبۃ الظاھریۃ میں قیمتی تالیفات اور نفع بخش مؤلفات کے لئے وقف کر دیا تھا۔ شام، عمان، بیروت کی طرف ہجرتیں: شیخ کی شام سے عمان پھر واپس شام پھر بیروت پھر امارت اور پھر عمان کی طرف ہجرتیں ابتلاء اللہ تعالیٰ کی سنتوں میں سے ایک سنت ہے جو اللہ تعالیٰ ہر مؤمن بندہ پر جاری فرماتا ہے حتیٰ کہ اس سنت ِالٰہی کے تحت رسول صلوات اللہ و سلامہ علیہم بھی مختلف النوع ابتلاء ات سے دو چار کئے گئے۔ متعدد بار یہ سنت شیخ رحمہ اللہ پر بھی جاری ہوئی۔ اپنی ہجرتوں کے متعلق عزیمت کے یہ پیکر خود فرماتے ہیں: ”پہلی بار میں نے اپنے نفس اور اپنے اہل و عیال کے ساتھ ماہ رمضان 1400ھ میں دمشق سے عمان کی طرف ہجرت کی اور وہاں اس امید پر مکان بنوانا شروع کیا کہ باقی زندگی یہیں گزاروں گا۔ اللہ تعالیٰ نے اپنے فضل و انعام سے میرے لئے یہ مرحلہ آسان فرما دیا۔ تعمیر کے سلسلہ میں بہت زیادہ بھاگ دوڑ اور بیماری کے بعد مکان کی طرف سے مجھے قدرے سکون میسر ہوا۔ لیکن میرا ذاتی کتب خانہ دمشق ہی میں چھوٹ گیا تھا۔ عمان لے جانے میں درپیش دشواریوں کے باعث اس کتب خانہ کی منتقلی ممکن نہ ہوئی تھی، لیکن ہر دن مجھے بارش سے اس کے خراب ہو جانے کا خدشہ لاحق رہتا تھا۔ بہرحال جب اردن کے بعض بھائیوں نے محسوس کیا کہ میں گھر میں فارغ بیٹھا ہوں تو ان لوگوں نے مجھ سے دروس کا مطالبہ شروع کر دیا۔ ان لوگوں نے ماضی میں عمان کی طرف ہجرت سے قبل میرے دروس سنے تھے کیونکہ میں ہر ماہ یا ہر دوسرے ماہ وہاں جاتا اور ایک دو درس دیا کرتا تھا… میں نے ان بھائیوں سے وعدہ کر لیا کہ ہر جمعرات کو نماز مغرب کے بعد انہی میں سے ایک شخص کے گھر جو کہ میرے گھر سے قریب تھا، میں درس دیا کروں گا۔ میں نے پہلے دو درس ریاض الصالحین للنووی رحمہ الله سے اپنی تحقیق و تشریح کے ساتھ دیئے، پھر حاضرین کے سوالات کے جوابات دیئے جو کہ بہت زیادہ تھے۔ سوالات کی کثرت ان کی شدید علمی رغبت اور معرفت ِسنت کی تشنگی کے مظہر تھے۔ لیکن ابھی تیسرے درس کے لئے تیاری کر ہی رہا تھا کہ بروز بدھ 19 ؍شوال 1401ھ کو دوپہر کے وقت مجھے اطلاع دی گئی کہ آپ کا مکان یہاں باقی نہیں رہا ہے۔ پس میرے لئے دمشق واپس جانے کے سوا کوئی چارہ کار نہ رہ گیا تھا۔ میں غم و اندوہ کے عالم میں اللہ عزوجل سے دعا کرتا تھا کہ مجھ سے شر اور دشمنوں کے کینہ کو دور فرما۔ دو راتیں اسی کرب و بے چینی میں گزریں۔ آخر کار تیسری رات میں نے استخارہ اور مشورہ کے بعد بیروت جانے کا فیصلہ کر لیا، حالانکہ وہاں کے حالات بہت پرخطر اور پرفتن تھے۔ میں بیروت رات کے آخری پہر میں پہنچا، اپنے ایک پرانے بھائی کے گھر کا قصد کیا۔ اس نے بھی نہایت لطف و کرم اور ادب کے ساتھ میرا استقبال کیا اور مجھے اپنے گھر معزز و مکرم مہمان رکھا۔ بیروت میں کچھ عرصہ ہی گزرا تھا کہ میں بیروت سے الامارات کی طرف ہجرت کے لئے مجبور ہو گیا جہاں أہل السنۃ والجماعۃ سے وابستہ بعض محبین نے میرا استقبال کیا۔ الامارات میں قیام کے دوران میں نے کویت اور قطر وغیرہ خلیجی ممالک میں دروس دیئے اور پھر وہاں سے بھی عمان کی طرف مہاجر ہوا۔“ شیخ کی زیارات: ➊ شیخ رحمہما اللہ نے سپین (اندلس) کی تنظیم ”الاتحاد العالمي للطلبة المسلمین“ کی دعوت پر ایک محاضرہ میں شرکت کی اور ”الحدیث حجة بنفسه في العقائد والأحکام“ (حدیث ِنبوی بذاتہ عقائد واحکام میں حجت ہے)کے عنوان پر ایک وقیع خطاب پیش کیا جو بعد میں المکتبةالسلفیة، کویت سے شائع ہو چکا ہے۔ ➋ إدارة العامة للإفتاء والدعوة والإرشاد، الریاض نے مصر، مغرب (مراکش) اور انگلینڈ میں عقیدہ توحید اور المنہج الاسلامی الحق کی طرف دعوت کے لئے آپ کو منتخب کیا تھا۔ ➌ شیخ رحمہ اللہ نے دولۃ القطر کا سفر کیا اور وہاں مشائخ اور علماء سے ملاقاتیں کیں جن میں شیخ یوسف قرضاوی، شیخ محمد غزالی، شیخ المحمود اور شیخ ابن حجر بن آل بوطامی وغیرہ م قابل ذکر ہیں۔ آپ نے وہاں ”منزلة السنة في الإسلام“ کے عنوان پر خطاب بھی فرمایاجو بعد میں طبع ہوا۔ ➍ متعدد اسلامی علمی کانفرنسوں میں آپ کو شرکت کی دعوت دی گئی۔ بعض کانفرنسوں اور اجتماعات میں آپ نے شرکت کی لیکن علمی مشاغل کی کثرت کے باعث اکثر سے آپ نے معذرت کر لی تھی۔ ➎ شیخ رحمہ اللہ نے مختلف یورپی ممالک کا سفر بھی کیا اور وہاں کی مسلم اقلیتوں نیز مسلم طلبہ سے خطاب کیا اور ان میں اپنے مفید علمی دروس سے مستفید کیا تھا۔ ➏ 1402ھ میں آپ رحمہ اللہ نے کویت کا سفر کیا اور وہاں متعدد دروس و محاضرات سے سامعین کو فیض یاب کیا۔ وہاں آپ کے دروس کی ریکارڈ کی گئی کیسٹوں کی تعداد تقریباً تیس ہے۔ ➐ اسی طرح آپ نے متعدد بار ”الإمارات العربیۃ المتحدۃ“ کی زیارت بھی کی اور وہاں بہت سے اجتماعات سے خطاب کیا۔ آپ کے یہ خطابات ریکارڈ ہیں اور کیسٹ کے مراکز میں دستیاب ہیں۔ آپ کی امارات کی آخری زیارت غالباً 1405ھ میں ہوئی تھی۔ اہل علم سے تعلقات: شیخ البانی رحمہ اللہ کا طلبہ علم سے ملاقات کا دائرہ بہت وسیع تھا۔ ان کے مابین ملاقات عموماً علمی مفید مباحث پر مشتمل ہوتی تھی۔ ان میں شیخ حامد رحمہ اللہ (رئیس جماعۃ أنصار السنۃ المحمدیۃ بمصر) علامہ احمد شاکر مصری رحمہ الله (معروف محقق)، شیخ عبدالرزاق حمزۃ رحمہ الله (صاحب ِتصانیف کثیرہ)، علامہ مجاہد الجوال تقی الدین ہلالی السلفی (مشہور بناصر السنہ و قامع البدعہ) قابل ذکر ہیں۔ ان کے علاوہ مفتی اعظم عبدالعزیز بن عبداللہ بن باز رحمہ اللہ (رئیس إدارة البحوث العلمیة والإفتاء والدعوة والإرشاد، الریاض) کے ساتھ شیخ رحمہ اللہ کی مفید علمی مجلسیں اور علمی مراسلت مشہور ہیں۔ اسی طرح صاحب طرز ادیب، تیزرو قلمکار اور المکتبۃ السلفیۃ کے مالک سید محب الدین خطیب رحمہ الله سے شیخ رحمہ اللہ نے اپنی کتاب ”آداب الزفاف عن آداب الزفاف في التاریخ الإسلامي“ شائع کرنے کی خواہش ظاہر کی تھی۔ دیارِ ہند کے معروف محقق شیخ عبدالصمد شرف الدین کے ساتھ بھی شیخ رحمہ اللہ کی ملاقات اور علمی مراسلت قائم تھی، چنانچہ ایک مرتبہ شیخ عبدالصمد نے لکھا تھا کہ: ”دار الافتاء، الریاض سے شیخ عبید اللہ رحمانی رحمہ الله شیخ الجامعۃ الاسلامیۃ (الجامعۃ السلفیۃ بنارس) کے پاس ایک غریب حدیث کے لفظ کے بارے میں کہ جو معنوی اعتبار سے عجیب ہے، یہ استفسار پہنچا ہے، جو علماء وہاں موجود تھے انہوں نے باتفاق طے کیا ہے کہ اس سلسلہ میں عصر حاضر کے احادیث ِنبویہ کے سب سے بڑے عالم یعنی شیخ البانی العالم الربانی کی طرف رجوع کیا جائے۔“ ان کے علاوہ شیخ رحمہ اللہ کی ملاقات جن بعض دوسرے معروف علماء سے ہوئی ان میں سے چند یہ ہیں: ”صبحی صالح، ترکی کے شیخ محمد طیب اوکیج بوسنوی، ڈاکٹراحمد العسال، شیخ ڈاکٹر ربیع بن ہادی المدخلی، مدینہ منورہ کے شیخ حماد الانصاری، کویت کی وزارۃ الاوقاف ولجنۃ الفتویٰ کے رکن اور صاحب تصانیف (مثلاً زبدۃ التفسیر وغیرہ) شیخ محمد سلیمان اشقر، معروف داعی اور صاحب ِرسائل علمیہ شیخ عبدالرحمن عبدالخالق اور کلیۃ الشریعۃ، کویت یونیورسٹی کے پروفیسر عمر سلیمان الاشقر وغیرہ۔ مشہور فقیہ یوسف قرضاوی اور شیخ رحمہ اللہ کے مابین بھی ثمر آور مفیدعلمی مجالس ہوئیں۔ قرضاوی احادیث کی تصحیح کے لئے شیخ رحمہ اللہ کی طرف رجوع کیا کرتے تھے۔ چنانچہ کویت میں منعقد ہونے والی ایک کانفرنس میں قرضاوی نے اس بات کا خود اظہار کیا تھا۔ بیشتر ممالک، بالخصوص ہندوستان و پاکستان، کے بہت سے علماء اپنے خطوط میں شیخ رحمہ اللہ کے تئیں اپنی محبت اور ان سے ملاقات کی خواہش کا اظہار کیا کرتے تھے۔ جن میں استاذِ محترم شیخ عبید اللہ رحمانی مباکپوری رحمہ الله اور طنجہ (مراکش) کے مشہور اہلحدیث عالم شیخ محمد الزمزمی کے اسماء گرامی قابل ذکر ہیں۔ واضح رہے کہ شیخ زمزمی سے آپ کی ملاقات طنجہ میں ان کے مکان پر ہوئی تھی۔ ان کے علاوہ بہت سے طلبہ علم مختلف اسلامی علوم میں ایم۔ اے اور پی ایچ ڈی کی ڈگری کے لئے اپنی دراسات اور اختصاصات کی بحوث کے سلسلہ میں ملاقاتیں کیا کرتے۔ آپ کی مجالس میں حاضر ہوتے، آپ سے مراسلت کرتے اور آپ سے سن کر مستفید ہوتے۔ مثال کے طور پر ڈاکٹر امین مصری رحمہ الله، ڈاکٹر احمد العسال (چیئرمین قسم الثقافۃ والدراسات الاسلامیۃ، جامعۃ الریاض) ڈاکٹر محمود الطحان (مدینہ یونیورسٹی میں حدیث کے سابق پروفیسر، اِن دنوںکلیہ الشریعہ، کویت یونیورسٹی) وغیرہ ان مشاہیر کے علاوہ بہت سے دانش جو یاں نے شیخ رحمہ اللہ سے مفید انٹرویو لئے ہیں جو یا تو کیسٹوں کی صورت میں محفوظ ہیں یا مختلف عربی رسائل و جرائد کی زینت بن چکے ہیں۔ ان میں سے بعض انٹرویو کے اردو تراجم ہفت روزہ ”ترجمان“ ہلی وغیرہ میں بھی راقم کی نظر سے گزرے ہیں۔ مختلف کمیٹیوں کی رکنیت: شیخ رحمہ اللہ مختلف مجالس اور کمیٹیوں کے روح رواں تھے جن کامختصر تعارف حسب ذیل ہے: ➊ کتب السنۃ کی نشرو اشاعت اور تحقیق کے لئے مصر وشام کی مشترکہ کمیٹی لجنۃ الحدیث کے رکن رکین تھے۔ ➋ الجامعۃ الاسلامیۃ (مدینہ منورہ) کی یونیورسٹی سطح پر مختلف کمیٹیوں کے رکن تھے۔ ➌ سعودی عرب کے وزیر المعارف شیخ حسن بن عبداللہ آل الشیخ نے 1388ھ میں جامعۃ مکۃ المکرمۃ میں قسم الدراسات العلیاللحدیث کے اِشراف(سر پرستی) کے لئے آپ کو دعوت دی تھی۔ ➍ سعودی عرب کے فرمانروا ملک خالد بن عبدالعزیز رحمہ الله نے الجامعة الإسلامیة في المدینة المنورة کی سپریم کونسل کے لئے آپ کو بطورِ عضو منتخب کیا تھا، آپ 1395ھ تا 1398ھ اس مجلس کے رکن رہے۔ شیخ کا علمی مقام و مرتبہ: شیخ رحمہ اللہ کثیر دقیق علمی کتب و رسائل کے مؤلف ہونے کے علاوہ علم حدیث کے بارے میں مختلف بلاد کے علماء، اساتذہ اور طلبہ علم کے لئے مرجع کی حیثیت بھی رکھتے تھے۔ راقم نے خود اپنی آنکھوں سے مشاہدہ کیا ہے کہ مختلف جامعات کے ماہر ڈاکٹر حضرات آپ کے سامنے فقہ اور حدیث سے متعلق مسائل پیش کرتے، آپ انہیں صفحات نمبر تک کی نشاندہی کرتے ہوئے مراجع و مصادر کے حوالہ سے اطمینان بخش جواب دیتے تھے۔ بعض اوقات آپ ایسی نادر کتابوں کا حوالہ بھی دیتے تھے کہ جن کا نام تک حاضرین میں سے کسی نے نہ سنا ہوتا تھا۔ شیخ رحمہ اللہ کے متعلق بعض معاصر علماء کی آراء: اگرچہ شیخ رحمہ الله کی شخصیت کسی شخص کے تزکیہ کی محتاج نہیں ہے لیکن پھر بھی بعض معروف اہل علم حضرات کے ثنائیہ کلمات پیش خدمت ہیں: علامہ سید محب الدین خطیب رحمہ الله فرماتے ہیں: «من دعاة السنة الذين وقفواحياتهم على العمل لإحيائهاوهو أخونابالغيب الشيخ أبوعبد الرحمن محمد ناصر الدين نوح نجاتي الألباني» ” سنت شریفہ کے ان عظیم داعیوں میں سے جنہوں نے سنت کے احیاء کے لئے اپنی زندگیوں کو وقف کر دیا، ایک ہمارے قابل فخر مسلمان بھائی شیخ محمد ناصر الدین نوح نجاتی البانی ہیں۔“ چند ماہ پیشتر وفات پانے والے مفتی اعظم سعودیہ شیخ عبدالعزیز بن عبداللہ بن باز رحمہ الله کا قول ہے: «ما رأيت تحت أديم السماء عالما بالحديث فى العصر الحديث مثل العلامة محمد ناصر الدين الألباني» ” آسمان کے سائباں کے نیچے میں نے اس زمانے میں شیخ محمد ناصر الدین البانی سے زیادہ حدیث نبوی (علی صاحبہا الصلوات والتسلیم) کاعالم نہیں دیکھا۔“ ڈاکٹر عمر سلیمان الاشقر اپنی کتاب تاریخ الفقہ الإسلامی (صفحہ 127) میں آپ کو محدث العصر محمد ناصر الدین الألبانی کے نام سے مخاطب کرتے ہیں۔ شیخ حسن البناء رحمہ الله نے شیخ رحمہ اللہ کو خط لکھا اور اس میں انہیں اپنے سلیم علمی منہج پر ڈٹے رہنے کی تاکید کی، ان کی ہمت افزائی فرمائی اور شیخ سید سابق کے مقالات پر آپ کی بعض تعلیقات اپنے مجلہ ”الإخوان المسلمون“ میں شائع کیں۔ ڈاکٹر امین مصری رحمہ الله (مدرّس مادۃ الحدیث، الجامعۃالسوریۃ و رئیس قسم الدراسات العلیاللحدیث فی الجامعۃ الإسلامیۃ سابقاً) شیخ رحمہ اللہ کے متعلق ہمیشہ کہا کرتے تھے: «إن الشيخ الألباني أحق مني بهذا المنصب وأجدر» ”کہ شیخ البانی مجھ سے زیادہ ان علمی مناصب کے حق دا راور لائق ہیں“ اور اپنے آپ کو شیخ کے تلامذہ میں شمار کرتے تھے۔ اس بات کی شہادت ڈاکٹر صبحی صالح رحمہ الله (اُستاذ الحدیث والعلوم العربیۃ بجامعۃ الدمشق سابقاً والجامعۃ اللبنانیۃ) وغیرہ نے دی ہے۔ استاذ محمد الغزالی اپنی کتاب ” فقہ السیرۃ“ میں لکھتے ہیں: «سرني أن تخرج هذه الطبعة (الرابعة) الجديدة بعد أن رجعها الأستاذ المحدث العلامة الشيخ محمد ناصر الدين الألباني… وللرجل من رسوخ قدمه فى السنة مايعطيه هذا الحق… الخ» ” میرے لئے مقام مسرت ہے کہ اس کتاب کے چوتھے ایڈیشن کو محدث علامہ شیخ محمد ناصر الدین البانی کی نظر ثانی کے ساتھ شائع کیا جا رہا ہے۔ علوم سنت میں رسوخ مہارت کی بنا پر آپ سے ہی اس کا حق اداکرنے کی توقع کی جا سکتی ہے۔“ کتاب ”صید الخاطر“ از امام ابن جوزی رحمہ الله کے محقق استاذ علی و استاذ ناجی طنطاوی لکھتے ہیں: «وقد علق عليها الأستاذ الشيخ ناصر الدين الألباني (وهو المرجع اليوم فى رواية الحديث فى البلاد الشامية)… الخ» “ ” اس کتاب پر شیخ ناصر الدین البانی نے تعلیق لکھی ہے اور آپ فی زمانہ ممالک شام میں علم حدیث میں مرجع خلائق کی حیثیت رکھتے ہیں۔“ علامہ ڈاکٹر یوسف قرضاوی فرماتے ہیں: «وقد قام العلامة الشيخ محمد ناصر الدين الألباني بفصل صحيح الجامع الصغير و زيادته (الفتح الكبير) عن ضعيفه و صدر كل منهمافي عدة أجزاء فخدم لذلك الكتاب وطالبي الحديث أيماخدمة» [ثقافة الداعية ص 79، 80 ] ”علامہ شیخ البانی نے جامع الصغیر او راس پر زیادت یعنی فتح الکبیر کی صحیح احادیث کو ضعیف احادیث سے جدا کیا ہے، او رآپ کا یہ علمی کام متعدد جلدوں میں شائع ہو چکا ہے۔ اس طرح آپ نے اس کتاب اور طلبہ حدیث کی کس قدر عظیم خدمت سر انجام دی ہے۔“ آپ امام ابن جوزی رحمہ الله کی کتاب الموضوعات کو اس فن کی ابتداء اور سلسلۃ الأحادیث الضعیفۃ کو اس کی انتہا قرار دیتے تھے۔ استاذ احمد مظہر العظمۃ رحمہ اللہ (صدر جمعیۃ التمدن الإسلامی بدمشق) شیخ رحمہ الله کے علم سے حد درجہ متاثر تھے اور ان کے مقالات کو مخالفین کی پرواہ کئے بغیر شائع کیا کرتے تھے۔ ڈاکٹر یوسف سباعی رحمہ الله (مدیر اعلیٰ مجلہ المسلمون) شیخ رحمہ اللہ سے درخواست کیا کرتے تھے کہ وہ ان کے مجلہ کے لئے کچھ لکھیں۔ چنانچہ شیخ رحمہ اللہ کی متعدد تحریریں اس مجلہ کی زینت بنی ہیں۔ ڈاکٹر مصطفی اعظمی نے شیخ زہیر الشاویش (مدیر المکتب الإسلامی، بیروت) کے واسطہ سے شیخ رحمہ اللہ سے درخواست کی تھی کہ وہ ان کی کتاب صحیح ابن خزیمۃ کی تحقیق پر نظر ثانی فرما دیں، اس پر تعلیقات و تخریجات درج فرمائیں اور اس میں جہاں کہیں جو اضافہ یا تبدیلی مناسب سمجھیں کر دیں، چنانچہ حواشی میں شیخ رحمہ اللہ کے درج کردہ نوٹ جابجا موجود ہیں اور اس کا تذکرہ ڈاکٹر اعظمی نے اپنی کتاب کے مقدمہ میں بھی کیا ہے۔ سعودی عرب کے معروف عالم شیخ محمد صالح العثیمین حفظہ اللہ شیخ البانی رحمہ الله کے متعلق لکھتے ہیں: «أكتب عن فضيلة محدث الشام الشيخ الفاضل: محمد بن ناصر الدين الألباني فالذي عرفته عن الشيخ من خلال اجتماعي به وهو قليل أنه حريص جدا على العمل بالسنة و محاربة البدعة سواء كانت فى العقيدة أم فى العمل، أمامن خلال قراء تي لمؤلفاته فقد عرفت عنه ذلك وأنه ذوعلم جم فى الحديث رواية و دراية و أن الله تعالىٰ قد نفع فيماكتبه كثيرا من الناس من حيث العلم ومن حيث المنهاج والاتجاه إلى علم الحديث وهذه ثمرة كبيرة للمسلمين ولله الحمد… وعلي كل حال فالرجل طويل الباع واسع الاطلاع قوي الاقناع وكل أحد يؤخذ من قوله و يترك سوي قول الله و رسوله… و نسأل الله تعالىٰ أن يكثر من أمثاله فى الأمة الإ سلامية… الخ» [مكتوب، مورخه 22؍8؍1405ه ] ” محدثِ شام شیخ الفاضل علامہ ناصر الدین البانی کے بارے میں اپنی چند ملاقاتوں میں جو جان سکا ہوں کہ آپ سنت کی خدمت کرنے اور بدعت سے جنگ کرنے کی شدید خواہش رکھتے ہیں، چاہے وہ بدعت عقائد میں ہو یا افعال میں۔ آپ کی تالیفات کے مطالعے سے میں اس نتیجہ پر پہنچا ہوں کہ روایت او ردرایت ِحدیث کے بارے میں آپ کا علم بہت وسیع ہے او رآپ کی تحریروں سے اللہ تعالیٰ نے بہت سے لوگو ں کو بطورِ علم بھی فائدہ دیا ہے اور من حیث المنہاج کے بھی لوگوں کو علم حدیث کی طرف متوجہ کرنے میں۔ الحمد للہ مسلمانوں کے لئے اس کام میں عظیم فائدہ ہے۔ بہرحال موصوف دور تک نظر رکھنے والے، وسیع علم کے حامل اور قوی تاثیر رکھنے والے ہیں، ہر ایک کا قول اختیار کیا اور چھوڑا جا سکتا ہے سوائے اللہ اور اس کے رسول کے قول کے۔ ہماری اللہ سے دعا کہ اللہ تعالیٰ آپ جیسے علماء امت کو بکثرت عطا فرمادے …آمین!“ شیخ زید بن عبدالعزیز الفیاض (استاذ بکلیۃ أصول الدین فی جامعۃ الإمام محمد بن سعود الإسلامیۃ بالریاض) فرماتے ہیں: «إن الشيخ محمد ناصر الدين الإلباني من الأعلام البارزين فى هذا العصر وقد عني بالحديث وطرقه و رجاله و درجته من الصحة أوعدمهاوهذاعمل جليل من خيرما أنفقت فيه الساعات و بذلت فيه المجهودات و هو كغيره من العلماء الذين يصيبون و يخطئون ولكن انصرافه إلى هذا العلم العظيم مماينبغي أن يعرف له به الفضل وأن يشكر على اهتمامه به… الخ» ” شخ محمد ناصر الدین البانی کا اس زمانے کی نامور علمی شخصیتوں میں شمار ہوتا ہے۔ آپ نے متن حدیث، اس کے طرق، رواۃ اور اس کی فنی حیثیت پر خصوصی کام کیا ہے۔ یہ بہت عظیم کام ہے اور اس لائق کہ اس میں اوقات صرف کئے جائیں اور محنتیں کھپائی جائیں۔ آپ بھی دیگر علماء کی طرح صحیح علمی رائے اپنانے کے ساتھ بہت سے امور میں غلطی کھا جاتے ہیں۔ لیکن اس مبارک علم میں آپ کی عظیم خدمات اس لائق ہیں کہ آپ کے فضل و کرم کا اعتراف کیا جائے اور اس علم پر توجہ دینے پر آپ کا شکر گزار ہوا جائے۔“ [مكتوب، مؤرخه 30؍7؍1405ه ] المملکۃ العربیۃ السعودیۃ کے سابق مفتی عام علامہ عبدالعزیز بن عبداللہ بن باز رحمہ اللہ کا ایک قول اوپر نقل کیا جا چکا ہے۔ آپ رحمہ اللہ اپنے ایک مکتوب میں شیخ رحمہ الله کے متعلق مزید فرماتے ہیں: «أن الشيخ المذكور معروف لدينابحسن العقيدة والسيرة و مواصلة الدعوة إلى الله سبحانه مع مايبذ له من الجهود المشكورة فى العناية بالحديث الشريف و بيان الحديث الصحيح من الضعيف من الموضوع وماكتبه فى ذلك من الكتابات الواسعة كله عمل مشكور و نافع للمسلمين…الخ» ” شیخ البانی ہمارے ہاں حسن سیرت اور درست عقیدہ کے حامل کے طو رپر معروف ہیں۔ آپ نے ساری زندگی اس دعوت کی ترویج میں صرف کی کہ حدیث شریف کا خاص اہتمام کیا جائے اور ضعیف و موضوع احادیث کو صحیح احادیث سے ممتاز کر دیا جائے۔ اس مشن میں آپ نے بہت سی عظیم کتابیں لکھیں، آپ کی تمام دینی کاوشیں لائق شکر و امتنان اور امت مسلمہ کے لئے نفع بخش ہیں۔“ شیخ رحمہ اللہ کے متعلق راقم کی شخصی رائے: شیخ رحمہ اللہ کی زندگی تقویٰ و پاکدامنی سے عبارت تھی۔ آپ کے سینہ میں قوم و ملت کا درد موجزن تھا۔ دینی حمیت و غیرت اور اسلامی جذبات سے آپ کا دل معمور رہتا تھا۔ آپ راہِ حق کے جانباز، مجاہد اور بقیۃ السلف تھے۔ اللہ تعالیٰ نے آپ کو بعض معاندین کے سوا مقبولیت ِعامہ کی دولت سے نوازا تھا۔ عصر حاضر میں آپ امت ِمسلمہ کی روح رواں تھے۔ تنہا اپنی ذات میں ایک امت اور مکمل انجمن کے مثل تھے۔ آپ کی ذات سے بزمِ اسلام کے چراغ روشن تھے، آپ عہد ِحاضر کے سب سے نمایاں اور ممتاز داعی الی اللہ، اس صدی کے مجدد، مفتی، واعظ، محدث، مفسر، فقیہ، قرۃ عیونِ الموحدین اور مسلک ِسلف کے حامی و ناصر تھے۔ آپ کی فقاہت پر فقیہانِ عصر سر دھنتے تھے۔ آپ ذہانت و فطانت کے ایک بحر ناپید کنار تھے۔ فقاہت، ہدایت و ارشاد کے ایک بلند اخلاق امام اور دین کے عمائدین میں نمایاں تھے۔ آپ کی علمی مجالس کا وقار اس قدر بلند و ارفع ہوتا تھا کہ عالم اسلام کی سربر آوردہ ہستیاں بھی ان سے فیض یاب ہوا کرتی تھیں۔ آپ نے عالم اسلام کو علم و بصیرت، معرفت و حکمت اور اَخلاق و آداب کا جو انمول تحفہ دیا ہے، گزشتہ کئی صدیوں میں اس کی کوئی نظیر نہیں ملتی۔ شیخ رحمہ اللہ اُلفت و محبت، تعظیم و تکریم، زہد و تقویٰ، لطف و کرم، تواضع و انکساری، حلم و بردباری، صبر و شکر، خشیت ِالٰہی، احسان و اکرام، علم و ادب، ضبط و تحمل، حب ِرسول، سادگی اور حسن اَخلاق جیسے اَوصاف و محاسن کے پیکر تھے۔ ان اعلیٰ صفات کے حامل ہونے کے ساتھ آپ رحمہ اللہ علم و فضل کا گنج گراں بہا بھی تھے۔ دینی علوم و فنون میں آپ کو تبحر اور دسترسِ تامہ حاصل تھی۔ آپ کے وسعت ِمطالعہ، تبحر علمی اور تحقیق مباحث کا چرچا عالم اسلام کی تقریباً ہر وقیع مجلس میں ہوا کرتا تھا۔ آپ کتاب و سنت کے سچے شیدائی، متبع اور ترجمان تھے، خلافِ سنت آپ کو کوئی بات گوارہ نہ تھی۔ آپ کی رحلت سے دنیائے علم میں پیدا ہونے والا خلا جلد پر ہوتا نظر نہیں آتا۔ اللہ تعالیٰ جلد اس کی کوئی مؤثر سبیل پیدا فرما دے، «آمين! فانه ولي والقادر عليه» بلاشبہ تاریخ اسلام اس بطل جلیل اور علم و بصیرت کے بلند منارہ کی خدمات و احسانات کے تلے ہمیشہ مستفید ہوتی رہیں گی غرض ان کی بے لوث خدمات اور قربانیوں سے تاریخ اسلام کے اَوراقِ زریں تاقیامت روشن رہیں گے۔ شیخ رحمہ اللہ کو شاہ فیصل ایوارڈ کا اعزاز: المملکۃ العربیۃ السعودیۃ کی موقر تنظیم مؤسسۃ الملک فیصل الخیریۃ کے زیر اہتمام ہر سال عالم عرب اور بیرونی دنیاکے اَفاضل کو دیئے جانے والے انعام کے لئے سالِ رواں (1999ء بمطابق 1419ھ) میں محدثِ شام، فقیہ بے مثل، بقیۃ السلف، یگانہ روز گار، مفسر دوراں، علامہ ٔ زماں اور عبقری وقت شیخ محمد ناصر الدین البانی رحمہ اللہ کو ” تحقیقاتِ اسلامی و خدماتِ حدیث“ کے لئے عالمی شاہ فیصل ایوارڈ کے اعزاز کے لئے نامزد کیا گیا۔ شیخ رحمہ اللہ نے اس اعزاز کو وصول کرنے کے لئے اپنے ایک شاگرد شیخ محمد بن ابراہیم شقرۃ کو اپنا قائم مقام بنا کر بھیجا۔ یہ حقیقت ہے کہ مؤسسۃ الملک فیصل الخیریۃ نے شیخ رحمہ اللہ کی دینی خدمات و کمالِ علم و فضل کا اعتراف کرتے ہوئے سالِ رواں کا شاہ فیصل ایوارڈ آپ کو عنایت کیا ہے لیکن میں سمجھتا ہوں کہ شیخ رحمہ اللہ کی شخصیت اس اعزاز سے بہت بالا و اَرفع ہے۔ یہ ایوارڈ آپ کی خدمات کے مقابلہ میں ایک ادنیٰ اعتراف سے زیادہ کوئی حقیقت نہیں رکھتا کیونکہ آپ سے قبل جن لوگوں کو یہ اعزاز دیا جاتا رہا ہے، ان کی دینی خدمات اس محدثِ نبیل کی خدمات کے مقابلہ میں بہت ہیچ نظر آتی ہیں۔ چنانچہ مجھے یہ کہنے میں کوئی باک نہیں کہ اس ایوارڈ سے شیخ رحمہ اللہ کی شخصیت اور علمی وجاہت میں تو کوئی اضافہ نہیں ہوا، البتہ اس ایوارڈ کا اعزاز و اعتماد دو چند ضرور ہوا ہے۔ شیخ رحمہ اللہ کے ساتھ مولوی حبیب الرحمن اعظمی حنفی کا غیر محسنانہ رویہ: مصنف عبدالرزاق، مسند الامام الحمیدی، سنن سعید بن منصور اور مسند اسحق بن راہویہ وغیرہ کے محقق شیخ حبیب الرحمن اعظمی حنفی جب 1398ھ میں دمشق کے سفر پر گئے تو انہوں نے محدث رحمہ اللہ کے گھر پر ہی بطور مہمان قیام کیا۔ آپ نے مولوی حبیب کی بے حد عزت کی۔ المکتبۃ الظاھریۃ کے مخطوطات کی زیارت کرائی، متعدد علماء سے ملاقات کرانے کی غرض سے ان کے ساتھ ساتھ گئے لیکن مولوی حبیب نے ہندوستان واپس جانے پر محدث رحمہ اللہ کی تردید میں ” الألبانی شذوذہ و أخطاؤہ“ نامی کتاب لکھی جو چار جلدوں میں مکتبۃ دارالعروبۃ للنشر والتوزیع (کویت) سے 1404ھ میں طبع ہو چکی ہے۔ جب شیخ رحمہ اللہ کو اس کتاب کی بابت بتایا گیا تو آپ نے اس کا جواب دینے پر صبر کرنے کو ترجیح دی اور فقط اس قدر کہا کہ ”جب شیخ اعظمی میرے گھر پر مقیم تھے تو میں نے کئی بار ان سے مختلف اختلافی اور مسلکی مسائل پر گفتگو کرنا چاہی تھی مگر وہ کسی بات کا کوئی جواب نہ دیتے تھے۔ میں نے ان کی خاموشی کو ان کی کم گوئی اور پیرانہ سالی کے باعث سفر کی تکان پر محمول کرتے ہوئے اپنا ارادہ ترک کر دیا تھا۔“ لیکن شیخ رحمہ اللہ کے ایک شاگرد شیخ سلیم الہلالی نے شیخ اعظمی کے ردود کا بہت مفصل جائزہ لیا ہے اور ان کے اعتراضات کا بہت شافی جواب لکھا ہے جو حسن اتفاق سے شیخ اعظمی کی زندگی ہی میں طبع بھی ہو چکا ہے۔ «فجزاه الله أحسن الجزاء» خود راقم نے شیخ اعظمی کی مذکورہ بالا کتاب اور شیخ سلیم الہلالی کا جواب حرف بحرف پڑھا ہے اور اس نتیجہ پر پہنچا ہے کہ شیخ اعظمی نے مذکورہ کتاب لکھ کر یقیناً مجموعی طور پر محدثِ نبیل رحمہ اللہ پر ظلم کیا ہے، «فإنالله وإنا إليه راجعون» شیخ رحمہ اللہ کی تصنیفی خدمات: شیخ رحمہ اللہ ایک برق رفتار مؤلف تھے، چنانچہ آپ کی مطبوعہ و غیر مطبوعہ مؤلفات کی تعداد ایک سو بیس سے متجاوز ہے، ہم ذیل میں آپ کی تصنیفی خدمات کو چار اقسام میں تقسیم کر کے مختصراً ذکر کریں گے: (الف) علمی تحقیقات «1. الكلم الطيب لإبن تيمية 2. تحقيق مشكاة المصابيح للتبريزي 3. تصحيح حديث إفطار الصائم قبل سفره بعد الفجر 4. رياض الصالحين للنووي 5. صحيح الكلم الطيب لابن تيمية 6. فضل الصلاة على النبيﷺ لإسمعيل بن إسحٰق 7. كتاب اقتضاء العلم والعمل للخطيب البغدادي 8. كتاب العلم للحافظ أبى خيثمة 9. لفتة الكبد فى تربية الولد لابن الجوزي 10. مختصر صحيح مسلم للمنذري 11. مساجلة علمية بين الإمامين الجليلين العز بن عبدالسلام و ابن الصلاح» (ب) التخریجات «12. المرأة المسلمة للشيخ حسن البناء 13. الآيات البينات فى عدم سماع الأموات عند الحنيفة السادات لمحمود الآلوسي 14. تخريج الإيمان لابن أبى شيبة 15. تخريج الإيمان لأبي عبيد القاسم بن سلام 16. تخريج فضائل الشام للربعي 17. تخريج كتاب الرد على جهمية للدارمي 18. تخريج كتاب المصطلحات الأربعة فى القرآن 19. تخريج كتاب إصلاح المساجد من البدع والعوائد لجمال الدين القاسمي 20. تخريج كلمة الإخلاص وتحقيق معناها لابن رجب الحنبلي 21. تخريج أحاديث مشكلة الفقرو كيف عالجها الإسلام للقرضاوي 22. حجاب المرأة المسلمة ولباسها فى الصلاة لشيخ الإسلام ابن تيمية 23. حقيقة الصيام لابن تيمية 24. شرح العقيدة الطحاوية لأبي جعفر الطحاوي 25. صحيح الجامع الصغير و زيادته(الفتح الكبير) للسيوطي 26. ضعيف الجامع الصغير و زيادته (الفتح الكبير) للسيوطي 27. غاية المرام فى تخريج أحاديث الحلال والحرام للقرضاوي 28. كتاب السنة و معه ظلال الجنة فى تخريج السنة لأبي عاصم الضحاك 29. ما دل عليه القرآن مما يعضد الهيئة الجديدة القوية البرهان لمحمود الآلوسي 30. إرواء الغليل فى تخريج أحاديث منار السبيل لابن ضويان» (ج) اختصار ؍ مراجعۃ ؍ تعلیق «31. التعليق على كتاب الباعث الحيثث شرح اختصار علوم الحديث لابن كثير بتحقيق أحمد شاكر 32. التعليقات على صفة الفتوي والمفتي والمستفتي لابن شبيب بن حمدان 33. صحيح ابن خزيمة بتحقيق د؍مصطفي الأعظمي 34. مختصر الشمائل المحمدية للترمذي 35. مختصر شرح العقيدة الطحاوية 36. مختصر كتاب العلو للعلي العظيم للحافظ الذهبي 37. مدارك النظر فى السياسة بين التطبيقات الشرعية والانفعالات الحماسية لعبد الملك الجزائري» (د) تالیفات «38. التعقيب على كتاب الجواب للمودودي 39. التعليق الممجد على التعليق على موطأ الإمام محمد للكنوي 40. التعليق على كتاب سبل السلام شرح بلوغ المرام 41. التعليق على كتاب مسائل جعفر بن عثمان بن أبى شيبة 42. التعليقات الجياد على زاد المعاد 43. التعليقات الرضية على الروضة الندية 44. التوسل، أحكامه وأنواعه 45. الثمر المستطاب فى فقه السنة والكتاب 46. الجمع بين ميزان الاعتدال للذهبي و لسان الميزان لابن حجر 47. الحديث حجة بنفسه فى العقائد والأحكام 48. الحوض المورود فى زوائد منتقي ابن الجارود 49. الذب الأحمد عن مسند الإمام أحمد 50. الرد على رسالةالشيخ التويجري فى بحوث من صفة الصلاة 51. الرد على كتاب المراجعات لعبد الحسين شرف الدين 52. الرد على رسالة التعقب الحثيث 53. الرد على رسالة أرشد السلفي 54. الروض النضير فى ترتيب و تخريج معجم الطبراني الصغير 55. السفر الموجب للقصر 56. اللحية فى نظر الدين 57. المحو والإثبات 58. المسيح الدجال و نزول عيسي عليه الصلاة والسلام 59. المنتخب من مخطوطات الحديث 60. الأحاديث الضعيفة والموضوعة التى ضعفها أوأشار إلى ضعفها ابن تيمية فى مجموع الفتاوي 61. مقدمة الأحاديث الضعيفة والموضوعة فى أمهات الكتب الفقهية 62. الأحاديث المختارة 63. الأمثال النبوية 64. بغية الحازم فى فهارس مستدرك الحاكم 65. تاريخ دمشق لأبي زرعة رواية أبى الميمون 66. تحذير الساجد من اتخاذ القبور مساجد 67. تحقيق كتاب حول أسباب الاختلاف للحميدي 68. تحقيق كتاب ديوان أسماء الضعفاء والمتروكين للذهبي 69. تحقيق كتاب مساوئ الأخلاق للخرائطي 70. تحقيق كتاب أصول السنة واعتقاد الدين 71. تسديد الإصابة إلى من زعم نصرة الخلفاء الراشدين والصحابة 72. تسهيل الانتفاع بكتاب ثقات ابن حبان 73. تعليق و تحقيق كتاب زهر الرياض فى رد ماشنعه القاضي عياض على من أوجب الصلاة على البشير النذير فى التشهد الأخير 74. تلخيص صفة صلاة النبيﷺ 75. تلخيص كتاب تحفة المودود فى أحكام المولود 76. تلخيص أحكام الجنائز 77. تمام المنة فى التعليق على كتاب فقه السنة للسيد سابق 78. حجاب المرأة المسلمة فى الكتاب والسنة 79. خطبة الحاجة 80. دفاع عن الحديث النبوي والسيرة 81. سلسلة الأحاديث الصحيحة و شيء من فقهها 82. سلسلة الأحاديث الضعيفة والموضوعة وأثرها السيي ء فى الأمة 83. صحيح ابن ماجه 84. صحيح الترغيب والترهيب 85. صحيح الأدب المفرد 86. صحيح الإسراء والمعراج 87. صحيح سنن أبى داود 88. صفة الصلاة الكبير 89. صفة صلاة النبيﷺ لصلاة الكسوف 90. صفة صلاة النبيﷺ من التكبير إلى التسليم كأنك تراها 91. صلاة الاستسقاء 92. صلاة العيد ين فى المصلي هي السنة 93. ضعيف ابن ماجه 94. ضعيف الترغيب والترهيب 95. ضعيف سنن أبى داود 96. فهرس المخطوطات الحديثيةفي مكتبة الأوقاف بحلب 97. فهرس كتاب الكواكب الدراري 98. فهرس مخطوطات دارالكتب الظاهرية 99. فهرس مسند الإمام أحمد بن حنبل فى مقدمة المسند 100. فهرس أحاديث كتاب التاريخ الكبير 101. فهرس أحاديث كتاب الشريعة للآجري 102. فهرس أسماء الصحابة الذين أسندوا الأحاديث فى معجم الطبراني الأوسط 103. قاموس البدع 104. قيام رمضان و بحث عن الاعتكاف 105. كشف النقاب عما فى كلمات أبى غدة من الأباطيل والافتراء ات 106. ماصح من سيرة رسول اللهﷺ 107. مختصر تعليق الشيخ محمد كنعان 108. مختصر صحيح البخاري 109. مختصر صحيح مسلم 110. معجم الحديث النبوي 111. مناسك الحج و العمرة فى الكتاب والسنة و آثار السلف 112. مناظرة كتابية مسجلة مع طائفة من أتباع الطائفة القاديانية 113. منزلة السنة فى الإسلام 114. نصب المجانيق فى نسف قصة الغرانيق 115. نقد نصوص حديثية فى الثقافة العامة 116. وجوب الأخذ بحديث الأحاد فى العقيدة 117. وصف الرحلة الأولي إلى الحجاز والرياض مرشدا للجيش السعودي 118. وضع الأصار فى ترتيب أحاديث مشكل الآثار 119. آداب الزفاف فى السنة المطهرة 120. أحاديث البيوع وآثاره 121. أحكام الجنائز 122. أحكام الركاز 123. إزالة الشكوك عن حديث البروك وغيره» مختلف زبانوں میں شیخ رحمہ اللہ کی بعض مؤلفات کے تراجم: یوں تو شیخ رحمہ اللہ کی متعدد مؤلفات کے تراجم اردو، انگریزی، ترکی، تامل، تلگو، بنگالی، سندھی، پشتو، تگالو، سنہالی، ملیالم اور فرانسیسی وغیرہ زبانوں میں طبع ہو چکے ہیں مگر جو تراجم خود راقم نے دیکھے ہیں وہ صفۃ صلاۃ النبی، کتاب الجنائز، سلسلۃ الأحادیث الضعیفۃ والموضوعۃ، حجیت ِحدیث کے اردو تراجم، مناسک الحج و العمرہ کا انگریزی ترجمہ اور صفۃ صلاۃ النبی کا ترکی ترجمہ ہے۔ حجیت ِحدیث کا اردو ترجمہ مولاناعبدالوہاب حجازی اور بدرُ الزماں نیپالی کی کوششوں کا نتیجہ ہے جو جامعہ سلفیہ بنارس سے طبع ہوا ہے جبکہ صفۃ صلاۃ النبی صلى الله عليه وسلم کا ترکی ترجمہ ڈاکٹر یونس وہبی یاغوز (مدرّس الفقہ بجامعۃ الدوغ، الکلیۃالشریعۃ) کی مساعی کانتیجہ ہے۔ شیخ رحمہ اللہ نے بعض سنتوں کو زندہ کیا، اور ان کے لئے باقاعدہ علمی خدمات اور کتابچے تحریر فرمائے۔ بعض مسائل کی طرف توجہ دلانے میں آپ کو انفرادی حیثیت حاصل تھی… آپ بعض مسائل میں دیگر علماء امت سے ایک منفرد موقف رکھتے تھے، بعض امور میں آپ کی مخصوص آراء تھیں… اسی طرح بعض لوگوں نے شیخ رحمہ اللہ کے مخصوص ذوقِ حدیث او رمقبولیت سے چڑ کھاتے ہوئے آپ پر بہتان طرازی کی، آپ کی علمی شخصیت کے بارے میں شبہات قائم کئے۔ ان تمام شبہات و افتراءات کا شیخ محمد بن ابراہیم شیبانی نے خوب تفصیلی جائزہ لیا ہے اور شیخ رحمہ الله کے دفاع کا حق اد اکر دیا ہے۔ مذکورہ بالا امور کی نشاندہی کتاب حیاۃ الألبانی (ص498 تا 538 جلد دوم) میں بڑی وضاحت سے کی گئی ہے، تفصیلات کے خواہشمند اس کتاب سے رجوع کریں۔ شیخ رحمہ اللہ کے اوصاف ِحمیدہ میں سے ایک امتیازی وصف: شیخ رحمہ اللہ کے اوصاف ِحمیدہ کا شمار اگرچہ ممکن نہیں ہے لیکن جو وصف آپ کو دوسروں سے بالکل نمایاں کرتا تھا، یہ ہے کہ آپ دوسروں کے ساتھ علمی مباحثہ کے دوران انصاف اور حق واضح ہو جانے پر بلا تردّد اپنی رائے سے رجوع کر لیتے تھے۔ حق کو قبول کرنے میں آپ قطعاً شرم محسوس نہیں کرتے تھے۔ یہی وجہ ہے کہ آپ نے اپنی بیشتر کتب، لیکچرز اور دورس میں اس مبارک اور نیک عادت کا اظہار کیا ہے۔ مختصر الشمائل محمدیۃ، صفۃ صلاۃ النبی صلی اللہ علیہ وسلم ، شرح العقیدۃ الطحاویۃ، مشکاۃ المصابیح، صحیح و ضعیف الجامع الصغیر و زیادتہ اور سلسلۃ الأحادیث الضعیفۃ والموضوعۃ وغیرہ کتب کے مقدمات آپ کے رجوع الی الحق پر شاہد ہیں۔ متعدد بار راقم کو بھی ذاتی طور پر آپ کی اس خصلت ِحمیدہ کا اعتراف کرنا پڑا ہے۔ شیخ رحمہ اللہ کے مشہور تلامذہ: شیخ رحمہ اللہ کے شاگرد بےشمار ہیں لیکن جنہیں بلاواسطہ شرفِ تلمذ حاصل ہے وہ بہت کم ہیں، جنہیں مباشرۃ تلمذ حاصل نہیں ہے، ان کی تعداد بہت ہے۔ یہ وہ لوگ ہیں جنہوں نے شیخ کی کتب یا آپ کے محاضرات اور دروس کی ریکارڈ شدہ کیسٹوں کے توسط سے استفادہ کیا ہے۔ ذیل میں آپ کے ان شاگردوں کا تذکرہ پیش خدمت ہے جنہیں آپ سے باقاعدہ اور مباشرۃً اکتسابِ علم کاشرف حاصل ہوا ہے: ➊ شیخ حمدی عبدالمجید السلفی جو معروف محقق اور صاحب ِتحقیقات و مؤلفات و تخریجاتِ علمیہ کثیرہ ہیں۔ 37 سے زیادہ کتب آپ کی مساعی جمیلہ کاثمرہ ہیں۔ ➋ شیخ عبدالرحمن عبدالخالق جو معروف مؤلف ہیں۔ متنوع علوم مثلاً دعوت و ارشاد، اقتصادِ اسلامی، نظام شورائیت، نظامِ حکم، سیاست اور تربیت ِاسلامیہ پر آپ کی 24 سے زیادہ مؤلفات ہیں۔ ➌ ڈاکٹرعمر سلیمان الاشقر جو 18 سے زیادہ کتابوں کے مؤلف اور شریعت فیکلٹی، کویت یونیورسٹی میں پروفیسر ہیں۔ ➍ شیخ خیر الدین وائلی جو 9 سے زیادہ وقیع کتابوں کے مؤلف ہیں۔ ➎ شیخ محمد عید عباسی جو آپ کے نمایاں تلامذہ اور خادموں میں شمار کئے جاتے ہیں۔ متنوع علوم میں متعدد مباحث کے مرتب ہیں۔ ➏ شیخ محمد ابراہیم شقرۃ جو شیخ رحمہ اللہ کے قریب تر تلامذہ میں شمار کئے جاتے ہیں، مسجد اَقصیٰ کے سر پرست اور مسجد صلاحُ الدین (عمان، اُردن) کے خطیب ہیں۔ 6 سے زیادہ نافع مؤلفات آپ کی کا وشوں کاثمرہ ہیں۔ ➐ شیخ عبدالرحمن عبدالصمد جوحلب و حماۃ وغیرہ شہروں میں شیخ کی خدمت میں سالہا سال رہے، جامع الوفرۃ (کویت) کے امام و خطیب ہیں اور صاحب ِمؤلفات وبحوثِ کثیرہ ہیں۔ ➑ شیخ محمد بن جمیل زینو جو شیخ کی خدمت میں حلب، حماۃ اور الرقۃ وغیرہ مناطق میں طویل عرصہ رہے، ایک عرصہ سے مدرسہ دارالحدیث الخیریۃ (مکۃ المکرمۃ) میں استاذ ہیں اور تقریباً 10 سے زیادہ کتابوں کے مؤلف ہیں۔ ➒ شیخ مقبل بن ہادی الوداعی جنہوں نے الجامعۃ الاسلامیۃ میں شیخ سے تیسرے سال میں قواعد مصطلح الحدیث و علم الاسناد پڑھا پھر شیخ کی خدمت میں رہے، آپ 10 سے زیادہ مفید مؤلفات کے مؤلف ہیں۔ ➓ شیخ زہیر الشاویش جو المکتب الاسلامی کے مالک اور متعدد کتب کے محقق اور مخرج ہیں۔ 19 سے زیادہ کتب آپ کی مساعی کا نتیجہ ہیں۔ ⓫ شیخ مصطفی الزربول جو وزارۃ الأوقاف الکویتیہ کی طرف سے امام مقرر ہیں۔ ⓬ شیخ علی خشان جو شیخ رحمہ اللہ کے شام میں خادم اور اَقرب تلامذہ میں شمار کئے جاتے ہیں، صاحب مؤلفات ہیں۔ ⓭ شیخ عبدالرحمن البانی ⓭ شیخ خلیل عراقی الحیانی شیخ رحمہ اللہ کی اولاد: اللہ تعالیٰ نے شیخ رحمہ اللہ کو تین بیویوں سے تیرہ بچے اور بچیاں عطا کی ہیں، چوتھی بیوی سے کسی اولاد کا علم نہیں ہے۔ پہلی بیوی سے عبدالرحمن، عبداللطیف، عبدالرزاق، دوسری بیوی سے عبدالمصور، عبدالاعلی، محمد، عبد المھیمن، انیسہ، آسیہ، سلامہ، حسانہ، سکینہ، اور تیسری بیوی سے ہبۃ اللہ۔ شیخ رحمہ اللہ کی علالت اور وفات: شیخ رحمہ اللہ گزشتہ کئی ماہ سے مسلسل بیمار تھے، علاج کی غرض سے ہسپتال میں داخل بھی رہے لیکن آخر کار 3 اکتوبر 1999ء کو اُردن میں فکر و بصیرت کا یہ روشن ستارہ، امت اسلامیہ کا یہ بطل جلیل، مقتدر عالم، باوقار مبلغ، دوراندیش مفتی، علم و فن کا امام، تصنیف و تالیف کے میدانوں کا شہسوار اور دعوت و تبلیغ کی محفلوں کی یہ شمع فروزاں بھی گل ہو گئی «فإنالله وانا اليه راجعون» آپ کی وفات سے عالم اسلام بلاشبہ ایک متبحر عالم، محدث عصر اور جلیل القدر مفسر سے محروم ہو گیا ہے۔ آپ کے ارتحال کی خبر پا کر دنیا کے اطراف و اکناف میں علومِ حدیث کے شائقین کے چہرے سوگوار ہو گئے۔ مشاہیر نے آپ کی وفات کو پوری امت کا عظیم خسارہ قرار دیا ہے۔ اگر یہ کہا جائے کہ تمام عالم اسلام آپ کی جدائی پر ماتم کناں ہے تو غلط نہ ہو گا کہ ؎ ہزاروں سال نرگس اپنے بے نوری پر روتی ہے بڑی مشکل سے ہوتا ہے چمن میں دیدہ ور پیدا اللہ ربّ العزت آپ کی تمام مساعی جمیلہ کو شرف قبولیت بخشے، آپ کو کشادہ جنت میں جگہ عطا فرمائے اور پسماندگان کو صبر جمیل کی توفیق بخشے۔ آمین!"
}