{
    "book_name": "Sunan Al Daraqutni",
    "urdu_text": "سوانح حیات امام الدار قطنی رحمہ اللہ ابو الحسن علی بن عمر بن احمد بن مہدی دار قطنی بغدادی، حدیث میں اپنے زمانے کے یکتا امام اور حافظ، احادیث، علل اور اسماء الرجال کے زبردست عالم تھے۔ علاوہ ازیں قرات اور اس کے طرق، فقہ اور اختلافات، انساب اور ادب میں بھی زبردست مہارت رکھتے تھے۔ ان کی مشہور تالیف \"السنن\"، \"علل\" اور \"الفوائد الافراد\" ہے۔ ان کی وفات سنہ 385ھ میں ہوئی۔ پورا نام، امام حافظ ابو الحسن علی بن عمر بن احمد بغدادی ہے، \"دارقطنی\" کے لقب سے مشہور ہیں۔ بغداد کے شہر \"دار القطن\" میں 306ھ میں پیدا ہوئے۔ قاری، محدث، لغوی اور ادیب تھے۔ علوم قرآن اور حدیث میں ان کی قیمتی تالیفات ہیں۔ نام ونسب علی، کنیت ابو الحسن۔لقب:شیخ الاسلام،امام الحدیث،حافظ الحدیث۔ سلسلۂ نسب یہ ہے: علی بن عمر احمد بن مہدی بن مسعود بن نعمان بن دینار بن عبد اللہ بغدادی دارقطنی۔ آپ کا مولد و مسکن بغداد معلیٰ کا محلہ \"دار قطن\" ہے جس کی طرف نسب کرتے ہوئے دار قطنی کہلائے۔ تاریخِ ولادت امام دارقطنی کی ولادت 306ھ،بمطابق 918ء میں ہوئی۔ تحصیلِ علم ان کا خاندان، اہل علم و فضل خاندان تھا، ان کے والد ثقہ محدث تھے۔ بچپن ہی سے علم و حدیث کے حلقوں میں شرکت کرنے لگے تھے اور سماعات و روایات کو لکھنے اور جمع کرنے لگے تھے۔ قوت حافظہ انتہائی کمال کا تھا، سب سے پہلی کتاب سنہ 315ھ میں لکھی جب ان کی عمر صرف نو سال تھی امام دراقطنی نے دنیائے اسلام کے عظیم علمی شہر بغداد معلیٰ میں نشو و نما پائی جو عباسیوں کا پایۂ تخت اور علم و علما کاعظیم مرکز تھا جہاں کے ذروں سے علم و فن کی کرنیں پھوٹتی تھیں۔ آپ کا گھر بھی علم کی تجلیوں سے معمور تھا والد عمر بن احمد کا شمار محدثین میں ہوتا تھا۔جن کی آغوش میں امام دار قطنی نے پرورش پائی اور صغر سنی ہی سے طلب علم کا شوق پروان چڑھنے لگا۔ جب آپ کی عمر نو سال کی تھی درس حدیث میں شرکت شروع کردی۔ اساتذہ بچپن سے ہی بڑے بڑے ائمہ کرام سے تعلیم حاصل کی جن میں ابی القاسم البغوی، یحیی بن محمد بن صاعد، ابی بکر بن ابی داود، ابی بکر النیسابوری، الحسین بن اسماعیل المحاملی، ابی العباس ابن عقدہ، اسماعیل الصفار ابن ساعد، حضرمی، ابن درید، ابن فیروز، علی بن عبد اللہ بن بشر محمد بن قاسم محاربی، ابو علی محمد بن سلیمان مالکی، ابو عمر قاضی ابو جعفر احمد بن بہلول، ابن زیاد نیشاپوری بدر بن ہشم قاضی، احمد بن قاسم فرائضی، حافظ ابو طالب۔ ان کی تعریف میں بہت سے ائمہ کرام نے لکھا جن میں، الحافظ ابو عبد اللہ الحاکم، الحافظ عبد الغنی، تمام الرازی، ابو نعیم الاصبہانی، ابو بکر البرقانی، ابو عبد الرحمن السلمی، ابو حامد الاسفرایینی، قاضی ابو الطیب الطبری، حمزہ السہمی اور دیگر شامل ہیں۔ علمی سفر جوانی میں شام اور مصر گئے اور ابن حیویہ النیسابوری اور ابی الطاہر الذہلی اور دیگر سے درس لیا، وہ علل حدیث اور رجالِ حدیث کے عارف تھے، قراتیں اور ان کے انداز کے متقدمین میں سے تھے، فقہ، اختلاف اور مغازی اور ایام الناس پر بھی دسترس رکھتے تھے۔ حافظ عبد الغنی الازدی فرماتے ہیں: رسول اللہ صلی اللہ علیہ وسلم کی حدیث پر سب سے بہتر دسترس رکھنے والے تین 3 ہیں: اپنے وقت میں ابن المدینی، اپنے وقت میں موسی بن ہارون اور اپنے وقت میں دارقطنی۔ تالیفات وہ کثیر التصنیف تھے، ان کی تصانیف 80 سے زائد ہیں، جن میں العلل والسنن ان کی مایہ ناز کتاب ہے، کچھ دیگر تصانیف یہ ہیں: سنن دارقطنی الافراد والغرائب المؤتلف والمختلف فی اسماء الرجال الضعفاء والمتروکون الالزامات علی صحیحی البخاری ومسلم وفات 8 ذو القعدہ سنہ 385ھ کو امام دارقطنی کی بغداد میں وفات ہوئی اور بغداد کے قبرستان باب الدیر میں معروف الکرخی کی قبر کے نزدیک دفن ہوئے۔ علما کی آرا امام ذہبی ان کے بارے میں سیر اعلام النبلاء میں لکھتے ہیں: \"علم کے سمندر اور دنیا کے امام تھے، حفظ اور علل حدیث و رجال کے علم میں منتہی الکمال تھے، نیز قرات، فقہ، اختلاف، مغازی اور تاریخ وغیرہ پر بھی کمال حاصل تھا۔\" ابو بکر خطیب فرماتے ہیں: \"دارقطنی اپنے زمانے کے یکتا تھے، امام زمانہ تھے، حدیث، علل اور اسماء الرجال میں تن تنہا مرجع اور منتہی تھے۔ اس کے ساتھ صدوق، ثقہ، صحیح العقیدہ، علم حدیث کے علاوہ علوم کے بھی ماہر تھے۔\""
}