{
    "book_name": "Sunan Darmi",
    "urdu_text": "سوانح حیات امام دارمی رحمہ اللہ سوانح حیات​:​ نام و نسب: آپ کا نام عبداللہ بن عبدالرحمٰن بن الفضل بن بہرام بن عبدالصمد ہے۔ کنیت: ابومحمد، اور نسبت التمیمی، الدارمی، السمرقندی ہے۔ تمیمی: تمیم بن مرۃ، دارمی: بنودارم اور سمرقندی: سمرقد کی طرف منسوب ہے جو موجودہ اوزبکستان (روسی ممالک) کا معروف و مشہور شہر ہے، جسے قتیبہ بن مسلم نے فتح کیا تھا، پھر چنگیز خاں اور تیمور لنگ نے اسے اپنا پایہ تخت بنایا تھا۔ پیدائش: آپ 181ھ میں پیدا ہوئے، جیسا کہ خود ان کی صراحت سے واضح ہے، کہا جاتا ہے کہ امام دارمی، امام بخاری سے 13 سال قبل سمرقند میں پیدا ہوئے۔ تعلیم و تربیت: آپ عربی النسل تھے اور عربی گھرانوں کے رواج کے مطابق سب سے پہلے قرآن پاک حفظ کیا، اور پھر ابتدائی تعلیم کے بعد حدیث رسول (على صاحبہ التحیۃ و السلام) کی طرف متوجہ ہوئے، اس وقت سمرقند و بخاریٰ علم کے گہوارے بن چکے تھے، اور امام دارمی اسی گہوارے میں پلے بڑھے، ایمان و عقیدہ، علم و حلم، اطمینان و سکون، فن و فکر اور اطاعت و محبت جیسی صفات کے مالک بنے، جتنا کچھ ہو سکا وہیں علم حاصل کیا، جب تشنگی اور بڑھی تو علم کی خاطر بہت سے سفر کئے اور آپ کو رحّال کے لقب سے پکارا جانے لگا۔ اساتذہ کرام: آپ نے خراسان جا کر وہاں عثمان بن جبلہ و محمد بن سلام اور ان کے ہم عصر دیگر فقہائے عظام اور محدثین کرام سے سماعت کی، بصرہ و کوفہ کے اساتذہ میں عبیداللہ بن موسیٰ، ابونعیم، روح بن عبادہ وغیرہم سے تعلیم حاصل کی۔ مصر تشریف لے گئے اور وہاں سعید بن ابی مریم و ابوصالح وغیرہ سے سماع حدیث کیا۔ حجاز پہنچ کر المقری، الحمیدی و ابن ابی اویس کے سامنے زانوئے تلمذ تہہ کیا، شام کا سفر کیا اور وہاں محمد بن یوسف الفریابی، ابوالیمان، ابومسہر وغیرہم سے کسب فیض کیا، اور دیگر بہت سے اس وقت کے علماء محدثین اور فقہائے کرام سے علم کی پیاس بجھائی۔ حافظ مزی رحمہ اللہ نے آپ کے اساتذہ کی تعداد 114 کے قریب ذکر کی ہے۔ اس طرح دوسری صدی ہجری کے نابغہ روزگار علماء کی تعلیم و تربیت اور صحبت نے آپ کے اندر علم و عمل، قرآن و سنت سے محبت کی قندیلیں آپ کے دل میں روشن کر دیں، اور اللہ تعالیٰ نے ان کو ایک زبردست عالم، محدث اور فقیہ و مدبر ہونے کا شرف بخشا، دولت دنیا، جاہ و مرتبہ آپ کے قدموں میں آ گرے، لیکن آپ نے سب کچھ پائے حقارت سے ٹھکرا دیا، خلیفہ وقت کے اصرار پر سر تسلیم خم کرتے ہوئے قاضی کا عہدہ قبول تو کر لیا لیکن ایک مقدمے کا فیصلہ کرنے کے بعد استعفیٰ دے دیا، اور اپنے وطن سمرقند میں ہی مسند تعلیم و تدریس سنبھالی اور اس کا حق ادا کر دیا، اس وقت تک وہاں مسلمانوں میں اطاعت کے بجائے بدعات در آئیں تھیں، آپ نے سنت کی اہمیت، اطاعت و پیروی اور قرآن و سنت سے محبت کو اجاگر کیا، اور قال اللہ و قال الرسول کو اپنا اوڑھنا بچھونا بنا لیا حتی کہ کتاب و سنت کے چرچے عام ہوئے اور آپ کی شہرت دور دور تک پہنچی اور تشنگان علوم نبوت جوق در جوق آپ کی طرف آنے لگے۔ بعض مشہور تلامذہ: امام دارمی کے لئے یہ بات باعث فخر ہے کہ تیسری صدی ہجری کے نامور محدثین، مؤقر ائمہ کرام، خدام سنت رسول صلی اللہ علیہ وسلم نے آپ سے سماعت کی، چنانچہ امام بخاری رحمۃ اللہ علیہ نے صحیح کے علاوہ دوسری اپنی مؤلفات میں اور امام مسلم رحمۃ اللہ علیہ نے صحیح مسلم میں آپ سے روایات نقل کی ہیں، اسی طرح ابوداؤد، ترمذی و ابراہیم النیساپوری، احمد السجستانی، اسحاق الوراق، بقی بن مخلد الاندلسی، جعفر بن محمد الفریابی، محمد بن الفضل السجستانی، حسن بن الصباح البزار (و ہو اکبر منہ) عبداللہ بن محمد السمرقندی، ابوحاتم محمد بن ادریس الرازی، ابوزرعہ عبیداللہ الرازی وغیرہم نے آپ سے علم تفسیر و حدیث کا درس لیا۔ حافظ مزی نے ایسے تقریباً آپ کے 40 نامور جہابذۃ العلم تلامیذ کے نام درج کئے ہیں وغیرہم کثیرون۔ آپ کے بارے میں علماء کے اقوال: امام دارمی رحمۃ الله علیہ کو ان کے علم و عمل، زہد و تقویٰ، بذل و عطاء، خلوصِ وللّٰہیت کے عوض الله تعالیٰ نے جو مقام و مرتبہ عطا فرمایا اس کی جھلک علماء کرام و محدّثین عظام کے اقوال میں دیکھی جا سکتی ہے۔ امام احمد بن حنبل رحمۃ اللہ علیہ نے فرمایا: ان کے سامنے دنیا پیش کی گئی لیکن انہوں نے اسے قبول نہ کیا، امام احمد کے فرزند عبداللہ نے فرمایا: «كان ثقة و زيادة و اثنى عليه خيرًا» ۔ عبدالصمد بن سلیمان بلخی نے فرمایا: میں نے امام احمد بن حنبل سے یحییٰ الحمانی کے بارے میں پوچھا تو انہوں نے کہا: عبداللہ بن عبدالرحمٰن (امام دارمی) کے فرمان کی وجہ سے اس کو ہم نے چھوڑ دیا۔ اسحاق بن داؤد السمرقندی نے فرمایا: شاش سے میرے ایک رشتے دار آئے تو انہوں نے کہا: میں امام احمد بن حنبل کے پاس گیا تھا۔ اور میں ابوالمنذر کا ذکر کرنے لگا تو انہوں نے فرمایا: عبداللہ بن عبدالرحمٰن (دارمی) کو چھوڑ کر کہاں جا پھنسے، ان کی مجلس اختیار کرو، وہ سید ہیں، امام ہیں۔ اسی طرح محمد بن ابراہیم سمرقندی کا بیان ہے، نیز فرمایا: میرے لئے کفر پیش کیا گیا تو میں نے اسے ناپسند کیا، دارمی پر دنیا پیش کی گئی جسے انہوں نے ٹھکرا دیا۔ محمد بن عبد الله بن نمیر نے فرمایا: عبداللہ بن عبدالرحمٰن (دارمی) حفظ و اتقان، زہد و ورع میں ہم پر فوقیت لے گئے۔ ابن ابی شیبہ نے فر مایا: علم و بصیرت، حفظ و اتقان اور زہد و ورع میں دارمی کی امامت اظہر من الشمس ہے۔ ابو حاتم رازی نے فرمایا: عراق میں جتنے لوگ وارد ہوئے بخاری سب سے زیادہ علم والے، خراسان میں محمد بن یحییٰ سب سے زیادہ علم والے، محمد بن اسلم سب سے زیادہ زہد والے اور عبداللہ بن عبدالرحمٰن (دارمی) سب سے زیادہ حفظ و اتقان والے تھے۔ امام رازی نے فرمایا: عبداللہ بن عبدالرحمٰن اپنے وقت کے امام تھے۔ ابوحامد الشرقی نے کہا: خراسان میں علمِ حدیث کے پانچ امام ہوئے: محمد بن یحییٰ، محمد بن اسماعیل، عبداللہ بن عبدالرحمٰن (دارمی)، مسلم بن الحجاج اور ابراہیم بن ابی طالب۔ محمد بن ابراہیم الشیرازی نے فرمایا: امام دارمی عقیدہ اور علم و عمل میں انتہاء کو پہنچے ہوئے تھے، جن کی فقہ و علم، حفظ و عبادت، زہد و ورع میں مثال دی جاتی تھی، علمِ حدیث و آثار کی سمرقند میں آبیاری کی، اپنے وطن میں سنت کو اجاگر کیا، اس کی طرف لوگوں کو بلایا اور وہ مفسر کامل و فقیہ و عالم تھے۔ ابن حبان نے فرمایا: دارمی حفظ و اتقان والوں میں سے دین کے زاہدین میں سے تھے جنہوں نے علم اکٹھا کیا، یاد کیا، فقہ حاصل کی پھر تصنیف و تالیف اور سنت کی تعلیم میں لگ گئے۔ اور اپنے وطن میں سنتِ رسول کو اجاگر کیا، اس کی طرف لوگوں کو بلایا اور اس کا دفاع کیا، اور اس کے مخالفین کا قلع قمع کیا۔ خطیب نے کہا: وہ حدیث کی راہ میں سفر کرنے والوں میں سے ایک تھے جو اپنے حفظ و اتقان، جمع و ترتیب، صدق و صفا، زہد و تقویٰ سے مزین تھے۔ ان کو سمرقند کا قاضی بنانا چاہا تو انکار کر دیا، لیکن انہیں سلطان کے اصرار پر یہ عہدہ قبول کرنا پڑا اور صرف ایک مقدمے کا فیصلہ کر کے استعفیٰ دیدیا۔ محمد بن بشار نے کہا: دنیا کے چار حفاظ ہیں: ريّ میں ابوزرعۃ، نیساپور میں مسلم بن الحجاج، سمرقد میں عبداللہ بن عبدالرحمٰن دارمی، بخاریٰ میں محمد بن اسماعیل البخاری (رحمہم الله تعالیٰ)۔ امام دارقطنی نے فرمایا: وہ ثقہ و مشہور ہیں۔ امام ذہبی نے فرمایا: وہ دین کے ارکان میں سے ایک رکن تھے .... الخ۔ حافظ ابن حجر نے فرمایا: «ثقةٌ، فاضلٌ، متقِنٌ» ۔ ابن العماد نے فرمایا: «الإمام الحبر أبو محمد عبدالله بن عبدالرحمٰن التميمي الدارمي الحافظ الثقة» . احمد بن سیار المروزی نے فرمایا: «كان الدارمي حسن الحديث قد دون المسند و التفسير»، اور صفدی نے کہا: وہ علم کا خزانہ تھے۔ اجتہاد کرتے تقلید نہ کرتے تھے۔ علم کی راہ میں سفر کرنے والے، اور حفاظ میں سے تھے۔ سچائی اور زہد سے موصوف تھے۔ دین و تقویٰ میں ان کی مثال دی جاتی۔ ان کے بہت سارے مناقب ہیں۔ وفات: امام دارمی رحمہ اللہ 255ھ میں ترویہ کے دن عصر کے بعد تقریباً 74 یا 75 سال کی عمر پا کر اس دنیا سے انتقال کر گئے، اور جمعہ کے دن یوم عرفہ میں آپ کی تدفین عمل میں آئی۔ آپ نے بہت سے وارثین علم أرشد تلامذہ اور حدیث کی یہ عظیم کتاب سنن الدارمی ورثے میں چھوڑی۔ اللہ تعالیٰ ان کی محنت و مشقت کو قبول فرمائے اور قیامت تک انہیں اس کا اجر جزیل عطا فرمائے۔"
}