{
    "book_name": "Tirmazi",
    "urdu_text": "نام و نسب و کنیت: نام محمد اور کنیت ابوعیسی ہے، اور نسب یہ ہے: محمد بن عیسیٰ بن سورہ بن موسیٰ بن ضحاک سلمی بوغی ترمذی، اکثر روایات کے مطابق آپ کا نسب نامہ یہی ہے۔ بعض اقوال کے مطابق آپ کا نسب نامہ یوں ہے: محمد بن عیسیٰ بن سورہ بن شداد سلمی بوغی ترمذی ہے۔ یعنی موسیٰ بن ضحاک کے بجائے شداد ہے جیسا کہ سمعانی کی کتاب الأنساب میں ہے، تہذیب الکمال للمزی میں یوں ہے: محمد بن عیسیٰ بن سورہ بن سکن سلمی بوغی ترمذی، یعنی ابن موسیٰ کے بجائے ابن سکن ہے۔ ولادت و خاندان: امام ترمذی رحمۃ اللہ علیہ کی پیدائش غالبا 210 ھ کے حدود میں ہوئی، بعض علماء کے قول کے مطابق 209 ھ میں ہوئی۔ آپ کے دادا مروزی تھے، لیث بن یسار کے دور میں مرو سے ترمذ منتقل ہوئے اور وہیں سکونت اختیار کر لی، نہر بلخ جسے نہر جیحون بھی کہتے ہیں پر واقع شہر ترمذ میں امام ترمذی کی پیدائش ہوئی، پیدائش اور سکونت کی وجہ سے ترمذی کی نسبت سے مشہور ہوئے۔ ترمذ «ت» اور «م» کے کسرے (زیر) سے مشہور ہے، «ت» کے زبر اور پیش کے ساتھ بھی آیا ہے۔ قبیلہ غیلان کی شاخ ”بنی سلیم“ کی نسبت سے سلمی کہلاتے ہیں، اور بوغ ترمذ کے قریب ایک گاؤں کی نسبت سے بوغی، جو ترمذ سے چھ فرسخ کی دوری پر واقع تھا، اور جہاں پر آپ کی وفات ہوئی تھی۔ نابینا لیکن بابصیرت محدث: امام ترمذی کے بارے میں ایک قول یہ ہے کہ آپ پیدائشی طور پر نابینا تھے، لیکن صحیح بات یہ ہے کہ کبرسنی میں علمی اسفار کرنے اور احادیث لکھنے لکھانے کے بعد آپ کی بصارت جاتی رہی، اس کا سبب زیادہ لکھنا پڑھنا بھی ہو سکتا ہے۔ اور بقول امام حاکم کے آخری عمر میں اللہ کے ڈر سے اتنا روئے کہ بینائی جاتی رہی، اور اسی حالت میں زندگی کے کئی سال گزرے۔ [تذكرة الحفاظ 634/2، تهذيب التهذيب] یہ عجیب اتفاق ہے کہ سنن ترمذی کے عظیم شارح علامہ عبدالرحمن محدث مبارکپوری بھی آخری عمر میں اور سنن ترمذی کی شرح کی تکمیل سے پہلے نابینا ہو گئے، تو آپ کے ارشد تلامذہ نے آپ کی نگرانی میں شرح کی تکمیل کا کام کیا۔ طلب حدیث کے لیے بلاد اسلامیہ کا سفر: محدثین کے طریقہ کے مطابق امام ترمذی نے احادیث کی روایت و تحصیل کے لئے بلاد اسلامیہ کے علمی مراکز کا سفر کیا، اور حجاز (مکہ مکرمہ و مدینہ منورہ)، بغداد (عراق) جزیرہ، بصرہ، واسط اور خراسان وغیرہ کے علماء سے بکثرت سماع حدیث کیا، مصر اور شام نہ جا سکے۔ حافظ ذہبی اور ابن حجر کہتے ہیں: امام ترمذی نے بلاد اسلامیہ کا سفر کیا، اور خراسانی، عراقی اور حجازی وغیرہ رواۃ کی ایک بڑی تعداد سے سماع حدیث کیا، امام ترمذی نے نیساپور، مرواور اصبہان وغیرہ کے محدثین کی خدمت میں حاضر ہو کر ان سے استفادہ کیا۔ اساتذہ و شیوخ: آپ کا زمانہ علوم حدیث کے عروج اور ترقی کا زمانہ تھا چنانچہ آپ نے بہت سارے محدثین کو پایا، ان سے اکتساب فیض کیا، احادیث سنیں اور روایت کیں، حافظ ذہبی نے تذکرۃ الحفاظ اور سیر أعلام النبلاء میں آپ کے اساتذہ و شیوخ حدیث کی ایک فہرست دی ہے جن سے آپ نے سماع حدیث کیا، ان میں سے بعض مشاہیر درج ذیل ہیں: ➊ ابراہیم بن عبداللہ بن حاتم ہروی (م: 244ھ) ➋ ابومصعب احمد بن ابی بکر الزہری المدنی (م: 242ھ) ➌ احمد بن منیع ➍ اسحاق بن راہویہ ➎ اسماعیل بن موسیٰ فزاری سدی (م: 245ھ) ➏ ابوداود سلیمان بن الاشعث (صاحب سنن) (م: 275ھ) ➐ سوید نصر بن سوید مروزی (م: 243ھ) ➑ عبداللہ بن معاویہ جمحی۔ (م: 243ھ) ➒ علی بن حجر مروزی (م: 244ھ) ➓ علی بن سعید بن مسروق الکندی الکوفی (م: 249ھ) ⓫ عمرو بن علی الفلاس (م: 942ھ) ⓬ محمد بن بشار بندار (م: 252ھ) ⓭ قتیبہ بن سعید ثقفی ابورجاء (م: 240ھ) ⓮ محمد بن عبدالملک بن ابی الشوارب (م: 244ھ) وغیرہ وغیرہ ⓯ محمود بن غیلان مروزی بغدادی (239ھ) ⓰ اور روایت حدیث کے ساتھ علوم حدیث و رجال اور فقہ حدیث امام محمد بن اسماعیل بخاری سے حاصل کی۔ ⓱ امام مسلم سے بھی آپ نے سماع حدیث کیا ہے، اور اپنی جامع کے اندر ان سے ایک روایت بھی نقل کی ہے۔ تلامذہ: امام ترمذی سے بہت سارے علمائے حدیث کو شرف تلمذ حاصل ہے، جن میں سے بعض رواۃ مندرجہ ذیل ہیں: ➊ ابوبکر احمد بن اسماعیل بن عامر السمرقندی ➋ ابوحامد احمد بن عبداللہ بن داود المروزی ➌ احمد بن علی بن حسنویہ المقریٔ ➍ احمد بن یوسف نسفی ➎ ابو الحارث اسد بن حمدویہ ➏ حماد بن شاکر وراق نسفی ➐ مکحول بن فضل نسفی ➑ محمود بن عنبر نسفی ➒ ابوالفضل محمد بن محمود بن عنبر نسفی ➓ عبدبن محمد بن محمود نسفی ⓫ داود بن نصر بن سہیل برزوی ⓬ محمد بن مکی بن نوح نسفی ⓭ محمد بن سفیان بن نضر نسفی ⓮ محمد بن منذر بن سعید ہروی ⓯ ہیثم بن کلیب شاشی (الشمائل کے راوی) ⓰ محمد بن محبوب ابوالعباس محبوبی مروزی (سنن الترمذی کے راوی) ⓱ امام بخاری نے بھی آپ سے ایک حدیث روایت کی ہے جس کے بارے میں امام ترمذی کہتے ہیں کہ یہ حدیث محمد بن اسماعیل نے مجھ سے سنی، وہ حدیث یہ ہے: «عن أبى سعيد: يا على لا يحل لأحد أن يجنب فى المسجد غيري وغيرك.» [سنن الترمذي 3727] زہد و تقویٰ: امام ترمذی نہ صرف یہ کہ علوم و فنون میں امامت کا درجہ رکھتے تھے بلکہ آپ عبادت و تقویٰ اور ورع اور زہد میں بھی شہرت رکھتے تھے، حاکم کہتے ہیں: امام بخاری کا انتقال ہوا تو انہوں نے علم حفظ اور زہد ورع میں ترمذی کی طرح کسی اور کو اپنے پیچھے نہیں چھوڑا، آپ اللہ کے ڈر سے اتنا روتے تھے کہ اندھے ہو گئے، اور کئی سال اندھے رہے۔ [تذكرة الحفاظ، تهذيب التهذيب] تصانیف: امام ترمذی رحمہ اللہ کو چونکہ حدیث اور علوم حدیث کے علاوہ تاریخ، فقہ اور تفسیر وغیرہ پر بھی کافی دسترس حاصل تھی لہٰذا انہوں نے مختلف موضوعات پر قلم اٹھایا اور بہت سی علمی کتب تصنیف کیں جن میں سے چند معروف کتب یہ ہیں: ➊ «كتاب الجامع» جو سنن ترمذی کے نام سے مشہور ہے۔ ➋ «الشمائل النبوية» جو شمائل ترمذی کے نام سے مشہور ہے اور یہ آنحضرت صلی اللہ علیہ وسلم کی سیرت کے متعلق احادیث میں ایک بہترین تصنیف ہے جیسا کہ عبد الحق محدث دہلوی نے «أشعة اللمعات» میں اس کی تعریف فرمائی ہے۔ ➌ «كتاب العلل» اس موضوع پر آپ کی دو کتابیں ہیں: ① «كتاب العلل الصغير» اور ② «كتاب العلل الكبير» ‏‏‏‏ جس میں امام ترمذی نے زیادہ تر اپنے استاذ امام بخاری رحمہ اللہ سے استفادہ کیا ہے۔ ➍ «كتاب الزهد » ‏‏‏‏ ➎ «كتاب التاريخ» ‏‏‏‏ ‏‏‏‏ ➏ «الأسماء والكنٰي » ‏‏‏‏ ➐ «كتاب التفسير» ➑ «كتاب الجرح والتعديل» وفات: امام ترمذی رحمہ اللہ کا انتقال مشہور روایت کے مطابق 13 رجب 279ھ میں 2 شنبہ کی شب کو خاص ترمذ شہر میں ستر سال کی عمر میں ہوا۔ لیکن ابن خلکان رحمہ اللہ نے سمعانی رحمہ اللہ کے حوالہ سے لکھا ہے ”امام ترمذی بوغ بستی میں 279ھ میں فوت ہوئے“ جو کہ ترمذ سے چھ فرسخ (اٹھارہ میل) کے فاصلے پر واقع ہے۔ امام ترمذی کے علم و فضل اور قوت حافظہ کے بارے میں علماء اور محدثین کے اقوال:​ حفاظ حدیث میں مقام: امام ترمذی رحمہ اللہ متفق علیہ مشہور ثقہ حافظ حدیث امام ہیں ان کو حفاظ حدیث میں بہت بڑا مقام حاصل ہے۔ امام ترمذی رحمہ اللہ کہتے ہیں: میرے استاد امام بخاری رحمہ اللہ نے مجھ سے کہا کہ جتنا تم نے مجھ سے فائدہ حاصل کیا اتنا فائدہ میں تم سے حاصل نہ کر سکا۔ [تهذيب الكمال] ابو اسعد عبدالرحمن بن محمد ادریسی: ابو اسعد عبدالرحمن بن محمد ادریسی کہتے ہیں: ابوعیسی ترمذی حفظ حدیث میں ضرب المثل تھے، اس سلسلے کا ایک واقعہ وہ اپنے شیخ ابوبکر احمد بن محمد بن حارث مروزی سے روایت کرتے ہیں کہ انہوں نے احمد بن عبداللہ بن داود کو یہ کہتے سنا کہ میں نے امام ترمذی کو کہتے سنا: ایک بار میں مکہ کے راستے میں تھا اور میں نے ایک شیخ کی احادیث کے دو جزء لکھے تھے، مجھے شیخ ملے تو میں نے آپ سے سماع حدیث کا مطالبہ کیا، میں سمجھ رہا تھا کہ شیخ کی احادیث کے دونوں جزء میرے پاس ہیں، آپ نے قرأت حدیث پر آمادگی ظاہر کی، میں کیا دیکھتا ہوں کہ میرے پاس سادہ کاغذوں کے دو جزء ہیں، شیخ یہ احادیث پڑھ کر مجھے سنانے لگے اور مجھے دیکھا کہ میرے ہاتھ میں سادہ کاغذ ہے، اور مجھ سے کہا: تمہیں ایسا کرتے مجھ سے شرم نہیں آتی تو میں نے صورت حال سے آپ کو باخبر کیا، اور عرض کیا کہ مجھے ساری احادیث یاد ہیں، تو آپ نے کہا کہ پڑھو میں نے انہیں پڑھ کر سنایا تو انہوں نے میری تصدیق نہ کی اور کہا کہ کیا آنے سے پہلے تم نے ان احادیث کو یاد کر لیا تھا؟ میں نے عرض کیا کہ آپ مجھے دوسری حدیثیں سنائیں، تو آپ نے چالیس حدیثیں مجھے پڑھ کر سنائیں پھر مجھ سے کہا کہ لاؤ سناؤ، تو میں نے ان کو پڑھ کر سنا دیا، ایک بھی حرف کا فرق نہ تھا تو انہوں نے کہا: میں نے تمہارے جیسا کسی کو نہیں دیکھا۔ [تهذيب التهذيب، السير 273/13] حافظ ابو یعلیٰ: حافظ ابو یعلیٰ کا بیان ہے: ”محم دبن عیسیٰ بن سورہ، متفق علیہ ثقہ حافظ حدیث امام ہیں، ان کی حدیث میں ایک کتاب ہے نیز جرح و تعدیل میں ان سے بہت سارے اقوال منقول ہیں ... وہ امانت، دیانت اور علم میں ایک مشہور امام ہیں۔“ حافظ ابو سعد عبدالرحمن بن محمد ادریسی: حافظ ابو سعد عبدالرحمن بن محمد ادریسی کہتے ہیں: علم حدیث میں جن ائمہ کی اقتداء کی جاتی ہے، امام ترمذی ان میں سے ایک امام تھے، آپ نے جامع، تواریخ اور علل نامی کتابیں تصنیف فرمائیں، آپ کی تصانیف پختہ عالم دین کی تصانیف ہیں، آپ حفظ حدیث میں ضرب المثل تھے۔ [شروط الأئمه السته: ص20، تهذيب التهذيب 386/9] امام ابن حبان: امام ابن حبان اپنی کتاب الثقات میں امام ترمذی رحمہ اللہ کے بارے میں فرماتے ہیں: ”یہ ان ائمہ حدیث میں سے ہیں جنہوں نے احادیث جمع کیں، علم حدیث میں کتابیں لکھیں، احادیث کو حفظ کیا اور اس کا مذاکرہ کیا۔ [الثقات، تذكرة الحفاظ، نكت الهميان للصفدي، تهذيب الكمال] امام سمعانی: امام سمعانی فرماتے ہیں: ”امام ترمذی رحمہ اللہ بلا اختلاف اپنے عہد کے امام اور صاحب تصانیف تھے اور ان ائمہ حدیث میں سے ہیں جن کی علم حدیث کے اندر اقتداء کی جاتی تھی۔“ امام ابن خلکان: ”امام ترمذی بلا اختلاف اپنے عہد کے امام اور صاحب تصانیف تھے اور ان ائمہ حدیث میں سے ہیں جن کی علم حدیث کے اندر اقتداء کی جاتی تھی۔“ اسی جیسی بات امام ابن خلکان نے بھی کہی ہے۔ [الأنساب، وفيات الاعيان] امام حاکم: امام حاکم کہتے ہیں: میں نے عمر بن علک کو یہ کہتے سنا: امام بخاری کا انتقال ہوا تو انہوں نے خراسان میں علم، حفظ اور ورع و زہد میں ابوعیسیٰ ترمذی کی طرح کسی اور کو نہیں چھوڑا، ترمذی اتنا روئے کہ اندھے ہو گئے اور کئی سال اندھے رہے۔ [السير 273/13، تذكرة الحفاظ 634/2، تهذيب التهذيب 389/9] محدث خراسان امام ابو احمد حاکم نیساپوری (م: 378ھ) نے اپنے ایک شیخ سے یہ بات نقل کی ہے کہ جس وقت امام محمد بن اسماعیل کا انتقال ہوا اس وقت انہوں نے اپنے شاگردوں میں امام ترمذی سے بڑھ کر کسی کو علم، حفظ، زہد و ورع میں نہیں چھوڑا، ترمذی خوف الٰہی اس قدر روتے تھے کہ نابینا ہو گئے۔ امام حافظ ابو الفضل محمد بن طاہر مقدسی: امام حافظ ابو الفضل محمد بن طاہر مقدسی کا بیان ہے: ”محمد بن عیسیٰ بن سورہ ترمذی جو کہ نابینا تھے ان ائمہ حدیث میں سے ہیں جن کی علم حدیث کے اندر اقتداء کی جاتی تھی۔ انہوں نے علم حدیث، تاریخ اور علل میں کتابیں لکھی ہیں جو ایک متبحر عالم کی تصنیفات ہیں حفظ حدیث میں ان کو بطور مثال ذکر کیا جاتا ہے۔ امام مزی: امام مزی کہتے ہیں: ”وہ حافظ حدیث صاحب الجامع اور دیگر کتابوں کے مصنف ہیں، نیز حفظ اور ثقاہت کے اعتبار سے دنیا کے اماموں میں سے ایک تھے جن کے ذریعہ سے اللہ تعالیٰ نے امت کو نفع پہنچایا۔“ [تهذيب الكمال] امام ذہبی: امام ذہبی سیر أعلام النبلاء میں امام ترمذی کو حافظ، علم، امام، بارع کا خطاب دیتے ہیں اور کہتے ہیں کہ آپ جامع اور علل وغیرہ کے مصنف ہیں۔ اور تذکرۃ الحفاظ میں فرماتے ہیں کہ امام ترمذی حافظ حدیث، صاحب الجامع متفق علیہ ثقہ تھے، ابن حزم نے آپ کو جو مجہول کہا ہے اس کا کوئی اعتبار نہیں ہے۔ [تذكرة الحفاظ] امام حافظ ابن حجر عسقلانی: امام حافظ ابن حجر عسقلانی کا بیان ہے: ”وہ حفظ اور ثقاہت کے اعتبار سے دنیا کے اماموں میں سے ایک تھے۔“ [تقريب التهذيب] حافظ ابن حجر فتح الباری کے مقدمہ میں لکھتے ہیں: ”ترمذی نے بخاری سے علم حاصل کیا، اور آپ پر کافی اعتماد کیا۔“ [هدي الساري: 492] طاش کبری زادہ: طاش کبری زادہ لکھتے ہیں: ”یہ حافظ حدیث، اور ان ائمہ اعلام میں سے ہیں اور انہیں فقہ میں بھی مہارت تھی انہوں نے ائمہ حدیث کی ایک جماعت سے احادیث حاصل کیں اور صدر اول کے مشائخ سے ان کی ملاقات ہوئی۔“ [مفتاح السعاده] ابن عماد حنبلی: ابن عماد حنبلی کہتے ہیں: امام ترمذی اپنے ہم عصروں میں واضح مقام رکھتے تھے۔ اور حفظ اور اتقان میں وہ ایک نشانی، نمونہ تھے۔ [كتاب شذرات الذهب] امام ترمذی متفقہ طور پر ثقہ محدث، ناقد حدیث اور امام دین ہیں، آپ کی تصانیف مشہور و معروف ہیں، لیکن اس شہرت اور امامت کے علی الرغم ابن حزم نے آپ کے بارے میں کتاب الاتصال کے باب الفرائض میں یہ کہہ دیا کہ آپ مجہول راوی ہیں، اس پر علماء نے نکیر کی، ◈ حافظ ذہبی: حافظ ذہبی میزان الاعتدال میں کہتے ہیں: ”ترمذی حافظ اور اعلام میں سے ہیں، جامع کے مؤلف اور متفق علیہ ثقہ ہیں، ابن حزم کا یہ کہنا کہ ترمذی مجہول ہیں، لائق التفات بات نہیں ہے، ابن حزم نے نہ ترمذی کو جانا اور نہ ہی جامع ترمذی اور علل ترمذی کے وجود کا انہیں علم تھا۔“ [ميزان الاعتدال] ◈ امام ذہبی سیر أعلام النبلاء میں ابن حزم کے فضائل اور عیوب کے گنانے کے بعد فرماتے ہیں: ”مجھے ابومحمد ابن حزم سے ان کی صحیح حدیث سے محبت اور اس کی معرفت کی بنا پر محبت ہے، گرچہ میں ان کے علم رجال، علل حدیث اور اصول و فروع میں غلط مسائل کی کثرت کی وجہ سے ان کی موافقت نہیں کرتا، اور کئی مسئلے میں قطعی طور پر ان کو غلط کہتا ہوں، لیکن نہ تو ان کی تکفیر کرتا ہوں، اور نہ انہیں گمراہ کہتا ہوں، ان کے لیے اللہ تعالیٰ سے عفو و درگزر کا امیدوار ہوں، ان کے ذہن کی تیزی اور علم کی وسعت کا قائل و معترف ہوں، میں نے دیکھا کہ انہوں نے ایک شخص کا یہ قول ذکر کیا کہ سب سے عظیم اور اہم کتاب موطأ امام مالک ہے، اس پر تبصرہ کرتے ہوئے کہا: بلکہ سب سے عظیم کتابیں صحیح بخاری، صحیح مسلم، صحیح ابن السکن، منتقی ابن الجارود، اور منتقی قاسم بن اصبغ ہے، پھر اس کے بعد سنن ابی داود، سنن نسائی، مصنف قاسم بن اصبغ، مصنف ابی جعفر الطحاوی کا نمبر آتا ہے، ◈ ذہبی کہتے ہیں: ابن حزم نے نہ تو ابن ماجہ کا ذکر کیا اور نہ ہی جامع ترمذی کا، یہ دونوں کتابیں ابن حزم نے دیکھی نہ تھی، بلکہ ان کی موت کے بعد یہ دونوں کتابیں اندلس پہنچیں۔ [سير أعلام النبلاء] ◈ حافظ ابن حجر: حافظ ابن حجر تہذیب التہذیب میں کہتے ہیں: خلیلی نے ترمذی کو متفق علیہ ثقہ کہا ہے، لیکن ابن حزم نے اپنے بارے میں یہ اعلان کیا کہ انہیں اس بارے میں علم نہیں تھا اس لیے کہ انہوں نے کتاب الاتصال کے کتاب الفرائض میں محمد بن عیسیٰ ترمذی کو مجہول کہا، ہرگز کوئی کہنے والا یہ نہ کہے کہ شاید ابن حزم نے ترمذی کو نہ جانا اور نہ ان کے حفظ اور ان کی تصانیف پر مطلع ہوئے، اس لیے کہ یہ حضرت مشاہیر ثقات حفاظ کی ایک جماعت کے بارے میں اس طرح کی عبارات استعمال کرتے ہیں، جیسے ابوالقاسم البغوی اسماعیل بن محمد الصفار اور ابوالعباس الاصم وغیرہ وغیرہ۔ تعجب یہ ہے کہ حافظ ابن الفرضی نے اپنی کتاب المؤتلف والمختلف میں ترمذی کا تذکرہ کیا، اور ان کی علمی منزلت کو واضح کیا، تو ابن حزم کیسے ان معلومات کی آگاہی سے چوک گئے۔ [تهذيب التهذيب] واضح رہے کہ مشاہیر کے سلسلے میں اس طرح کی عدم واقفیت ابن حزم ہی کے ساتھ خاص نہیں ہے، امام بیہقی کے بارے میں آتا ہے کہ ان کے پاس سنن نسائی، جامع ترمذی اور سنن ابن ماجہ نہیں تھیں، ہاں ان کے پاس حاکم کی مستدرک علی الصحیحین تھی، جس سے انہوں نے بکثرت احادیث روایت کی۔ [تذكرة الحفاظ، مقدمه تحفة الأحوذي 271/1] عقیدہ:​ امام ترمذی کا عقیدہ: اللہ رب العزت نے اپنے دین کی حفاظت کا وعدہ فرمایا ہے، اور مادی اسباب کی دنیا میں گروہ محدثین کو اس بات کی توفیق دی کہ وہ کتاب و سنت کی محبت سے سرشار ہو کر اس کی ممکن خدمت کریں، چنانچہ طلب علم سے لے کر تدوین حدیث کے مختلف مراحل تک کتاب و سنت کو صحیح سندوں کے ساتھ اور صحیح معانی و مفاہیم کو محفوظ رکھنے کی جدوجہد میں اس گروہ کو نمایاں مقام حاصل ہے، اور آیت کریمہ: «إنا نحن نزلنا الذكر وإنا له لحافظون» کی عملی تفسیر ائمہ اسلام کی یہی جدوجہد ہے، جس کے نتیجے میں دینی نصوص صحیح سندوں اور سلف صالحین کی تعبیرات کے ساتھ محفوظ ہیں، امام ترمذی سلسلہ محدثین کی اہم کڑی ہیں، جنہوں نے حدیث کی حفاظت و تدوین کے ساتھ ساتھ جرح و تعدیل رواۃ پر بھی بڑا سرمایہ چھوڑا اور فہم حدیث کے سلسلہ میں بھی آپ کی کوششوں سے مسلک سلف ہم تک پہنچا، صحیح اسلامی عقائد کو بھی آپ نے امت تک پہنچایا، اسی وجہ سے سنن الترمذی کی افادیت کے ایک سے زیادہ پہلو کی ائمہ نے صراحت کی ہے۔ امام ترمذی عقائد کے باب میں بھی امام ہدیٰ تھے، اور اپنے شیوخ کے نقش قدم پر سنن ترمذی میں اسماء و صفات کے بارے میں اپنے پیش رو ائمہ کے اقوال و مذاہب کو جگہ دیتے ہیں، چنانچہ کتاب صفۃ الجنۃ میں باب «ما جاء فى خلود اهل الجنة واهل النار» کے تحت ابوہریرہ رضی اللہ عنہ سے رویت باری تعالیٰ سے متعلق حدیث روایت کر کے فرماتے ہیں: رویت باری سے متعلق نبی اکرم صلی اللہ علیہ وسلم سے بہت ساری احادیث مروی ہیں، جس میں یہ ہے کہ لوگ اپنے رب کو دیکھیں گے اور یہ کہ اللہ تعالیٰ کے لیے قدم کا ذکر ہے، اور اس طرح کے دوسرے مسائل کا ذکر ہے، اس بارے میں اہل علم ائمہ جیسے سفیان ثوری، مالک بن انس، ابن مبارک، سفیان بن عیینہ، وکیع وغیرہ کا مذہب یہ ہے کہ ان حضرات نے صفات باری تعالیٰ سے متعلق احادیث کی روایت کی، پھر فرمایا: یہ احادیث روایت کی جائیں گی اور ان پر ایمان بھی لایا جائے گا، اور ان صفات کی کیفیت کے بارے میں سوال نہیں کیا جائے گا کہ ان کی کیفیت اور حقیقت کیا ہے، یہ اہل حدیث کا اختیار کردہ مذہب ہے کہ احادیث جیسی آئی ہیں، ان کو ویسے ہی روایت کیا جائے گا اور ان پر ایمان لایا جائے گا، اور ان کی تفسیر نہ بیان کی جائے گی، اور نہ اس میں اپنے وہم و گمان سے بات کی جائے گی اور نہ یہی کہا جائے گا کہ ان کی کیفیت کیا ہے، ان صفات کے بارے میں اہل علم کا یہی مختار مذہب ہے۔ [سنن الترمذي 691/4] تقریباً اسی طرح کی بات امام موصوف نے کتاب التفسیر کے باب تفسیر سورۃ المائدۃ میں لکھی ہے، حدیث یہ ہے: «عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: ”يَمِينُ الرَّحْمَنِ مَلأَى سَحَّاءُ لاَ يُغِيضُهَا اللَّيْلُ وَالنَّهَارُ قَالَ أَرَأَيْتُمْ مَا أَنْفَقَ مُنْذُ خَلَقَ السَّمَوَاتِ وَالأَرْضَ؛ فَإِنَّهُ لَمْ يَغِضْ مَا فِي يَمِينِهِ وَعَرْشُهُ عَلَى الْمَاءِ وَبِيَدِهِ الأُخْرَى الْمِيزَانُ يَرْفَعُ وَيَخْفِضُ“ قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.» «وَتَفْسِيرُ هَذِهِ الآيَةِ: *** وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَةٌ غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنْفِقُ كَيْفَ يَشَاءُ *** وَهَذَا حَدِيثٌ قَدْ رَوَتْهُ الأَئِمَّةُ نُؤْمِنُ بِهِ كَمَا جَاءَ مِنْ غَيْرِ أَنْ يُفَسَّرَ أَوْ يُتَوَهَّمَ هَكَذَا قَالَ غَيْرُ وَاحِدٍ مِنَ الأَئِمَّةِ مِنْهِمْ سُفْيَانُ الثَّوْرِيُّ، وَمَالِكُ بْنُ أَنَسٍ، وَابْنُ عُيَيْنَةَ، وَابْنُ الْمُبَارَكِ أَنَّهُ تُرْوَى هَذِهِ الأَشْيَاءُ وَيُؤْمَنُ بِهَا، وَلاَيُقَالُ كَيْفَ.» ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ کا داہنا ہاتھ بھرا ہوتا ہے، (کبھی خالی نہیں ہوتا) بخشش و عطا کرتا رہتا ہے، رات و دن لٹانے اور اس کے دیتے رہنے سے بھی کمی نہیں ہوتی“، آپ نے فرمایا: ”کیا تم لوگوں نے دیکھا (سوچا؟) جب سے اللہ نے آسمان پیدا کیے ہیں کتنا خرچ کر چکا ہے؟ اتنا کچھ خرچ کر چکنے کے باوجود اللہ کے ہاتھ میں جو کچھ ہے اس میں کچھ بھی کمی نہیں ہوئی۔ اس کا عرش پانی پر ہے، اس کے دوسرے ہاتھ میں میزان ہے وہ اسے بلند کرتا اور جھکاتا ہے (جسے چاہتا ہے زیادہ دیتا ہے اور جسے چاہتا ہے کم)۔“ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔ پھر فرماتے ہیں: یہ حدیث اس آیت «وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَةٌ غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنْفِقُ كَيْفَ يَشَاءُ» ”اور یہودیوں نے کہا کہ اللہ تعالیٰ کے ہاتھ بندھے ہوئے ہیں، انہی کے ہاتھ بندے ہوئے ہیں اور ان کے اس قول کی وجہ سے ان پر لعنت کی گئی، بلکہ اللہ تعالیٰ کے دونوں ہاتھ کھلے ہوئے ہیں، جس طرح چاہتا ہے خرچ کرتا ہے“۔ [المائده: 64] کی تفسیر ہے، اس حدیث کے بارے میں ائمہ دین کی روایت یہ ہے کہ ان پر ویسے ہی ایمان لائیں گے جیسے کہ ان کا ذکر آیا ہے، ان کی نہ کوئی تفسیر کی جائے گی اور نہ ہی کسی طرح کا وہم و قیاس لڑایا جائے گا۔ ایسا ہی بہت سے ائمہ کرام: سفیان ثوری، مالک بن انس، سفیان بن عیینہ، ابن مبارک وغیرہم نے کہا ہے۔ یہ چیزیں ایسی ہی بیان کی جائیں گی جیسی بیان کی گئی ہیں اور ان پر ایمان رکھا جائے گا لیکن ان کی کیفیت کے بارے میں سوال نہیں کیا جائے گا۔ [سنن الترمذي: 3045] ↰ یہ حدیث متفق علیہ ہے۔ [ملاحظه هو: خ/تفسير هود 2، 4684، والتوحيد 19، 7411، و 22، 7419، م/الزكاة 11، 993] امام ترمذی نے اس حدیث میں بھی ائمہ سلف کا صفات باری تعالیٰ کے بارے میں اجماعی عقیدہ نقل کیا ہے، یعنی اللہ تعالیٰ نے اپنے لیے جن اسماء و صفات کا ذکر کیا ہے اس کی نہ تو بےجا تاویل کی جائے گی اور نہ ہی کوئی غلط تفسیر، یعنی یہ نہیں کہا جائے گا کہ اس کا ہاتھ ایسا ایسا ہے بلکہ جیسی اس کی ذات ہے ایسے ہی اس کا ہاتھ بھی ہے، اس کی کیفیت بیان کئے بغیر اس پر ایمان لانا ضروری ہے۔ ایسے ہی کتاب صفۃ القیامۃ کے باب «في القيامه ميں عدي بن حاتم رضي الله عنه» کی حدیث: «ما منكم من رجل إلا سيكلمه ربه يوم القيامة وليس بينه وبينه ترجمان...» إلخ. ”تم میں سے ہر آدمی سے قیامت کے دن اللہ تعالیٰ بات کرے گا، اور اس کے اور اللہ کے درمیان کوئی مترجم نہیں ہو گا“۔ اس حدیث میں اللہ رب العزت کی صفت کلام کا ذکر ہے، اس کی روایت کے بعد امام ترمذی کہتے ہیں کہ ہم سے ابوالسائب نے بیان کیا کہ وکیع نے اعمش سے اس حدیث کی روایت کے بعد فرمایا: ”یہاں پر خراسان والوں میں سے جو موجود ہو اس کو اللہ سے ثواب حاصل کرنے کی نیت سے خراسان میں اس حدیث کو بیان کرنا چاہئے اس لیے کہ جہمیہ صفت کلام باری تعالیٰ کا انکار کرتے ہیں“۔ [ 611/4] صحیح سنت پر عمل کرنے، اس کے مطابق فتویٰ دینے، اس کی نشر و اشاعت کرنے، اور اس کے مخالف مسلک کے رد و ابطال میں یہ مثال بھی بےجا نہ ہو گی کہ امام ترمذی نے یہ حدیث ذکر کی کہ نبی اکرم صلی اللہ علیہ وسلم نے حج میں ہدی (قربانی) کے جانور کا اشعار کیا، یعنی ان کو زخمی کر کے یہ ظاہر کیا کہ یہ ہدی (قربانی کا جانور) ہے، اپنی سند سے اس حدیث کو امام وکیع سے روایت کرنے کے بعد ان کا یہ قول نقل کیا: اس مسئلہ میں اہل رائے کے قول کو نہ دیکھو اس لیے کہ اشعار سنت ہے، اور ان کا قول بدعت ہے۔ امام ترمذی کہتے ہیں: میں نے ابوالسائب کو یہ کہتے سنا کہ ہم وکیع کے پاس تھے تو انہوں نے ایک آدمی سے جو رائے میں پڑتا تھا اس سے کہا: رسول اللہ صلی اللہ علیہ وسلم نے ہدی کے جانور کا اشعار کیا، اور ابوحنیفہ کہتے ہیں کہ اشعار مثلہ ہے، تو اس آدمی نے کہا: ابراہیم نخعی سے مروی قول ہے کہ اشعار مثلہ ہے، تو میں نے دیکھا کہ امام وکیع سخت غصہ ہوئے، اور کہا کہ میں تم سے کہتا ہوں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اور تم کہتے ہو کہ ابراہیم نخعی کہتے ہیں، تم کتنا زیادہ اس بات کے حقدار ہو کہ تم کو جیل میں بند کر دیا جائے اور اس وقت تک تم کو وہاں سے نہ نکالا جائے جب تک کہ تم اپنے اس قول سے باز نہ آ جاؤ۔ [سنن الترمذي 241/3] اسی طرح سے کتاب النکاح میں امام ترمذی نے باب «ماجاء فى المحل والمحلل له» میں اس موضوع پر علی، اور عبداللہ بن مسعود رضی اللہ عنہما سے دو حدیثیں روایت کیں کہ رسول اکرم صلی اللہ علیہ وسلم نے حلالہ کرنے اور حلالہ کروانے والے پر لعنت بھیجی ہے، اور ذکر کیا کہ صحابہ اور فقہائے تابعین اور دوسرے علمائے دین کا اس حدیث پر عمل رہا ہے، پھر کہا: میں نے جارود بن معاذ کو سنا کہ وکیع بھی یہی فتویٰ دیتے تھے، اور وکیع نے کہا: اس باب سے اہل رائے کے قول کو رد کر دینا چاہئے، اور وکیع سے روایت ہے کہ سفیان ثوری کہتے ہیں: آدمی جب عورت سے نکاح اس نیت سے کرے کہ وہ اسے (پہلے شوہر کے لیے) حلال کرے گا پھر اسے اس عورت کو اپنی زوجیت میں رکھ لینا ہی بھلا معلوم ہو تو وہ اسے اپنی زوجیت میں نہیں رکھ سکتا جب تک کہ اس سے نئے نکاح کے ذریعے سے شادی نہ کرے۔ [1119، 1120] اس مثال میں واضح طور پر امام ترمذی نے جمہور ائمہ حدیث وائمہ فقہ کے مقابلے میں حدیث کے مخالف اہل رائے کا حلالہ کے بارے میں فتویٰ نقل کیا، اور اس پر وکیع اور سفیان ثوری کے قول کے ذریعے واضح طور پر تردید کی، اور یہ معلوم ہے کہ اصحاب رائے سے مراد امام ابوحنیفہ اور ان کے اصحاب ہیں، ان لوگوں کا کہنا ہے کہ نکاح حلالہ صحیح ہے گو حلال کرنے کی ہی نیت سے ہو۔ ان کی رائے کو چھوڑ دینا اس لیے مناسب ہے کہ ان کا یہ قول حدیث کے مخالف ہے۔ شروع ہی سے عقائد کے باب میں انحراف کی روش رکھنے والوں کی کج فکری اور اعتقادی گمراہیوں پر نقد و نظر ائمہ دین کے یہاں بہت معروف و مشہور بات ہے، بلکہ راہ اعتدال سے ہٹ جانے والے حضرات پر تنقید سلف صالحین کا شعار اور منہج رہا ہے، بالخصوص محدثین عظام نے یہ کام بڑی ذمہ داری سے انجام دیا، گمراہ فرقوں اور ان کے ائمہ اور ان کے مقالات و اعتقادات پر کھل کر تنقید کی، سلفی عقائد و اصول اور اتباع سنت کے مضامین کو خوب اچھی طرح سے بیان کیا۔ معتزلہ، جہمیہ، قدریہ، جبریہ وغیرہ، گمراہ فرقوں کے خلاف ائمہ حدیث کے مقدس گروہ نے شروع ہی سے جنگ چھیڑی، معتزلہ اور جہمیہ کے رد کے نام سے مستقل کتابیں لکھیں اور عقائد کی کتابوں میں ان گمراہ عقائد پر کھل کر تنقید کی، امام احمد بن حنبل تو مسئلہ خلق قرآن کے خلاف فتوے پر ڈٹے رہنے کی بنا پر امام اہل سنت و الجماعت کے لقب سے مشہور ہوئے، ان کے شاگرد رشید امام بخاری نے خلق أفعال العباد نامی مستقل رسالہ لکھا، اور صحیح بخاری میں کتاب العلم، کتاب الإیمان، کتاب التوحید والرد علی الجہمیہ، کتاب الاعتصام بالکتاب والسنہ وغیرہ وغیرہ کتب میں اتباع سنت اور عقیدہ سلف کی خوب خوب وضاحت کی، امام احمد کے تلامذہ میں امام ابوداود نے اپنی سنن میں کتاب السنہ کے نام سے یہ خدمت انجام دی، امام ترمذی نے کتاب العلم، کتاب الإیمان، کتاب القدر اور کتاب صفۃ القیامۃ وغیرہ میں ان مسائل پر روشنی ڈالی، اگر ائمہ حدیث کی عقائد سلف کی شرح و وضاحت اور منحرفین کے رد و ابطال سے متعلق کتب و رسائل کی محض فہرست ذکر کی جائے تو یہ مقدمہ طویل ہو جائے گا، میں نے امام وکیع بن الجراح کی کتاب الزہد کی تحقیق میں ائمہ دین کی ان کتابوں کا تذکرہ کیا ہے، اس باب میں علامہ عبدالسلام مبارک پوری کی کتاب سیرۃ البخاری کے ساتویں باب عقائد اور علم کلام کا مطالعہ مفید ہو گا۔ سلف صالحین کتاب وسنت کے صحیح دلائل کی روشنی میں عقیدہ کے ہر چھوٹے بڑے مسئلہ کو سمجھتے، اور اس پر ایمان رکھتے، اس کی دعوت دیتے تھے، اور اس کے خلاف ہر رائے اور عقیدے کا رد و ابطال کرتے تھے، اور فلاسفہ اور متکلمین کی موشگافیوں کو سخت ناپسند کرتے تھے، اس سلسلے میں امام مالک کے اقوال کافی مشہور ہیں، جن میں سے آپ کا یہ قول عقیدہ سلف کی نمائندگی واضح طور پر کرتا ہے: «الاستواء معلوم والكيف مجهول والإيمان به واجب والسؤال عنه بدعة.» یعنی ”اللہ رب العزت نے قرآن میں جو اپنے بارے میں فرمایا ہے کہ وہ عرش پر مستوی ہے، تو استواء کا معنی و مفہوم معلوم و مشہور بات ہے، لیکن یہ استواء کیسے ہو گا، اس کی کیفیت کا علم نہیں ہے، اور اس پر ایمان لانا واجب اور فرض ہے، اور اس سلسلے میں سوال و جواب کرنا بدعت ہے“۔ امام مالک نے یہ بات اس وقت کہی جب ایک آدمی نے آپ سے اللہ کے عرش پر مستوی ہونے کی کیفیت کے بارے میں سوال کیا، اسی طرح سے امام بخاری کو خلق قرآن کے مسئلہ پر نیساپور میں جب کچھ کہنے کے لیے مجبور کیا گیا تو آپ نے یہ تاریخی جملہ ارشاد فرمایا: «القرآن كلام الله غير مخلوق وأفعال العباد مخلوقة والامتحان بدعة.» یعنی ”قرآن کریم اللہ تعالیٰ کا کلام ہے، مخلوق نہیں ہے، اور بندوں کے افعال مخلوق ہیں، یعنی ان کو اللہ تعالیٰ نے پیدا کیا ہے، اور اس مسئلے پر کسی کو امتحان میں ڈالنا اور اس سے پوچھ گچھ کرنا بدعت ہے۔“ [مقدمة فتح الباري: 490] سلف کا منہج عقائد کے بارے میں یہ تھا کہ وہ علم کلام کے مسائل میں زیادہ غور و خوض کو سخت ناپسند کرتے تھے، اور ان مسائل میں سوال جواب کو بدعت کہتے تھے، امام احمد بن حنبل اس باب میں بہت سخت موقف رکھتے تھے، چنانچہ خلق قرآن کے مسئلے میں کتاب وسنت کے علاوہ اور کسی بات کے سننے کے قائل نہ تھے، احادیث رسول سے اس مسلک کی تقویت ہوتی ہے۔ چنانچہ خود امام ترمذی نے «كِتَاب الْقَدَرِ، بَاب مَا جَاءَ فِي التَّشْدِيدِ فِي الْخَوْضِ فِي الْقَدَرِ:» ‏‏‏‏ میں نیز امام ابن ماجہ نے اپنی سنن میں یہ حدیث نقل کی ہے: «عَنْ أَبِي هُرَيْرَةَ قَالَ: خَرَجَ عَلَيْنَا رَسُولُ اللهِ صلى الله عليه وسلم وَنَحْنُ نَتَنَازَعُ فِي الْقَدَرِ، فَغَضِبَ حَتَّى احْمَرَّ وَجْهُهُ، حَتَّى كَأَنَّمَا فُقِئَ فِي وَجْنَتَيْهِ الرُّمَّانُ، فَقَالَ: أَبِهَذَا أُمِرْتُمْ أَمْ بِهَذَا أُرْسِلْتُ إِلَيْكُمْ؟ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ حِينَ تَنَازَعُوا فِي هَذَا الأَمْرِ، عَزَمْتُ عَلَيْكُمْ أَلاَّ تَتَنَازَعُوا فِيهِ» ”ابوہریرہ رضی اللہ عنہ کہتے ہیں: (ایک دن) رسول اللہ صلی اللہ علیہ وسلم ہماری طرف نکلے، اس وقت ہم سب تقدیر کے مسئلہ میں بحث و مباحثہ کر رہے تھے، آپ غصہ ہو گئے یہاں تک کہ آپ کا چہرہ سرخ ہو گیا اور ایسا نظر آنے لگا گویا آپ کے گالوں پر انار کے دانے نچوڑ دئیے گئے ہوں۔ آپ نے فرمایا: ”کیا تمہیں اسی کا حکم دیا گیا ہے، یا میں اسی واسطے تمہاری طرف نبی بنا کر بھیجا گیا ہوں؟ بے شک تم سے پہلی امتیں ہلاک ہو گئیں جب انہوں نے اس مسئلہ میں بحث و مباحثہ کیا، میں تمہیں قسم دلاتا ہوں کہ اس مسئلہ میں بحث ومباحثہ نہ کرو“۔ تقدیر پر ایمان لانا فرض ہے، یعنی یہ اعتقاد رکھنا کہ بندوں کے اچھے اور برے اعمال کا خالق اللہ تعالیٰ ہے اور ان کا ظہور اللہ کے قضاء و قدر اور اس کے ارادے و مشیئت پر ہے، اور اس کا علم اللہ کو پوری طرح ہے، لیکن ان امور کا صدور خود بندے کے اپنے اختیار سے ہوتا ہے، مگر اللہ تعالیٰ اچھے اعمال کو پسند کرتا ہے، اور برے اعمال کو ناپسند کرتا ہے، اور اسی اختیار کی بنیاد پر جزا و سزا دیتا ہے، تقدیر کے مسئلہ میں عقل سے غور و خوض اور بحث و مباحثہ جائز نہیں، کیوں کہ اس کا کوئی فائدہ نہیں بلکہ الٹا گمراہی کا خطرہ ہے۔ اوپر کی گزارشات سے یہ واضح ہو گیا کہ سلف صالحین کے نزدیک باطل عقائد کا رد و ابطال کتاب وسنت کے دلائل اور سلف کے اقوال سے ہوتا ہے، اور یہی صحیح علم کلام ہے، صحابہ کرام کے زمانے میں خوارج، قدریہ اور روافض جیسے فرقوں کا فتنہ موجود تھا، خود صحابہ کرام نے تمام مسائل پر کتاب وسنت کی روشنی میں کلام کیا، اور محدثین نے اسی اسلوب کو آگے بڑھا کر ہر طرح کے منحرف فرقوں اور ان کے آراء و اقوال کا رد و ابطال کیا، ساتھ ہی غیر سلفی منہج و فکر پر مبنی علم کلام اور اس سے تعلق رکھنے والوں سے خود دور رہنے اور دوسروں کو ان سے دور رہنے کی تلقین اور وصیت فرمائی تاکہ نہ خود ان کے میل جول سے متاثر ہوں اور نہ ہی وہ اس تعلق کے ذریعے افراد امت کو گمراہ کر سکیں۔"
}